{
	"data":[
		{
			"name":"Accessory Vendor",
			"desc":"Used to buy, sell, and equip various cosmetics that other players can see.",
			"location":"Usually at the front desk of a clothing store."
		},
		{
			"name":"ATM",
			"desc":"Used to deposit and withdraw money. ATMs can be robbed by any job by equipping a crowbar and repeatedly right clicking the ATM. Starting a robbery will sound an alarm that nearby players will be able to hear. The amount you can rob depends on how many players are on the server, but robbing an ATM does not take away money from other players.",
			"location":"Usually in the main lobby of the city bank."
		},
		{
			"name":"Car Dealer",
			"desc":"Used to buy, sell, and store vehicles. When selling a vehicle, you will receive 75% of the vehicle's current price. Spawning a new vehicle will remove and store your old one, so be aware of the server rules regarding that. Mechanics can also use the car dealer to rent out vehicles to other players, and to sell stolen vehicles that people bring in.",
			"location":"Front desk of the car dealership."
		},
		{
			"name":"Contraband Dealer",
			"desc":"Sells a variety of items that are illegal by default such as weed plants and money printers. The mayor can decide for each item whether or not it should remain illegal, though items that are declared legal will still be sold at this dealer. To help prevent camping, the contraband dealer will occasionally move between four different locations.",
			"location":"Hidden or less populated areas such as alleys or an outskirts road."
		},
		{
			"name":"Dumpster",
			"desc":"Contains trash, but allows players to loot for a chance of getting an item of value. Normal items have a 40% chance of spawning, and can range from simple fish bait to a crafting blueprint. Rare items have a 1% chance of spawning, and include drugs and weapons. Once a dumpster is searched, a 2 minute cooldown will be in effect before it can be searched again.",
			"location":"Parking lots of popular buildings such as stores, gas stations, car dealerships, and hospitals."
		},
		{
			"name":"Farmer",
			"desc":"Used to sell farm food from crates. The amount of money you get depends on how much of each food type you have.",
			"location":"Usually in grassy areas of the main city such as parks or gardens."
		},
		{
			"name":"Firefighter",
			"desc":"Used by firefighters to spawn fire trucks and ambulances at the fire station. Vehicles spawned from here will be removed if the player who owns them changes jobs or leaves the server.",
			"location":"Front desk or main lobby of the fire station."
		},
		{
			"name":"Fisherman",
			"desc":"Used to purchase fishing equipment such as bait, rods, and cages. Once you have caught some fish, you can go back and sell them for a profit.",
			"location":"Usually on a dock near a large body of water."
		},
		{
			"name":"Gas Pumps",
			"desc":"Used as a faster but more expensive alternative to fuel cans. Gas price depends on how empty your tank is, and how high the sales tax is. Law enforcement and government jobs can get free gas as long as the sales tax is under 50%.",
			"location":"All gas stations."
		},
		{
			"name":"Bank Vault",
			"desc":"Contains all of the funds used by the city. Up to $20,000 can be robbed from the bank, though this will scale depending on how much is actually in the bank. The minimum amount that can be robbed is $4,000. A robbery cannot start without at least 2 cops, or 1 cop and 1 banker, being on the server. A robbery can end prematurely if the robber leaves the area or the server. When this happens, existing bags will not despawn and can still be cashed, but more bags will not spawn. A bag containing $4,000 will spawn every 2 minutes during a robbery under normal conditions, which means the maximum amount of time it can take to rob is 10 minutes. Stolen money bags can be cashed in by civilian jobs at the smuggler. The bags can also be returned to the vault by cops and bankers.",
			"location":"Inside the vault of the city bank."
		},
		{
			"name":"Healer",
			"desc":"Sells items to replenish health and armor.",
			"location":"Front desk of the hospital."
		},
		{
			"name":"Smelter",
			"desc":"Used to turn craftable items back into its raw materials, and to smelt iron into steel for crafting. Touch a compatible item with it to start the smelting process. Smelting time varies depending on how much the item is worth. Iron that is output by the smelter cannot be placed back in until a player puts the iron in their inventory and takes it back out.",
			"shop":"Supermarket"
		},
		{
			"name":"Item Bank",
			"desc":"Storage unit that acts as a static, extended version of the player's inventory.",
			"location":"Main area of the city bank, usually near the ATMs."
		},
		{
			"name":"Mayors Secretary",
			"desc":"Used to enter mayor elections. An election will start once at least two players have entered. An election cannot be started if there is already a mayor in office.",
			"location":"Front desk of city hall."
		},
		{
			"name":"Police Secretary",
			"desc":"Used by law enforcement and government officials to spawn police cars, SWAT trucks, and the mayor's limo. Vehicles spawned from here will be removed if the player who owns them changes to a civilian job or leaves the server.",
			"location":"Front desk of the police station."
		},
		{
			"name":"Purifier",
			"desc":"Purifies raw cocaine into a form that can be sold or consumed. Each raw coke can take up to 16 minutes to fully purify, but you can stop the purifying process early to get a product that isn't 100% pure by pressing your use key on the purifier. Once the coke is done purifying, it will spawn next to the purifier. The purifier also has a small chance of overheating and catching fire while running.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Supermarket",
			"desc":"Sells a wide variety of items such as low-grade weapons, vehicle repair tools, and media players. The supermarket only sells items that are legal by default, although some items that are sold can be used illegally. Purchases made here are affected by sales tax set by the mayor.",
			"location":"Stores located in popular areas of the city and/or outskirts."
		},
		{
			"name":"Smuggler",
			"desc":"Used to sell illegal or stolen items. To use, press your use key on the NPC with the your item nearby. You will then receive payment and the item will be removed. To help prevent camping, the smuggler will occasionally move between four different locations.",
			"location":"Usually in outskirts as far away from the main city as possible."
		},
		{
			"name":"Soda Machine",
			"desc":"Vending machine that deposits sodas, which restore a small amount of health. Each soda costs $30.",
			"location":"Near the entrance of popular buildings such as city hall, PD, and the bank."
		},
		{
			"name":"Trucker",
			"desc":"Used by the mechanic to spawn tow trucks.",
			"location":"Front desk of the garage or repair shop."
		},
		{
			"name":"Speed Radar",
			"desc":"Tracks the speed of a vehicle. To place it, aim close to the ground and left click. To remove it, walk up to it and right click. The fastest speed the radar has detected will be displayed on the radar itself. When a speeder passes by, the officer will be notified of their name and what car they are driving.",
			"user":"Police Chief and Police Officer"
		},
		{
			"name":"Handcuffs/Shackles",
			"desc":"Restrains a player to prevent them from using weapons or running away. To cuff a player, left click. To uncuff a player, press your use key on them.",
			"user":"All police jobs",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Leash",
			"desc":"Similar to the police handcuffs but allows the detaining officer to drag the cuffed player along with them, as well as blind and gag them. Press reload while looking at a cuffed player to attach the leash, press left click to blind them, and press right click to gag them.",
			"user":"SWAT",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Police Badge",
			"desc":"Shiny badge to show someone that you are a real cop.",
			"user":"All police jobs",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Spike Strip",
			"desc":"Stops a vehicle by popping its tires. Vehicles with popped tires won't stop immediately after running over the strip. They will continue to move for a few seconds before slowing down enough to be stopped by another force. Spike strips that are left on the ground for 10 minutes will be removed and given back to the officer who placed it.",
			"user":"All police jobs except undercover officer"
		},
		{
			"name":"Taser",
			"desc":"Non-lethal weapon that delivers a high-voltage shock to its target, preventing them from moving temporarily. Takes 3 seconds to charge up before firing. Takes special ammo that police can obtain from an ammo locker. Non-police will need to rob an ammo locker with the taser in their weapon slot to obtain ammo.",
			"user":"All police jobs",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Handheld Metal Detector",
			"desc":"Right click scans for any weapons that the target player may have on them. If weapons are detected, the device will beep and display what weapons were found in the user's chat. Unlike the large walk-through metal detector, this will not detect explosives or weapons in a players inventory. When left clicking while aimed at a handcuffed player, the detector allows the user to view and take illegal weapons and tools from the target's weapon slots. Confiscated items will be given to the user, or spawned next to them if they already have the same item.",
			"user":"All police jobs and the detective",
			"shop":"Supermarket"
		},
		{
			"name":"Battering Ram",
			"desc":"Breaks down doors owned by players with active search warrants. Right click to hold it up into position and left click in front of the target door to force it open.",
			"other":"Using the SWAT locker"
		},
		{
			"name":"Arrest/Unarrest Sticks",
			"desc":"The arrest stick teleports a player to jail after they have been cuffed. Users can select the type of sentence they want the arrestee to serve. A reduced sentence will send the player to jail for 5 minutes and automatically release them. The full sentence will send the player to jail indefinitely until they are manually released. The unarrest stick releases a player serving a reduced sentence early and teleports them back to spawn.",
			"user":"All police jobs"
		},
		{
			"name":"Car Bomb Checker",
			"desc":"Scans for and defuses car bombs. Left click to scan the target vehicle for car bombs, and right click to defuse and remove the bomb if it exists.",
			"other":"Using the SWAT locker"
		},
		{
			"name":"Car Bomb Protection",
			"desc":"Prevents players from planting car bombs on the target vehicle. To apply to a vehicle, touch the item with the vehicle. If the vehicle is respawned, its car bomb protection status will be removed.",
			"shop":"F4 Menu",
			"user":"Mechanic"
		},
		{
			"name":"Vehicle Management Tool",
			"desc":"Tool with handy functions to make locked vehicles easier to tow. Left click to release the brakes on the target vehicle, and right click to rotate the vehicle 180 degrees.",
			"user":"Mechanic"
		},
		{
			"name":"Repair Tool",
			"desc":"Fixes broken vehicles. Left click to gradually repair the target vehicle, and right click to repair the target vehicle's tires.",
			"user":"Mechanic"
		},
		{
			"name":"Tow Equipment",
			"desc":"Attaches the tow truck to a vehicle that needs towed. To use, back your tow truck up to the very front of the target vehicle and left click while looking at the back of the tow truck.",
			"user":"Mechanic"
		},
		{
			"name":"Fuel Can",
			"desc":"Fills up a vehicle with fuel. To use, walk up to a vehicle and left click. The can holds an infinite amount of fuel and does not need refilled or replaced.",
			"user":"Mechanic"
		},
		{
			"name":"Money Bag",
			"desc":"Duffel bag that contains a varying amount of money, depending on where it came from. If the bag came from a deposit box, its owner can press their use key on it to collect the money. If the bag was robbed from the bank, civilian jobs can cash it in at the smuggler. Stolen bags can also be returned to the vault by police and the banker.",
			"other":"Robbing the bank, robbing a deposit box, withdrawing from a deposit box, or collecting during a banker event."
		},
		{
			"name":"Deposit Boxes",
			"desc":"Stores money for players that accumulate interest over time. Both the banker and the owner of the deposit box will receive money from the interest. If the banker disconnects or changes jobs while money is still in the deposit boxes, that money will be automatically returned to its owner.",
			"location":"City bank, usually in a secure room near the vault."
		},
		{
			"name":"Bank Computer",
			"desc":"Displays details about a player's deposit box such as the original deposited amount and the current amount. It also displays details about a player's loan information, and is used to hand out loans.",
			"location":"City bank, usually on a counter or desk near the deposit boxes."
		},
		{
			"name":"Money Printer",
			"desc":"Produces counterfeit money that can be used like regular money without any risk of it being detected as counterfeit. There are several upgrades for money printers that improve their overall usefulness. The paper upgrade increases the max amount of paper a printer can hold. The sound upgrade reduces the volume of the sound that the printer produces. The cooling upgrade reduces the chance of the printer catching fire. The output upgrade increases the amount of money per minute that the printer produces. Some upgrades can be stacked for a greater effect. Holding the sprint key while pressing your use key on the printer will reveal more details about it.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Weed/Meth/Cocaine",
			"desc":"Various drugs that give you boosts such as increased health or speed if consumed. Taking too much will result in an overdose, which causes low health, slow movement speed, and potentially death. Weed and meth have special variants that give extra effects. These drugs can also be sold by placing them in a drug box and taking the box to the smuggler. Prices vary depending on the type of drug.",
			"other":"Cooking or growing with various equipment and ingredients"
		},
		{
			"name":"Disguise Kit",
			"desc":"Changes the user's playermodel to the selected job's playermodel. To use, left click and press the number associated with the job you want to disguise as. Note that if you take damage while disguised, the disguise will be removed and you will freeze in place for a few seconds.",
			"user":"Undercover Officer",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Flashbang",
			"desc":"Type of grenade that temporarily blinds and deafens players who look in the direction of the explosion.",
			"user":"SWAT",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Modified Gas Can",
			"desc":"Used to pour gas on the ground. To use, hold left click and move in the direction you want the stream to go. To ignite the gas, stand near the pour gas and right click.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Hacking Station",
			"desc":"Used to hack and view stats of all currently active drones. To hack, press your use key on the console and type 'hack'. You will be asked to enter a password. Once you enter the password, it will list the ID of all available drones. See the <a href='https://steamcommunity.com/sharedfiles/filedetails/?id=669642096'>drones rewrite addon</a> for more information.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Heat Lamp",
			"desc":"Provides heat to plants so they can grow without sunlight. Has a 20% chance of catching fire every 5 minutes while turned on. Requires fuel to work. Will explode if it takes too much damage.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Meth Mixer",
			"desc":"Used for preparing meth for baking by mixing all the ingredients together. Various ingredients can be added to the meth for increased effects and quality. The higher the quality, the more the meth will be worth but the longer it will take to cook and bake. Attempting to add certain items as ingredients, or failing to add filler, may cause an explosion. The mixer needs a total of 10 ingredients loaded into it before it will start the mixing process.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Meth Oven",
			"desc":"Bakes prepared meth into its final consumable and sellable form. Requires fuel to work. The amount of time it takes to bake depends on how many extra ingredients were added; 1 minute for each ingredient. The oven runs continuously as long as it has fuel. Adding certain items as ingredients, or leaving finished meth inside for too long, may cause an explosion. The oven also has a small chance of bursting info flames when running.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Molotov",
			"desc":"Throwable glass bottle that starts a fire wherever it lands.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Raw Cocaine",
			"desc":"Raw form of cocaine that is output by a coca plant. Insert it into the purifier to turn it into pure cocaine.",
			"other":"Growing from coca plant"
		},
		{
			"name":"Smoke Grenade",
			"desc":"Emits a cloud of smoke where it lands, making visibility very low.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Meth Filler",
			"desc":"The only required ingredient for making bare minimum meth. Adding this alone to the meth station will yield a nearly worthless product, and not adding it at all will cause an explosion.",
			"shop":"Contraband Dealer"
		},
		{
			"name":"Seed",
			"desc":"Many different seeds can be purchased and planted in dirt. Once a plant has grown food, you can harvest the food to eat and restore hunger and health, to sell to other players or the farmer NPC, or in some cases, use the food as ingredients for making other things.",
			"shop":"Supermarket"
		},
		{
			"name":"Shipping Crate",
			"desc":"Transports grown crops to the farmer NPC to sell. To use, place the crate next to the farmer NPC and press your use key on the crate to empty it and receive a profit.",
			"shop":"Supermarket"
		},
		{
			"name":"Defibrillator",
			"desc":"Revives dead players that haven't respawned yet. To use, right click multiple times to charge it up, then left click on a players corpse to revive them.",
			"user":"Firefighters"
		},
		{
			"name":"Fire Extinguisher",
			"desc":"Puts out fires by spraying a foamy substance. Can be used an unlimited amount of times.",
			"user":"Firefighters",
			"shop":"Supermarket"
		},
		{
			"name":"Med Kit",
			"desc":"Quickly heals players by intervals of 10. Players can be healed up to 150 HP if they are near an ambulance. Right click to heal yourself.",
			"user":"Firefighters"
		},
		{
			"name":"Narcan",
			"desc":"Revives players that have overdosed on drugs. Has unlimited uses.",
			"user":"Firefighters"
		},
		{
			"name":"News Camera",
			"desc":"Broadcasts a live feed of what you're looking at to news TVs. You can edit the ticker that appears at the bottom of the screen by right clicking.",
			"user":"News Reporter"
		},
		{
			"name":"News TV",
			"desc":"Displays a live feed of the news reporter's camera. Any voice or text chats that are within range of the news reporter will emit from the TV.",
			"shop":"Supermarket"
		},
		{
			"name":"Axe",
			"desc":"Chops down trees. Firefighters can also use it to force open doors.",
			"shop":"Supermarket",
			"user":"Firefighters"
		},
		{
			"name":"Rock",
			"desc":"Contains between 2-6 iron that can be harvested with a pickaxe.",
			"location":"Scattered around the map, mostly in grassy and rocky areas."
		},
		{
			"name":"Pickaxe",
			"desc":"Mines rocks. Mechanics can also use it to repair potholes.",
			"shop":"Supermarket",
			"user":"Mechanic"
		},
		{
			"name":"Tree",
			"desc":"Contains between 2-4 wood that can be harvested with an axe. The leaves are always red/orange to help distinguish them from normal trees.",
			"location":"Scattered around the map, mostly in wooded areas."
		},
		{
			"name":"Car Bomb",
			"desc":"Special type of explosive used specifically on vehicles. Left click while looking at a vehicle to plant the bomb. Right click to change detonation conditions.",
			"other":"Crafting"
		},
		{
			"name":"Frag Grenade",
			"desc":"Throwable explosive that deals a great amount of damage to anyone nearby by launching metal fragments outward in all directions. Capable of instantly destroying rocks.",
			"other":"Crafting"
		},
		{
			"name":"Lockpick",
			"desc":"Used to silently break into locked buildings and vehicles. To use, walk up to a door or vehicle, left click, and wait for the picking to finish. Looking away from the object you're picking will reset your progress.",
			"other":"Crafting",
			"user":"Detective"
		},
		{
			"name":"Nano Drone",
			"desc":"Tiny drone that is nearly impossible to detect without a hacking station. Does not emit a sound but also does not display as many stats as the spy drone.",
			"other":"Crafting"
		},
		{
			"name":"Premium Lockpick",
			"desc":"Same as the normal lockpick except the lockpicking time is cut in half, it creates no sound, and it does not set off car alarms.",
			"other":"Crafting"
		},
		{
			"name":"SLAM Remote Explosive",
			"desc":"Explosive that can be detonated remotely from anywhere on the map. It can also be placed on walls and used as a tripmine.",
			"other":"Crafting"
		},
		{
			"name":"Timed C4",
			"desc":"Plastic explosive with a timer that does large amounts of damage. Left click to plant the explosive where you're standing. Right click to change the timer settings. The timer ranges from instantaneous to 10 minutes.",
			"other":"Crafting"
		},
		{
			"name":"Toy Turtle",
			"desc":"Hops around like a toy. Can be configured to play a different sound at a different speed by pressing your use key on it.",
			"other":"Crafting"
		},
		{
			"name":"Steel",
			"desc":"Crafting ingredient used in weapon recipes.",
			"other":"Smelting iron"
		},
		{
			"name":"Crafting Blueprint",
			"desc":"Crafting item for certain recipes, mostly consisting of explosives and machine guns. Most blueprints get 3 uses before they are removed, though some may only get 1 use depending on how it was obtained. To use a blueprint, place it near a crafting table and craft the item specified on the blueprint.",
			"other":"Dumpster diving, completing jobs, and robbing the bank or deposit boxes."
		},
		{
			"name":"Tip Jar",
			"desc":"Used to give money to a person without being physically near them.",
			"shop":"F4 Menu"
		},
		{
			"name":"30% Vehicle Health",
			"desc":"Repairs a damaged vehicle by 30% of its max HP. To use, touch the kit with a damaged vehicle.",
			"shop":"Supermarket"
		},
		{
			"name":"Business Sign",
			"desc":"Simple sign that displays the text 'Open' or 'Closed'. Press your use key on it to change its status.",
			"shop":"Supermarket"
		},
		{
			"name":"Camera Drone",
			"desc":"Simple drone with a camera attached to it.",
			"shop":"Supermarket"
		},
		{
			"name":"Crowbar",
			"desc":"Long, iron tool used for prying open ATMs. Can also be used as a melee weapon.",
			"shop":"Supermarket"
		},
		{
			"name":"Crafting Table",
			"desc":"Used to create items such as weapons and tools with various ingredients. To add ingredients, touch them with the table. To craft something, first click on an item to see it's ingredient requirements. If all requirements are met, click the craft button. The crafted item will spawn below the table. Certain high-scale items also require a blueprint along with the normal ingredients.",
			"shop":"Supermarket"
		},
		{
			"name":"Fuel Can",
			"desc":"Fills up 75% of a vehicle's fuel tank, and 100% of other machines that require fuel to operate. To use, touch it with something that needs fuel.",
			"shop":"Supermarket"
		},
		{
			"name":"Large Metal Detector",
			"desc":"Walk-through metal detector that can detect everything the handheld version can, as well as explosives and weapons in a players inventory. Requires a player to setup but not operate. Emits a loud buzzing sound when blacklisted items are detected.",
			"shop":"Supermarket"
		},
		{
			"name":"Life Alert",
			"desc":"Alerts police and EMS to your location under four different conditions when equipped: 1) Typing !alert in chat, 2) Taking large amounts of damage, 3) Overdosing on drugs, 4) Dying. Press your use key on it to equip it. During an active alert, an icon will be displayed for police and EMS to lead them to your exact location. Alerts deactivate after a certain amount of time, or when a dead player respawns.",
			"shop":"Supermarket"
		},
		{
			"name":"Media Player TV",
			"desc":"Plays videos and music through a number of different websites including YouTube, Twitch, and Soundcloud. Press your use key to turn it on and hold C while looking at it to add media. Currently requires players to have the x86-64 beta branch installed to work properly.",
			"shop":"Supermarket"
		},
		{
			"name":"Slot Machine",
			"desc":"Casino game that has a chance of rewarding a large payout. Each spin costs $100 and can give anywhere from $5 to $20,000. Due to the way the slot machine was programmed, the rewards displayed on the machine may not be accurate to what is actually payed out.",
			"shop":"Supermarket"
		},
		{
			"name":"Spy Drone",
			"desc":"Similar to the camera drone but can detect and provide details about entities.",
			"shop":"Supermarket"
		},
		{
			"name":"Alcohol Case",
			"desc":"What the keg spawns when it's done brewing an alcoholic drink. Each case contains up to 6 bottles that give different effects depending on what they contain.",
			"other":"Brewing a drink with the keg.",
			"user":"Cook"
		},
		{
			"name":"Cooking Stove",
			"desc":"Cooks basic food such as fish, hot dogs, hamburgers, and donuts. Each food item takes 30 seconds to cook, and up to four can be cooked at once. Cooking fish requires the cook to actually catch the fish first. Each food item restores between 15 and 100 hunger depending on what it is.",
			"shop":"F4 Menu",
			"user":"Cook"
		},
		{
			"name":"Keg",
			"desc":"Creates alcoholic drinks using farm foods. Outputs 1 case per brew. Each brew takes 100 seconds. Each drink has its own unique effects when consumed.",
			"shop":"F4 Menu",
			"user":"Cook"
		},
		{
			"name":"Microwave",
			"desc":"Quickly prepares a meal that restores full hunger. Yields a small profit for the cook.",
			"shop":"F4 Menu",
			"user":"Cook"
		},
		{
			"name":"Pizza Fridge",
			"desc":"Sells ingredients for making pizza. Dough is the pizza base, and everything else is a topping.",
			"shop":"F4 Menu",
			"user":"Cook"
		},
		{
			"name":"Pizza Oven",
			"desc":"Cooks completed pizzas. Automatically starts once a pizza is placed inside, and will make noise when the pizza is done. Pizzas that are not taken out in time will burn and will need to be remade.",
			"shop":"F4 Menu",
			"user":"Cook"
		},
		{
			"name":"One-Time-Use Health Kit",
			"desc":"Fully restores a players health, then removes itself.",
			"shop":"Healer"
		},
		{
			"name":"One-Time-Use Armor Kit",
			"desc":"Fully restores a players armor, then removes itself.",
			"shop":"Healer"
		},
		{
			"name":"Ammo Locker",
			"desc":"Supplies ammo for any gun. To use, press your use key on the locker and wait for the ammo to spawn on the ground. You will be charged a certain amount depending on the ammo type. Shotgun and taser ammo is only obtainable by police jobs; civilians will need to craft it or steal it from the locker using a crowbar.",
			"location":"Supermarkets and secure areas of the police station."
		},
		{
			"name":"Pot Hole",
			"desc":"Part of the roadwork event. Spawns in the road and has a chance of popping tires when a vehicle runs over it. It can be removed by a mechanic with a pickaxe."
		},
		{
			"name":"Evidence",
			"desc":"Package that spawns near a player's corpse if there is a detective currently on the server. Detectives can investigate them to learn details about the victim and their killer that can lead to justice being served."
		},
		{
			"name":"Fish Bait",
			"desc":"Lures fish to your rod. Each bait has 5 uses.",
			"shop":"Fisherman"
		},
		{
			"name":"Fishing Rod",
			"desc":"Used to catch fish. Press reload to adjust your throwing strength and left click to cast your line. Once you start seeing splashes around your hook, right click to reel in what you caught. If you're fishing as a cook, the fish you collect will be placed in a hidden inventory that will be emptied when you use a cooking stove.",
			"shop":"Fisherman"
		},
		{
			"name":"Fish Finder",
			"desc":"Detects fish at different depths. Useful for seeing if the body of water you're fishing in is deep enough to contain rare fish. To use, have it equipped while moving around a body of water.",
			"shop":"Fisherman"
		},
		{
			"name":"Fishing Pot",
			"desc":"Automatically catches fish and stores them over time. It floats near the surface, so only common fish can be caught in it. To deploy it or harvest the fish inside, press your use key on it.",
			"shop":"Fisherman"
		},
		{
			"name":"Fire Hose",
			"desc":"Similar to the fire extinguisher but has a larger range, at the cost of needing to be near a fire truck or fire hose node to work.",
			"user":"Firefighters"
		},
		{
			"name":"Fire Hose Node",
			"desc":"Extends the range of fire trucks so fire hoses can be used in hard to reach places such as an apartment building. They can be attached to a fire truck or another node. To use, press your use key on it and select an option from the menu.",
			"shop":"F4 Menu",
			"user":"Firefighters"
		},
		{
			"name":"SWAT Locker",
			"desc":"Used by police officers to equip SWAT gear. While SWAT, you have a much slower walk speed and cannot use certain NPCs such as the supermarket and contraband dealer. The locker keeps your current gear safe when you use it so you won't lose any weapons. Civilians can also rob this locker for a PCB, with a 50% chance of getting SWAT-related items as well.",
			"location":"Secure areas of the police station."
		},
		{
			"name":"Printer Paper",
			"desc":"Paper used in money printers. Can also be manually written to and saved like a notebook.",
			"shop":"Supermarket"
		},
		{
			"name":"Cargo Drone",
			"desc":"Drone equipped with a winch to carry medium-sized objects. Note that just because an item is small enough to be carried by the drone, does not mean it is light enough.",
			"other":"Crafting"
		},
		{
			"name":"Gun Drone",
			"desc":"Large drone with two automatic guns mounted in the front.",
			"other":"Crafting"
		},
		{
			"name":"Controllable Turret",
			"desc":"Player-controlled automatic turret; does not move.",
			"other":"Crafting"
		},
		{
			"name":"PLOT-130",
			"desc":"Large player-controlled mech that comes with a missile launcher and dual miniguns. A weapon to surpass the DarkRP shotgun.",
			"other":"Crafting"
		},
		{
			"name":"Experimental Steroids",
			"desc":"Health item that regenerates a player's health by 3 HP every second, for 10 minutes, but has a small chance of having the opposite effect. Has a special effect if combined with weed.",
			"shop":"Healer (Fire Chief only)"
		},
		{
			"name":"DarkRP Shotgun",
			"desc":"Benelli M3 Super 90 shotgun from Counter-Strike: Source that comes with the DarkRP gamemode by default. It is infamous throughout the community for being able to deal high amounts of damage from virtually any distance. It can only be obtained by receiving one from OP as a reward during special events. Uses standard shotgun ammo.",
			"other":"Participating in special events"
		},
		{
			"name":"Police Scanner",
			"desc":"Radio that picks up chatter from the police and government group text chat. It can pickup chatter from anywhere on the map, but has a limited listening range. It does not allow for transmitting.",
			"other":"Crafting"
		},
		{
			"name":"PCB",
			"desc":"Crafting material used in advanced recipes for electronic devices.",
			"other":"Robbing the SWAT locker (100% chance) or mining rocks (5% chance)"
		},
		{
			"name":"SWAT Shield",
			"desc":"Ballistic shield used by SWAT officers to protect themselves and others from gunfire. Most effective when used while crouching.",
			"other":"Using the SWAT locker"
		},
		{
			"name":"Boombox",
			"desc":"Plays internet radio streams in 3D space.",
			"shop":"Supermarket"
		},
		{
			"name":"Inventory Box",
			"desc":"Portable box for carrying up to 9 inventory items. Can be destroyed if dealt enough damage. Destroyed boxes will drop all of its contents.",
			"shop":"Supermarket"
		},
		{
			"name":"Drug Box",
			"desc":"Crate used to transport drugs to the smuggler for selling. Drugs cannot be sold unless they are in this box. Up to 5 drugs can be added to a box, and cannot be removed once added.",
			"shop":"Contraband Dealer"
		}
	]
}