[
	{
		"title": "HLU RP Update 10/31",
		"date": "October 31, 2025",
		"info": "<h3>Changes</h3><ul><li>Replaced the original GTerminal with GTerminal Universal. This version provides extended features and better Wiremod integration.</li></ul><h3>Fixes</h3><ul><li>Fixed the purified crystal not keeping its type when pocketed.</li></ul><h3>Deletions</h3><ul><li>Removed Gmod Legs 3 due to it causing microstutters.</li><li>Removed PCMod. It was old, kinda buggy, and mostly relied on tools to spawn things, which confused people. The new GTerminal version we're now using should make up for it.</li></ul>"
	},
	{
		"title": "Minecraft Modpack Updates",
		"date": "October 10, 2025",
		"info": "<p>I've made some changes to all of our modpacks. My main goal here was to consolidate some of the packs to make it less confusing as to which one is which, and also to make them easier to maintain in the future. Below are the changes for each modpack.</p><h3>Modded</h3><p>Added Chisel, Fairy Lights, HWYLA, Iron Furnaces, MrCrayfish's Furniture Mod, OpenBlocks, PneumaticCraft, Tropicraft, and Waystones. Removed Secret Rooms Mod and Stargate Network.</p><h3>Modded 2</h3><p>Upgraded Minecraft version from 1.19.2 to 1.21.1 and changed the modloader from Fabric to NeoForge. The mod list was redone with both Modded 2 and Adventure in mind, so you'll see a lot of familiar mods but also a lot of new ones too based on community requests. Since this is a complete revamp, the save has also been regenerated.</p><h3>Unbalanced</h3><p>Added Better Builders Wands, BiblioCraft, Chisel, and OpenComputers. Removed Waystones and regenerated the save as well.</p><h3>Unbalanced 2</h3><p>This modpack has been removed. Some of its mods were moved to Modded 1 and Unbalanced 1. Much like the original Unbalanced 1, both the client and server have been archived in case we ever want to return to it.</p><h3>Adventure</h3><p>This modpack has also been removed and archived. Roughly half of its mods were moved to Modded 2.</p>"
	},
	{
		"title": "Various Gamemodes Update 10/6",
		"date": "October 6, 2025",
		"info": "<h3>Additions</h3><ul><li>Added The Hidden IRIS Edition.</li></ul><h3>Changes</h3><ul><li>Decreased the traitor percentage on TTT2 from 40% to 25%.</li><li>The welcome message that displays in chat every 15 minutes will now provide a link to the Discord.</li></ul><h3>Fixes</h3><ul><li>Fixed the wrong version of Zombie Survival being in the workshop collection, causing model errors and missing textures.</li><li>Fixed a Pirate Ship Wars dependency missing from the workshop collection.</li></ul><h3>Deletions</h3><ul><li>Removed MelonRacer.</li></ul>"
	},
	{
		"title": "Attention Windows 10 Users",
		"date": "October 3, 2025",
		"info": "<p>As you probably know, Microsoft is ending support for Windows 10 in less than 2 weeks. A lack of support means that after October 14, Windows 10 will stop receiving security updates indefinitely, which is likely going to lead to millions of devices becoming vulnerable to attack vectors that are found and never patched.</p><p>There is some good news, though. Microsoft isn't completely ending support for Windows 10. There are several different methods to obtain extended security updates that will continue to roll out for anywhere between 1 and 7 years, depending on the method chosen. For example, the commercial extended security program will last until 2028, and Windows 10 IoT Enterprise LTSC 2021 will continue to receive updates until 2032.</p><p>If you plan to continue using Windows 10, I highly recommend looking into enrolling in one of the extended security programs, or switching to one of the special Windows 10 versions that will continue to be updated. More information can be found <a href='https://massgrave.dev/windows10_eol'>here.</a></p><p>If you have any questions about this feel free to ask me. I know this isn't the type of announcement I typically make, but I feel like it's important to let people know what options they have, since Windows 10's EoL is a bit different from previous versions, and it could potentially have major security implications for millions of people.</p><p>(or....you could <a href='https://lambdagaming.github.io/Guides/switching-to-linux'>switch to Linux</a>)</p>"
	},
	{
		"title": "CityRP Update 7/23",
		"date": "July 23, 2025",
		"info": "<h3>Changes</h3><ul><li>Reduced the reward for other officers who assist the primary officer during the drunk driver event, from $4,000 and a blueprint to $1,000 and no blueprint.</li></ul><h3>Fixes</h3><ul><li>Fixed the spawning restriction for the SWAT truck not working.</li><li>Fixed players not being able to buy life insurance.</li><li>Fixed fire hoses working near nodes that had their connections broken.</li><li>Fixed the news camera throwing errors when trying to play a sound.</li><li>Fixed the drunk driver event giving multiple rewards to the primary officer who stopped the driver if there were other officers in the area.</li></ul><h3>Deletions</h3><ul><li>Removed Gmod Legs 3 due to it causing microstutters.</li></ul>"
	},
	{
		"title": "CityRP Update 6/1",
		"date": "June 1, 2025",
		"info": "<h3>Changes</h3><ul><li>All food that was spawned by the cook through the F4 menu is now spawned through the cooking stove that was originally only used for fish. Each food item takes 30 seconds to cook and up to 4 items can be cooked at the same time.</li><li>Cops are now rewarded money for destroying certain contraband items. The amount of money given depends on the value of the item.</li><li>Events are random once again and no longer go through the job broker, except this time players who can participate in the event can vote yes/no to start it, instead of being forced to deal with it when they didn't want to.</li><li>Restricted spawning of the mayor's limo and Bearcat to the mayor and active SWAT officers respectively.</li></ul><h3>Deletions</h3><ul><li>Removed the old smuggling system. With the recent changes to the event system and smuggler NPC it's become more and more redundant and harder to maintain.</li><li>Removed the Ford Taurus. It was a redundant police car and apparently it was never added to the civilian car dealer for whatever reason, so there wasn't much reason to keep it.</li></ul>"
	},
	{
		"title": "HLU RP Update 5/28",
		"date": "May 28, 2025",
		"info": "<h3>Additions</h3><ul><li>Added extension to the BMRP trash system that randomly spawns trash around the facility that the custodian gets rewarded for cleaning up. (Credits to Brill)</li><li>Added the Half-Life 2 Melee Weapons addon and added some of its weapons to the rebel crafting table.</li><li>Added additional areas to Xen on BMRP that players can get resources from.</li><li>Added the displacer cannon to the weapon specialist crafting table on BMRP.</li></ul><h3>Changes</h3><ul><li>Updated to version 2.0 of the Universal Crafting System. This will make the system much easier to maintain in the future.</li><li>Improved recipe descriptions in the rebel crafting table to state how much loyalty is required.</li><li>The refugee on Outland RP will now always have 50% Combine loyalty, preventing them from making high-end items in the rebel crafting table.</li><li>Replaced the NPCs from the Half-Life Renaissance addon with the Half-Life Resurgence addon. This addon is still being maintained and isn't partially broken like the old one. The improved AI and extra content might also open up opportunities for better events in the future.</li><li>Replaced the weapons from the Half-Life Renaissance addon with two weapon packs.</li><li>Replaced the Combine ration dispenser with a better version from the workshop.</li><li>Improved the player model selector UI.</li><li>Replaced scientist, security, medic, and custodian player models with ones from the Half-Life Extended Workforce pack.</li><li>Replaced the HECU player models with a pack that fits better with the changes to the other player models.</li><li>Replaced the player expressions and chat sound systems with TFA VOX. The callout menu can be opened by pressing G.</li></ul><h3>Fixes</h3><ul><li>Fixed the zombie arms weapon having missing textures.</li><li>Fixed chosen player models not being applied when the player respawns.</li></ul><h3>Deletions</h3><ul><li>Removed the wrench crafting ingredient from the rebel crafting table. Recipe costs have been adjusted so they still cost the same amount of iron.</li><li>Removed some metrocop player model options due to them not fitting the server well.</li></ul>"
	},
	{
		"title": "CityRP Update 5/23",
		"date": "May 23, 2025",
		"info": "<h3>Additions</h3><ul><li>Added option to toggle cross-session property ownership without requiring a server restart. It's disabled by default but can be enabled if desired.</li><li>Added the Half-Life 2 Melee Weapons addon, and added some of its weapons to the supermarket.</li><li>Added a steel crafting ingredient that replaces wrenches in all recipes.</li><li>Added the smelter back. It now smelts iron into steel and turns crafted items into 50% of its required ingredients. It can be purchased at the supermarket.</li><li>Added multiple types of weed plants that grow weed with different effects, values, and grow times.</li></ul><h3>Changes</h3><ul><li>Improved the UI of all shop NPCs.</li><li>Renamed the Electronic Component crafting ingredient to PCB.</li><li>Merged the drug dealer and banker NPCs with the smuggler NPC. Drugs and stolen money bags are now sold at the smuggler. The smuggler now also teleports to various locations like the drug dealer did.</li><li>The smuggler will now refuse transactions if more than one person is nearby.</li><li>Taking smuggling jobs from the job broker will now instantly make you wanted by the police.</li><li>The contraband dealer will now teleport to various locations like the smuggler to help discourage camping.</li><li>Due to the banker NPC being removed, the banker's money transfer job now involves picking up a bag of money from a random shop NPC and delivering it to the bank vault. This bag can be stolen and cashed in at the smuggler.</li><li>Merged the deposit box money bag with the bank vault money bag.</li><li>Due to the removal of the evidence locker, the weapon confiscation feature of the evidence wand has been merged with the handheld metal detector.</li><li>Due to the removal of the evidence locker, PCBs can now be stolen by using a crowbar on the SWAT locker, with a chance of getting armor or a weapon from it as well. There's now also a 5% chance of getting a PCB when mining rocks.</li><li>Updated to version 2.0 of the Universal Crafting System addon. This will make the system much easier to maintain in the future.</li><li>Stripped out the remaining parts of the old mining system, including the ores, smelted ore crafting ingredients, rock and tree grinders, and the old axe and pickaxe weapons. The axe and pickaxe have been replaced with alternatives from the HL2 melee weapon addon.</li><li>Frag grenades and grenade launchers can now instantly mine rocks.</li><li>All crafting descriptions now explain the item rather than just listing the recipe.</li><li>Reduced the price of late-game crafting items.</li><li>The heat lamp can now be used in place of sunlight for all farm plants.</li><li>Farm food now restores a small amount of hunger.</li><li>Reduced the grow time for all farm plants.</li><li>Weed and coca plants are now part of the farm system. The seeds can be purchased at the contraband dealer.</li><li>Drugs can no longer be inventoried, and must be put in a drug box to be sold to the smuggler. The box can be purchased at the contraband dealer. Once an item is added to the box, it cannot be removed.</li><li>Replaced the propane canister with the GAuto fuel can for fueling all drug-related entities.</li><li>Cocaine can now be purified by any amount. Higher purification takes longer, costs more fuel, and makes the high last longer. Lower purification takes less time, and has a higher chance of having bad withdraw effects and making players instantly wanted when trying to sell it.</li><li>Replaced the meth stove and meth pot with meth mixer and meth oven entities. A wide variety of ingredients can be added to the mixer, each having their own unique effect. Some ingredients may cause only negative effects. 10 ingredients are required for the mixing process to start. The oven is used to bake the mixed ingredients into the final product. The oven requires fuel and constantly runs. Leaving cooked meth in the oven for too long will cause an explosion.</li><li>Replaced the two meth ingredients with one filler ingredient. At least one bottle of filler is required to make meth. Failing to add it will cause the mixer to explode. Adding too much filler will cause the smuggler to call the cops when trying to sell the meth.</li><li>Improved the reliability of the movement speed effects when overdosing.</li><li>The visual intensity of drug highs now changes depending on how close that player is to overdosing.</li></ul><h3>Fixes</h3><ul><li>Fixed the GAuto repair kit and fuel can not being able to be inventoried due to the entity names being changed.</li><li>Fixed the taser model showing up as an error in the contraband dealer menu.</li><li>Fixed the crafting table telling the gun dealer their ingredient discount was applied when it wasn't.</li></ul><h3>Deletions</h3><ul><li>Removed the evidence locker. Realistically it's not going to serve much purpose since cops can just inventory the evidence or take it to PD manually. I plan on adding something else later on that will reward cops for confiscating contraband items.</li><li>Removed the rock scanner and rock decimator weapons.</li><li>Removed the iron refiner due to the smelter taking over its main functions.</li></ul>"
	},
	{
		"title": "Lambda Gaming: The Game Release",
		"date": "March 26, 2025",
		"info": "<p>Lambda Gaming: The Game is now officially out! Thanks to everyone who contributed to the project. I will continue to maintain it and maybe add small things here and there, so if you have suggestions or find any bugs let me know.</p><p>I will now be working on a new project that I'll reveal more about once the first steps are done.</p><p>Please read the entire description before playing! <a href='https://steamcommunity.com/sharedfiles/filedetails/?id=3451614907'>https://steamcommunity.com/sharedfiles/filedetails/?id=3451614907</a></p>"
	},
	{
		"title": "Unbalanced 1 Refresh",
		"date": "March 3, 2025",
		"info": "<p>The Minecraft Unbalanced 1 server (from 2019) has been refreshed. I figured it was worth doing since we haven't played on it in about 4 years. The server and modpack now run on Minecraft version 1.7.10 instead of 1.12.2. I did this mainly for two reasons: We've never had a 1.7.10 server, and there's a lot of good mods that were never updated past this version. Some mods have stayed, but many more were added and removed. The full changelog is listed below. The original modpack and server (along with the map) have been archived in case we ever want to revisit it.</p><h3>New mods</h3><ul><li>Waystones</li><li>Weather Mod</li><li>HBM Nuclear Tech Mod (Much more complete than the one from Unbalanced 2)</li><li>Portal gun and gravity gun mods</li><li>Waila</li><li>Platforms</li><li>Mr Crayfish's Furniture Mod</li><li>Carpenter's Blocks</li><li>Redstone Paste</li><li>Immersive Railroading</li><li>Lycanites Mobs (Configured to be challenging but not a massive pain)</li><li>Nature's Compass</li><li>Immersive Engineering</li><li>Advanced Lightsabers</li><li>The Erebus</li><li>Controlling</li></ul><h3>Existing mods that benefit from the version downgrade</h3><ul><li>Buildcraft (1.12.2 version was incomplete)</li><li>Flan's Mod (Unofficial 1.7.10 version features a lot of bug fixes that make it more stable than even the 1.12.2 version)</li></ul><h3>Mods removed due to compatibility issues</h3><ul><li>Tinker Tool Leveling</li><li>Tinker's Construct Armory</li><li>Flex Tape</li><li>Thermal Innovation</li><li>Extreme Reactors</li><li>Just Enough Items</li><li>PlusTiC</li><li>PneumaticCraft</li><li>Certain Flans mod expansion packs</li><li>Enchant Changer</li></ul><h3>Mods removed due to being redundant</h3><ul><li>Blood Magic</li><li>Railcraft</li><li>Thermal Dynamics</li><li>IndustrialCraft</li><li>NuclearCraft</li><li>Gravestones</li></ul>"
	},
	{
		"title": "HLU RP Update 2/3",
		"date": "February 3, 2025",
		"info": "<h3>Additions</h3><ul><li>Added 3D2D text to Xen trees and regular trees that displays their name and health.</li><li>Added the Combine door auth tool to the rebel crafting table.</li><li>Added a menu to BMRP that allows players to select which sector or area they want to spawn in. HECU Marines do not get this option and will always spawn topside.</li></ul><h3>Changes</h3><ul><li>Reduced the chance of Xen crystals dropping pure and harvested crystals when mined.</li><li>Reverted back to the other media player version since the newer one was somehow even more broken.</li></ul><h3>Fixes</h3><ul><li>Fixed the yell and whisper chat commands cutting off any messages with spaces in them.</li><li>Fixed the turret parts box in the Combine and Rebel crafting tables being linked to an invalid entity.</li><li>Fixed an exploit where players could remain invisible if they changed jobs after going into Gman's portal.</li></ul>"
	},
	{
		"title": "HLU RP Update 2/2",
		"date": "February 2, 2025",
		"info": "<h3>Additions</h3><ul><li>Added the Combine prisoner transport vehicle addon to Outland RP.</li><li>Added PAC 3.</li></ul><h3>Changes</h3><ul><li>Vending machines on BMRP will now charge a small amount.</li><li>You can now return fire extinguishers back to their case on BMRP.</li><li>Increased loyalty reduction when mining on City 17 RP from 3% to 6%.</li><li>Decreased the max amount of iron that rubble piles can drop from 6 to 4.</li><li>Increased the minimum loyalty requirement for crafting the lockpick on City 17 RP from 75% to 85%.</li><li>Lowered the amount of metrocops that need to be killed before Combine Soldiers and Resistance Leaders are unlocked on City 17 RP, from 5 to 3.</li><li>Combine Elites will now be unlocked when the Citadel detonation sequence is activated on City 17 RP. (They can still be unlocked through the science locker beforehand.)</li><li>The Combine vehicle cooldown on Outland RP now varies depending on the number of players on the server.</li><li>Adjusted starting ammo values for all jobs.</li><li>Rebels on Outland RP now need to craft a key and insert it into the rocket launch button in order to use it.</li><li>The Combine on Outland RP are now limited to transport vehicles (dropship and transport truck) until the initial 30 minute cooldown is over.</li><li>Reduced the max health of the rebel's sentries on Outland RP.</li><li>Replaced the media player addon with a different version that's more frequently updated to hopefully fix the issues people were having.</li><li>Increased the damage and radius of mines and tripwire grenades on City 17 RP and Outland RP.</li><li>Enabled realistic fall damage.</li><li>Increased the lifespan of flares from 20 seconds to 30.</li><li>The endgame messages will now indicate which side won, and will give a 60 second warning before closing the server.</li><li>The overhead text on certain damageable entities will now display the entity's health.</li><li>Changed the material on the detonation code decryptor to make it more visible and to distinguish it from science locker keys.</li></ul><h3>Fixes</h3><ul><li>Fixed battering rams, handcuffs, and Gman's briefcase being dropped on death.</li><li>Fixed the door system throwing errors when trying to knock on an unownable door.</li><li>Fixed the battering ram not working.</li><li>Fixed players not being able to pocket pure crystals and vending machine items.</li><li>Fixed most rubble piles on rp_city24_v4 not spawning in the right places.</li><li>Fixed run speed, walk speed, and jump power being decreased after a player respawns.</li><li>Fixed the Combine spawns on rp_city24_v4 not being positioned properly.</li><li>Fixed Combine vehicles on Outland RP sometimes killing players when spawning.</li><li>Fixed door co-ownership not working.</li><li>Fixed fire extinguisher cases floating and not being up against the wall on BMRP.</li><li>Fixed all dropped weapons having the same fallback rifle model.</li><li>Fixed the detonation code decryptor being able to be crafted on Outland RP.</li></ul>"
	},
	{
		"title": "HLU RP Update 12/21",
		"date": "December 21, 2024",
		"info": "<h3>Additions</h3><ul><li>Added an automated system to trigger the cascade on BMRP. When the survey team is mining crystals in Xen, there is a 10% chance of obtaining a pure crystal sample. These samples can be inserted into the AMS to trigger the cascade. There are currently two samples that correspond with the available City 17 RP maps. When the HECU detonates the nuke, the chosen City 17 RP map is no longer random and now depends on what sample was inserted into the AMS.</li><li>Added a loyalty system to City 17 RP that determines when citizens are allowed to perform certain actions. For example, citizens cannot have more than 90% loyalty to spawn the rebel crafting table, and cannot have more than 25% loyalty to become a Resistance Leader. Loyalty can be reduced by mining and killing Combine units, but the Combine can also force a citizen's loyalty to increase by beating them with stunsticks, killing them, or arresting them.</li><li>Added a cooldown when being demoted from a job so that players cannot immediately choose that job again.</li><li>Added GAuto. Vehicles can now run out of fuel and be destroyed, but not permanently. The Custodian on BMRP will now spawn with vehicle fuel and repair tools, and rebels on Outland RP can craft repair kits and fuel cans. Vehicles that spawn around the map on Outland RP will spawn with random health and fuel amounts.</li><li>Added a 1.5 hour time limit to Outland RP. If the rebels cannot launch their rocket or destroy the Combine base within this time period, the Combine will automatically win.</li><li>Added support for more boss events on rp_bmrf.</li><li>Added textscreens around rp_bmrf to make it easier to navigate, especially at tram stations.</li></ul><h3>Changes</h3><ul><li>Replaced Gman's teleporter with the Gman Teleporting Briefcase addon.</li><li>Moved the HECU Weapon Crate to the locked weapons room on rp_bmrf.</li><li>Replaced both Outland RP maps with rp_mezs. This is a fantastic map that fits with the server better than the other two.</li><li>Updated rp_city24_v3 to rp_city24_v4.</li><li>Merged the Weapons Engineer job into the Weapon Specialist job on BMRP. Due to this change, the Weapon Specialist has been moved to the Science category and will no longer spawn with weapons and ammo, but being able to spawn weapon shipments hasn't changed.</li><li>Renamed the Service Official to Custodian.</li><li>The Biochemist now spawns with the Possessor by default instead of having to craft it.</li><li>Vortigaunts will now be demoted back to Citizen when killed on City 17 RP.</li><li>The loading screen will now indicate and give a short explanation about what segment of the RP the server is currently playing on.</li><li>The Overwatch Soldier, Overwatch Guard, and Resistance Leader jobs are now restricted until at least 5 metrocops are killed. This was done to make the progression to more powerful units feel more natural.</li><li>Increased the time, range, and conditions for spawning loot around the map on Outland RP.</li><li>Replaced the portal closing button on Outland RP with a central core that the rebels must destroy to eliminate the Combine and end the session.</li><li>Manhacks on Outland RP are now deployable by Overwatch Soldiers instead of by all Combine units from an NPC.</li><li>Players will now automatically enter Combine vehicles when deploying them on Outland RP.</li><li>Combine vehicles will now automatically despawn after 5 minutes of inactivity on Outland RP.</li><li>Players will now be forced to respawn when switching teams on Outland RP to prevent abuse.</li><li>Changed the Combine Vehicle NPC to a Vehicle Deployment Terminal.</li><li>Improved the rebel rocket launch button to make it more noticeable.</li><li>Moved the Refugee to a separate category on Outland RP so it doesn't have access to the rebel buy menu.</li><li>Due to changes made to Outland RP, the gm_atomic map is now accessible from BMRP, but only under special conditions that allow for inserting a nuke into the AMS.</li><li>Reworked how events are handled on BMRP. The Gman can choose what event should trigger next, but can no longer trigger it directly. Events will be triggered by the server if the right conditions are met, and events that the Gman 'nudged' will take priority.</li><li>Improved the GUI for the item NPCs and buy menu.</li></ul><h3>Fixes</h3><ul><li>Fixed the Gman event menu on BMRP being completely broken.</li><li>Fixed the keys not being able to lock or unlock doors that were part of predefined groups.</li><li>Fixed the door system creating errors when trying to lock/unlock Level 2 Security doors on BMRP, due to it referencing a job that was removed a while ago.</li></ul><h3>Deletions</h3><ul><li>Removed the Forklifts from BMRP.</li><li>Removed rp_sectorc_beta and rp_city17_district47. They weren't necessarily needed and reducing the amount of maps makes it easier to manage the remaining ones.</li><li>Removed the ceasefire system from City 17 RP since the new loyalty system should naturally prevent rushing.</li></ul>"
	},
	{
		"title": "Various Gamemodes Update 11/30",
		"date": "November 30, 2024",
		"info": "<h3>Additions</h3><ul><li>Added TTT2. The weapon selection is the same as before, but I might add more in the future.</li></ul><h3>Changes</h3><ul><li>Replaced Prop Hunt with Prop Hunt Extended Plus, a newer version with improvements and bug fixes.</li><li>Replaced the mapvote system with a different version that also supports voting for gamemodes.</li></ul><h3>Deletions</h3><ul><li>Removed PatchPlay and the TTT Turret. (They were both broken.)</li></ul>"
	},
	{
		"title": "CityRP Update 11/30",
		"date": "November 30, 2024",
		"info": "<h3>Additions</h3><ul><li>Added the BoomBox radio addon. It can be purchased at the supermarket.</li></ul><h3>Changes</h3><ul><li>Robbing the ATM will now give an amount proportional to the amount of players on the server. (Every player increases the amount by 500)</li><li>Inventory boxes can once again be purchased at the supermarket.</li><li>Renamed the News Cameraman job to News Reporter.</li><li>Lottery winnings are now taxed based on the income tax set by the mayor, instead of a hard-coded 25%.</li><li>Replaced the BH Accessories addon with a modified version of pointshop. (This way it's less bloated and easier to manage.)</li></ul><h3>Fixes</h3><ul><li>Fixed item NPCs creating errors when trying to 'purchase' a free item.</li><li>Fixed certain NPCs playing the wrong animation.</li><li>Fixed money that was collected from sales tax always being sent to the city bank even if the purchase wasn't completed.</li><li>Fixed players not being able to use other item NPCs if they were on cooldown from using the job broker.</li><li>Fixed the machete being listed under the wrong name in the supermarket.</li><li>Fixed money printer upgrades having an invalid model in the contraband dealer menu.</li></ul><h3>Deletions</h3><ul><li>Removed the minimap for now. I might add it back later depending on what features get added but for now I don't feel like it fits the server well.</li></ul>"
	},
	{
		"title": "HLU RP Update 1/15",
		"date": "January 15, 2024",
		"info": "<h3>Additions:</h3><ul><li>Added a ping section to the scoreboard.</li><li>Added a more concentrated ore stash away from the main rebel base on gm_boreas.</li><li>Added a sign to the ammo lockers so they can be easily identified.</li></ul><h3>Changes:</h3><ul><li>Improved the descriptions of certain F3 menu items on BMRP and the website.</li><li>Team chats will now be indicated as such instead of just looking like a normal message.</li><li>Nerfed the HL2 sniper so a chest shot doesn't insta-kill.</li><li>Players will now spawn in different locations based on their job on BMRP.</li><li>The mouse sensitivity of the HL2 sniper will now decrease as the scope zoom increases.</li><li>The rebels on Outland RP can now spawn JMod machines from the F3 menu. The machines that are available allow them to take full advantage of the addon, as long as they have the time to gather resources and craft more items. Further JMod integration may come later.</li><li>The HECU weapon crate on BMRP is now restricted to military jobs only until the cascade starts.</li><li>RP-related chat commands are no longer case-sensitive.</li><li>Merged the refugee and loyal citizen back into one citizen job on City 17 RP. The Combine started to specifically target refugees since loyal citizens weren't hostile, so keeping one citizen job helps make things less predictable.</li><li>Admins can now disable door ownership much easier.</li><li>Slightly increased run speed and slightly decreased jump power.</li><li>Scientists can now use food dispensers on City 17 RP.</li><li>The science locker on City 17 RP now has a menu that allows the scientist to select what to research, rather than having the locker choose at random. This change also allows the locker to store multiple keys.</li><li>Updated the job list and rules on the website to reflect the changes made to the CityRP pages.</li><li>Moved the nuke key on rp_bmrf farther away from the HECU weapon crate since the nuke gets spawned from there now.</li><li>The max amount of an item you can buy from the F3 menu now depends on how many are owned by you rather than a total amount that's shared with all players.</li></ul><h3>Fixes:</h3><ul><li>Fixed certain chat sounds not working for scientist and security jobs on BMRP.</li><li>Fixed the door system spamming errors when a player looked at an entity that the client didn't consider valid.</li><li>Fixed PCMod not working again.</li><li>Fixed door restrictions resetting on all maps.</li><li>Fixed certain tools not being restricted when they should've been.</li><li>Fixed the rubble obstructions on BMRP not taking damage.</li><li>Fixed the crafting tables accepting ingredients that don't belong to their type.</li><li>Fixed the rebels on Outland RP not being able to spawn their own crafting table from the F3 menu.</li><li>Fixed the help links in the Outland RP F4 menu not working.</li><li>Fixed the Combine not being able to use the Combine Vehicle Shop on Outland RP.</li><li>Fixed the scoreboard creating errors if it was open when a player left the server.</li><li>Fixed the vortigaunt playermodel showing up as an error.</li><li>Fixed the Combine not being able to cancel the rebel rocket launch on Outland RP.</li><li>Fixed the !alarm chat command not working on BMRP.</li><li>Fixed various Half-Life NPCs getting their sentences mixed up.</li><li>Fixed the scope overlay on the HL2 sniper not always turning off when it should.</li><li>Fixed the job switch failure notification not showing up if a player tried to switch to resistance leader before the ceasefire ended on City 17 RP.</li><li>Fixed certain restricted weapons dropping on death.</li></ul>"
	},
	{
		"title": "CityRP Update 12/31",
		"date": "December 31, 2023",
		"info": "<h3>Changes:</h3><ul><li>25% of lottery winnings now go to the city bank as a tax.</li><li>The car bomb checker and battering ram can now only be obtained through the SWAT locker.</li><li>Merged the confiscation tool with the evidence wand.</li><li>Increased the time between news TV payments for the news cameraman from 1 minute to 3 minutes.</li><li>Increased the minimum lottery amount to $100, and increased the max amount to $10,000.</li><li>Replaced the bat mobile with a monster truck as the million dollar vehicle. (Yes it was just added, but monster trucks are cooler.)</li></ul><h3>Fixes:</h3><ul><li>Fixed the large metal detector not detecting car bombs.</li><li>Fixed players not being able to drop weapons if at least one person on the server was handcuffed.</li></ul><h3>Deletions:</h3><ul><li>Removed the breakout NPC. Citizens can now release prisoners from handcuffs directly.</li></ul>"
	},
	{
		"title": "CityRP Update 9/4",
		"date": "September 4, 2023",
		"info": "<h3>Additions:</h3><ul><li>Added property system support to the other three maps.</li><li>Added the Gminimap addon. The minimap is disabled by default and is configurable through the spawn menu. Certain public entities and buildings are marked with their own unique icon. Certain NPCs will show up as yellow circles if you are near them. Players will not show up at all.</li><li>Added new crafting ingredient: electronic component. This ingredient is used in recipes for advanced tech, and can only be obtained by robbing the evidence locker inside PD.</li><li>Added a craftable police scanner entity. This allows players near the scanner to listen in on government and police group text chats.</li></ul><h3>Changes:</h3><ul><li>Moved the smelter on rp_southside_day to the parking area inside the tunnel to suburbs, where the purifier used to be.</li><li>Moved the accessory vendor on rp_southside_day and rp_truenorth_v1a from a random shop to an actual clothing store.</li><li>Moved the rock and tree grinders on rp_southside_day to outside the warehouse across the bay, to discourage camping in that remote location, and to free up the warehouse they used to be at for purchase.</li><li>The undercover officer no longer counts toward the total number of cops required to rob the bank.</li></ul><h3>Fixes:</h3><ul><li>Fixed the C4 creating script errors when a player spawns in.</li><li>Fixed the bus's passenger seats not being positioned properly.</li><li>Fixed the news TV not always displaying text chat if there was more than one TV spawned.</li></ul><h3>Deletions:</h3><ul><li>Removed the precision tool.</li><li>Removed the mayor's bodyguard job for balance reasons.</li></ul>"
	},
	{
		"title": "CityRP Update 7/12",
		"date": "July 12, 2023",
		"info": "<h3>Additions:</h3><ul><li>Added a cargo drone, controllable combine turret, PLOT-130 mech, and Limb of the Law weaponized drone to the crafting table. These are 'late-game' items that are extremely expensive to craft but give players something else to work towards if they have a ton of money and nothing to spend it on.</li><li>Added experimental steroids that the fire chief can purchase from the healer NPC. By default, these steroids will regenerate a player's health by 3 HP/sec for 10 minutes, but it has a rare chance of having the opposite effect. Combining weed with the steroid will cause players who consume it to turn into zombies. These zombies are highly infectious and can even transmit the infection for a short time after they're dead. Killing zombies with fire will kill the infection and make their corpses safe to approach.</li></ul><h3>Changes:</h3><ul><li>Weed plants will now only grow if they are outside or under a heat lamp inside.</li><li>Weed plants can now be destroyed if they take too much damage.</li><li>Revamped the meth-making process. The two ingredients used to make meth can no longer be purchased at the contraband dealer. Instead, they are made in the same pot as meth itself. Press your use key on an empty pot to change what is being made.</li><li>Inserting chloride before sodium in a meth pot will now cause a violent chemical reaction with black smoke and a loud noise, and an explosion 15 seconds later.</li><li>The propane canister can once again be destroyed, but it will not start fires or explode.</li><li>Revamped the coke-making process. The perfect purity will now always be 30 minutes after putting the raw coke in the purifier. Over-purifying coke will cause it to lose most of its value. Under-purifying coke will yield better results but value will still be lost.</li><li>The purifier will now display a timer to show how long it has been running.</li><li>The purifier can now take damage and randomly catch fire while it is running.</li><li>Reduced all payouts for coke. (Possibly temporary, might need rebalanced once people start using it.)</li><li>Revamped money printers. There is now only a single printer, but it can receive several different upgrades including max paper increase, sound level decrease, overheat chance decrease, and output increase. Upgrades can be stacked for a greater effect, and all upgrades and paper amount will now save when a printer is inventoried.</li><li>The undercover officer can now commit the same high-level crimes as normal civilian jobs.</li><li>Selecting the undercover officer in the F4 menu will now silently change your job without alerting anyone else or updating your job name on the scoreboard.</li><li>The handheld metal detector will now detect less police-specific items such as the confiscation and evidence tools. This will make it easier for you to keep your cover as undercover officer.</li><li>The shooter and bank robber NPCs will now spawn with random arc9 weapons and have a longer attack range.</li><li>Corpses of shooter and bank robber NPCs will now fade away after a short time.</li><li>Refined ores including diamond, gold, and ruby can now be inventoried.</li><li>Iron is now stackable in the inventory.</li></ul><h3>Deletions:</h3><ul><li>Removed the spider drone from the crafting table.</li><li>Removed the !undercover chat command as the new changes to the job make it redundant.</li></ul>"
	},
	{
		"title": "CityRP Update 6/27",
		"date": "June 27, 2023",
		"info": "<h3>Changes:</h3><ul><li>The mayor and all police jobs can now be tased, cuffed, and arrested like a regular civilian.</li><li>Replaced the taser with a better version that shoots physical wires. This version also uses ammo that can be obtained from ammo lockers. Non-police will need to break into the locker with a taser in their weapon slots to get ammo for it. The contraband version of the taser is no longer single-use due to the ammo addition.</li><li>The banker can now hand out loans to players through the same computer that they use to manage deposit boxes. Loans do not have any interest, even if payments are missed, and do not affect the city economy. Payments are automatically done every 5 minutes assuming the loaner can afford it, and debts are saved between sessions.</li><li>Players can no longer take out loans through ATMs. Any debts you may have had with the ATM loan system will not be transferred over to the new system.</li><li>The speed radar will now also give police officers the name of the car that sped past, instead of just the name of the driver.</li><li>Increased the strength of the rope leash to be the same as the shackles.</li><li>Enabled blindfolding and gagging on both leashes, and disabled the abilities on the shackles.</li><li>Adjusted the depths, prices, and catch times for all fish.</li><li>When fishing, there is no longer a progress bar with a set time until a fish bites. Bites now happen at random times and depend on the type of fish being caught.</li><li>Reduced the capacity of the medium fish cage from 10 to 8.</li><li>The ichthyosaur no longer randomly spawns when someone catches a fish.</li><li>Players can now only be revived 3 times in a single life. This prevents infinite death loops and removes the need for the rule relating to it.</li><li>Wanted text will no longer appear above player's heads, making it easier to hide.</li></ul><h3>Deletions:</h3><ul><li>Removed the handheld speed radar. If you wish to clock a player's speed while sitting in a police car, you can press O to bring up the Photon radar.</li><li>Removed the car evictor. It was redundant for police jobs as the battering ram does the same thing. The battering ram will soon be added to the contraband dealer to fill the gap for civilians.</li></ul>"
	},
	{
		"title": "CityRP Update 3/12",
		"date": "March 12, 2023",
		"info": "<h3>Additions:</h3><ul><li>Added flatbed tow truck that the mechanic can use for larger vehicles that the normal tow truck may not be able to handle.</li><li>Added world and view models to the mechanic's tow attach weapon.</li></ul><h3>Fixes:</h3><ul><li>Fixed an exploit with the fine system that allowed a player's money to go negative if they couldn't afford the fine. (Thanks to Rorkh on Github for this fix.)</li></ul><h3>Deletions:</h3><ul><li>Removed the EMS crown vic from the firefighter NPC.</li></ul>"
	},
	{
		"title": "HLU RP Update 2/28",
		"date": "February 28, 2023",
		"info": "<h3>Additions:</h3><ul><li>Added /name and /job chat commands that allow players to customize their name and role. Custom names are saved between sessions.</li><li>Added truck that players can use to 'escape' the facility during the cascade on BMRP. When players 'escape', they will join the HECU as either a marine or captain, depending on whether or not there is already a captain. Players will not be forced to remain as HECU, and can switch to a different role at any time.</li><li>Added fire extinguisher cases around all BMRP maps. Players can use these cases to obtain a fire extinguisher in emergency situations. The service official can restock cases by purchasing a fire extinguisher from the F4 menu and touching it with an empty case.</li><li>Added rubble that spawns during the cascade on BMRP. The rubble blocks access to high-traffic areas around the facility, and can only be removed by mining it with a pickaxe or blowing it up with explosives.</li><li>Added zombie serum to BMRP that the biochemist can craft. Players who consume this serum will instantly turn into zombies, and cannot be turned back unless killed.</li></ul><h3>Changes:</h3><ul><li>Players can no longer pickup weapons that they already have. This will prevent unintentional pickups when crafting or buying weapons.</li><li>Replaced the door failure event on BMRP with a tram failure. This event will now also activate during the cascade. The service official will still be able to resume tram operation by fixing the generator during the cascade.</li><li>Players who are killed by any type of headcrab will now turn into zombies.</li></ul><h3>Deletions:</h3><ul><li>Removed rp_blackmesa_complex and rp_blackmesa_laboratory maps.</li></ul>"
	},
	{
		"title": "CityRP Update 2/26",
		"date": "February 26, 2023",
		"info": "<h3>Additions:</h3><ul><li>Added Automod support to the new courier truck.</li></ul><h3>Changes:</h3><ul><li>When using an ammo locker, players will now directly receive the ammo instead of having it spawn in front of the locker. This will prevent people from taking ammo that someone else paid for.</li><li>Replaced the dump truck with the batmobile as the million dollar vehicle. It's sad to see it go but it was never practical due to its size. Players who owned the dump truck will receive the batmobile for free.</li><li>Job-specific vehicles such as police cars, fire trucks, and tow trucks will now be automatically removed when their owner disconnects or changes jobs.</li><li>Job-specific vehicles are now limited to 3 per player. If a player tries to spawn a 4th without removing at least one first, the last vehicle to be spawned will be removed.</li></ul><h3>Fixes:</h3><ul><li>Fixed the courier truck not showing up in the regular car dealer menu.</li><li>Fixed players not being able to buy sniper ammo from ammo lockers.</li><li>Fixed players being able to inventory items that were saved to a property.</li><li>Fixed money printers still trying to print after being removed.</li><li>Fixed mining carts spamming script errors when looking at them.</li><li>Fixed the menu for certain shop NPCs sometimes erroring when opened.</li></ul><h3>Deletions:</h3><ul><li>Removed the police Ford Explorer. It was redundant, didn't have a civilian version, and had so many lights it would cause the game to lag, so there was little reason to keep it around.</li></ul>"
	},
	{
		"title": "CityRP Update 2/21",
		"date": "February 21, 2023",
		"info": "<h3>Additions:</h3><ul><li>Added evidence confiscation system. This system will allow police to use an item called an evidence wand to send contraband items to an evidence locker located in a secure part of PD for processing or safekeeping. The locker can be accessed by anyone, including civilians.</li></ul><h3>Changes:</h3><ul><li>Combined the PD bank with the regular bank. Certain mechanics have been taken from both systems. Leaving the area will stop the robbery. Money bags will spawn every 2 minutes. The bags must be cashed in at the banker NPC after the robbery. Up to $20,000 can be taken during a robbery. After a robbery attempt, the bank cannot be robbed again for an hour. The bank can now also be robbed with only 1 cop on the server as long as there is also a banker on the server.</li><li>The city bank and mayor fund values are now the same, which means robbing the bank will have a negative impact on the city's balance. Along with this, the city now has the ability to make and spend money in multiple ways. The city can make money by increasing income, sales, and/or property taxes. The city can lose money by having the mayor buy things from the catalog such as extra weapons for police. The mayor can also set perks mentioned below that can increase or decrease the city's income depending on what they do.</li><li>Government and police jobs now receive paychecks from the city bank. This means that if the city bank value gets too low, these jobs will not receive any paychecks.</li><li>Eco points now update based on the city's current income and how much is in the bank. The mayor no longer has to manage them separately.</li><li>Replaced the mayor's random event system with a perk system that is accessed through the mayor menu. The mayor can activate perks to change certain aspects of the economy and the city in general. Some perks increase the city's income but has a negative consequence, while other perks decrease the city's income but make a positive change. Perks can be changed at any time, but only 3 can be active at once. If the mayor dies, leaves the server, or changes jobs, any active perks will be reset.</li><li>Replaced Stormfox 2 with Atmos for performance reasons.</li><li>Replaced the ArcCW weapon system with Arc9 and a very similar weapon pack. Most of the guns people had in their inventories will remain unchanged, and a lot of new guns have been added. All of the crafting, gun dealer, and supermarket prices for these weapons have been rebalanced.</li><li>Players can no longer refill the fuel tank of their personal vehicle by respawning it.</li><li>Improved the look of the death screen.</li><li>Life alert will now also activate when a player takes damage, and it will now specify to cops and firefighters what caused the alert to activate. (Injury, death, or manual alert)</li><li>Players will now be warned twice about not being able to afford property taxes before all of their properties are taken away.</li><li>Taking jobs from the job broker no longer costs money.</li><li>Money that players lose on death is now dropped near their body.</li><li>Firefighters will now only be rewarded for the house fire event if they are within the range of where the fire started, and cops will now only be rewarded for the drunk driver event if they are within range of where the driver was stopped.</li></ul><h3>Deletions:</h3><ul><li>Removed the !fixeco chat command since eco points no longer need to be directly managed by the mayor.</li><li>Removed Seat Weaponizer 2. It was causing microstuttering and the sit anywhere script allows players to use weapons anyway.</li></ul>"
	},
	{
		"title": "CityRP Update 12/27",
		"date": "December 27, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added the rock decimator. This is a gun that shoots a powerful beam that instantly mines rocks by destroying them. It can be bought from the supermarket and crafted and can be used 3 times before it is destroyed.</li><li>Added a gun dealer job. It is a civilian job that has the ability to sell weapons through custom shipments, as well as craft weapons at a reduced cost. The custom shipments allow the gun dealer to sell up to 10 of any gun that is available to craft or buy at the supermarket.</li><li>Added simple day/night cycle that switches between 12:00 AM and 12:00 PM every 30 minutes. This is being used instead of Stormfox's built-in system to reduce the amount of times the game freezes due to having to recalculate light maps.</li><li>Added label above the car dealer NPC so it's easier to find.</li><li>Added RTX 4090 explosive device that acts like a stick of dynamite. Interacting with it will set it on fire and after a few seconds it will explode.</li></ul><h3>Changes:</h3><ul><li>Combined the mayor fire menu with the normal mayor menu.</li><li>Revamped the default laws on the website to only list what players can't do, rather than what they can and can't do.</li><li>Due to the removal of the IA Agent, voting to remove the mayor from office can now be initiated by any citizen.</li><li>Reduced the salaries for most jobs.</li><li>Removed the crafting blueprint requirement for all guns except the LMG. (All explosives still require blueprints.)</li><li>The smelter can now duplicate iron for $50 each. To do this, place iron owned by you near the smelter and press your use key on it.</li><li>Replaced the graffiti SWEP with a newer and improved version from the workshop.</li><li>Cooked fish now restores full hunger and health.</li><li>The cook now gets a discount on farm products at the supermarket.</li><li>The microwave can no longer be stored in inventories.</li><li>Revamped the cook's moonshine system to use farm food as ingredients instead of its own set of food, and made each drink have its own special effects.</li><li>Merged the writable book with the money printer paper, and moved the money printer paper from the contraband dealer to the supermarket.</li><li>When buying gas from the pump, players will now only be charged for the amount they need, instead of paying $300 every time.</li><li>Increased walk and run speed when using cocaine.</li><li>Merged the smuggle system with the job broker. Items to deliver are now worth the same and are selected at random, but everything else remains unchanged.</li><li>Replaced semi trucks with the courier truck from the TDM commercial vehicle pack.</li><li>Moved the news TV to the supermarket. It can also now be inventoried.</li><li>The news cameraman will now only receive profits for news TVs that are not owned by him and are tuned to his channel.</li><li>Players can no longer save vehicles on properties. (This is temporary until I figure out a good solution to save owned vehicles but not temporary vehicles such as police cars and tow trucks.)</li><li>The shooter event now only rewards players who deal damage to the NPC.</li></ul><h3>Fixes:</h3><ul><li>Fixed farm plants not growing when receiving sunlight.</li><li>Fixed certain farm plants not spawning properly when planted.</li></ul><h3>Deletions:</h3><ul><li>Removed the IA Agent job.</li><li>Removed the Dodge Ram 3500 utility truck from the car dealer.</li></ul>"
	},
	{
		"title": "HLU RP Update 12/20",
		"date": "December 20, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added viewmodel to broom.</li><li>Added cascade function for rp_bmrf. (Manually activated for now, might try to tie it to the AMS at some point.)</li><li>Added noise that plays when messages are displayed in text chat.</li></ul><h3>Changes:</h3><ul><li>Players can no longer become resistance leaders on City 17 RP until the ceasefire is over.</li><li>Refugees and Combine jobs can no longer use the rebel item shop, and refugees and rebel jobs can no longer use the Combine vehicle shop on Outland RP.</li><li>The scientist no longer spawns in Combine captivity on City 17 RP.</li><li>The scientist can no longer detonate the citadel directly. Instead, he needs to first craft a locker key to give to the rebels, so that they can craft a code decrypter to be used on the detonation console.</li><li>Cancelling an active detonation or launch on City 17 RP or Outland RP is now done through the original console it was initiated on, instead of a separate cancellation button nearby.</li></ul><h3>Fixes:</h3><ul><li>Fixed OOC chat not working.</li><li>Fixed script errors sometimes appearing when people left the server.</li><li>Fixed players not being able to spawn the rebel crafting table on City 17 RP.</li><li>Fixed players not being able to spawn items from the rebel item shop on Outland RP.</li><li>Fixed sentries targeting friendlies on City 17 RP and Outland RP.</li><li>Fixed script errors appearing when players tried to use the keys or battering ram on invalid entities.</li></ul>"
	},
	{
		"title": "CityRP Update 11/12",
		"date": "November 12, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added a custom property system. Details will eventually be on the website, but you can ask me about it in the meantime. The main features are that each building or apartment is now ownable. You don't have to buy individual doors anymore, and they will remain owned by you even if you disconnect. You can also save entities on owned properties for later sessions through the context menu.</li></ul><h3>Changes:</h3><ul><li>Cops can now choose what type of sentence they want a criminal to serve when arrested. A reduced sentence automatically releases the prisoner after 5 minutes, while a full sentence does not automatically release the prisoner. This is intended to make it easier for cops to manually arrest someone without having to physically walk them into jail.</li><li>Money printers will now always have a 30 second delay before exploding when overheating, instead of a random number between 10 and 30 seconds.</li><li>Your position will now be saved when disconnecting.</li><li>Lock picking times now depend on the price of the property the door belongs to, meaning more expensive properties take longer to break into. If the door doesn't belong to a property, it will take 30 seconds to pick.</li><li>Replaced the bot in the drunk driver event with the reckless Dr. Kleiner NPC. In order to stop him, you now need to stop the vehicle from moving and press your use key on it. You don't have to use the car evictor and cuff the driver anymore.</li></ul>"
	},
	{
		"title": "CityRP Update 10/2",
		"date": "October 2, 2022",
		"info": "<h3>Changes:</h3><ul><li>The confiscation tool now displays a menu that allows cops to manually select what items to take. Items are also now given to the cop instead of being stored in the tool itself.</li><li>Players must now be cuffed to confiscate weapons from them.</li><li>The bus passenger event has been revamped to be much more in-depth. Bus drivers now pickup multiple NPCs at bus stops around the map and take them to a central location. NPCs will automatically board when the bus is in range and has come to a complete stop.</li><li>Revamped the food delivery event to make the cook deliver to existing NPCs around the map instead of a separate one that spawns at a random location.</li><li>Names once again appear above players' heads.</li><li>Players can now move while changing disguises so they have a chance to escape if their cover is blown.</li><li>Selling drugs as a civilian no longer has a chance to make you wanted.</li><li>Selling drugs as a gov or cop job will now activate a 10 minute cooldown.</li><li>The drug NPC will now teleport between 4 different locations every 30 minutes to prevent camping abuse from both cops and civilians.</li><li>Merged marketable and consumable drugs. To consume any drug now, you can press your use key on it. To sell any drug, you can press your use key on the drug NPC. The drug NPC will also now accept multiple drugs per use.</li><li>Moved the purifier to the contraband NPC. Since marketable weed is no longer a thing, the purifier only has the ability to purify cocaine now, and thus doesn't need to be a public entity anymore.</li><li>Reduced the selling price of weed from 500 to 300 due to the aforementioned changes.</li><li>The handheld metal detector will now display the illegal item's actual name instead of its entity name.</li><li>Spinach pizza no longer requires sauce as an ingredient.</li><li>Mayors who have been voted out of office will now be banned from entering elections for 30 minutes.</li><li>Turned the built-in prop protection back on and adjusted the physgun protection so people can't grab each other's junk anymore.</li><li>The money transfer event now requires the banker to deliver the check to the deposit boxes due to the check machine's removal.</li></ul><h3>Fixes:</h3><ul><li>Fixed players being able to find a gun that no longer exists as rare loot from dumpsters.</li><li>Fixed players being able to gravgun dumpsters and deposit box computers.</li><li>Fixed the ichthyosaur not being able to spawn on rp_southside_day.</li></ul><h3>Deletions:</h3><ul><li>Removed the chat commands related to changing and showing your identity. (A revamp of the undercover officer job is planned.)</li><li>Removed rp_florida_v2 and rp_newexton2_v4h. (Due to the nature of the upcoming property system it was necessary to let go of some maps. I may add one more back at some point.)</li><li>Removed the SWAT hummer. (It was hardly used and pretty redundant since the bearcat is better in almost every way.)</li><li>Removed the check machine. (Only used once or twice in the 4 or 5 years its been on the server, and there are plenty of other ways of getting $2,000 for emergency situations.)</li></ul>"
	},
	{
		"title": "CityRP Update 9/21",
		"date": "September 21, 2022",
		"info": "<p>This is part 1 of a major rework update for CityRP.</p><h3>Additions:</h3><ul><li>Added the rock scanner. It allows players to view the contents of rocks before mining. It can be bought at the supermarket.</li><li>Added tile build and primitive tools.</li><li>Added fire hose nodes that allow players to extend the hose range of their fire truck.</li></ul><h3>Changes:</h3><ul><li>Combined ore and iron rocks into a single entity. Spawns have remained the same. There are 5 tiers of rarity rocks can spawn with. The rarer it is, the higher amount of iron it will produce.</li><li>Rocks no longer always take 10 hits to mine, the number now depends on how much iron the rock contains.</li><li>Merged the ore smelter with the iron refiner. The iron refiner can now also process 3 things at once.</li><li>Random events are no longer random. They can instead be bought for a fee at a new NPC called the job broker. This NPC is located at the front desk of city hall on every map. Each event or job gives a reward to the person who completed it. Multiple events involving the same jobs cannot be active at once.</li><li>Replaced the SWAT jobs with a locker located at the PD armory on each map. This locker allows police officers to change into SWAT gear while saving their current gear in the locker. While on duty as SWAT, players walk slower and cannot use certain NPCs.</li><li>The citizen job no longer receives a $60 paycheck as they are considered unemployed/freelance/contractors.</li><li>Changed the slots of certain weapons so they don't all use the same slot and are easier to retrieve.</li><li>Moved car bomb protection from the supermarket to the mechanic's F4 buy menu.</li><li>Improved the car bomb explosion effect. The explosion is louder and now sends the car flying into the air.</li><li>Vehicles blown up by car bombs now get automatically removed after 10 minutes.</li><li>Changed the police radio keyup sound to be more realistic and play in 3D space so other people know when an officer is talking on the radio and not to them.</li><li>Increased the size of particles for the fire hose to make them easier to see when fighting large fires.</li><li>Renamed the ER Commander to Fire Chief and renamed the Emergency Responder to Firefighter.</li><li>The axe can now break open doors when used by firefighters.</li><li>Emergency responder jobs will no longer take burn damage.</li><li>Players now have to press their use key on hitmen to place a hit instead of using a chat command.</li><li>Hitmen can no longer see their target on the HUD. They will now have to verify they have the right guy before going in for the kill.</li><li>The mechanic now rents out semi trucks and trailers instead of an NPC doing it.</li><li>When a dump truck spawns, only players within the spawn zone will be notified now when the truck is about to spawn.</li></ul><h3>Fixes:</h3><ul><li>Fixed emergency responders being able to use the fire hose anywhere even if a fire truck isn't nearby.</li><li>Fixed the firefighter NPC spawning in the wrong place on certain maps.</li><li>Fixed grenades not being able to be thrown.</li><li>Fixed the money transfer event not rewarding players with a tier 2 blueprint.</li></ul><h3>Deletions:</h3><ul><li>Removed the courier NPC and related entities. (Replaced by the job broker)</li></ul>"
	},
	{
		"title": "CityRP Update 7/18",
		"date": "July 18, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added life insurance item to the healer NPC. When a player has life insurance, they will not lose money when they die for the rest of the session.</li></ul><h3>Changes:</h3><ul><li>Merged the firefighter and paramedic NPCs into one. Fire trucks and ambulances are now both spawned at the fire station.</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to cash in stolen deposit box money bags.</li><li>Fixed players losing money on death during a purge, and not losing money on death during a lockdown.</li></ul><h3>Deletions:</h3><ul><li>Removed announcement system. (Same reason it was removed from HLU RP, broken and not very useful to begin with.)</li></ul>"
	},
	{
		"title": "HLU RP Update 7/14",
		"date": "July 14, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added task system for BMRP. The facility administrator can assign tasks to different jobs by pressing F1. Tasks can either be set from a predefined list, or manually set with custom text. Players can see their current task in the upper left corner, similar to DarkRP agendas.</li><li>Added keybindings and chat commands page to the website.</li></ul><h3>Changes:</h3><ul><li>Improved the look of the playermodel selector and scoreboard.</li><li>Revamped the BMRP event system. It is no longer random and instead controlled by the government man through a menu that can be accessed by pressing F1. The events themselves are mostly the same as before, any changes will be listed below.</li><li>Revamped the BMRP budget system. Players once again have control over their own money. Funds can be obtained by completing events and tasks, and selling unused materials and equipment. Funds can be spent on things in the new buy menu.</li><li>Survey members are now fully immune to radiation damage, and biochemists now have radiation damage reduced by 50%.</li><li>Radioactive crafting materials can no longer be transported in player's pockets, and now need to be transported in radioactive material containers, which the biochemist can purchase.</li><li>The medic revive event now causes a player to faint instead of an NPC.</li><li>Fires will now slowly fade out on City 17 RP and Outland RP, but will slowly grow until extinguished on BMRP.</li><li>Reduced the health of bosses for the boss fight event to 1000 HP.</li><li>Entities that are mined and crafted will now be owned by the player who obtained it. This will prevent certain prop protection issues from occurring.</li></ul><h3>Fixes:</h3><ul><li>Fixed certain radioactive crafting materials causing much more radiation damage than they should.</li></ul><h3>Deletions:</h3><ul><li>Removed automated vox announcements from rp_bmrf to prevent players from thinking the announcements came from the facility administrator.</li><li>Removed voice announcement system. (It never worked right and isn't that necessary to begin with.)</li></ul>"
	},
	{
		"title": "CityRP Update 7/13",
		"date": "July 13, 2022",
		"info": "<h3>Fixes:</h3><ul><li>Fixed drones immediately breaking when spawned by the shop NPC.</li><li>Fixed molotovs not spawning when bought from the contraband NPC or found while dumpster diving.</li><li>Fixed potholes spawning above the ground.</li></ul>"
	},
	{
		"title": "HLU RP Update 7/5",
		"date": "July 5, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added /y (yell) and /w (whisper) chat commands.</li><li>Added the buy menu back. This eliminates the need for item shops on BMRP and City 17 RP, as well as pre-spawned crafting tables on City 17 RP. All players can access the menu at any time by pressing F3.</li><li>Added Falco's Prop Protection back.</li></ul><h3>Changes:</h3><ul><li>Voice chat is now 3D, meaning voice will emit from the speaking player and will get quieter as distance from them increases.</li><li>Certain HL1 weapons now use HL2 ammo for better compatibility with the ammo locker.</li><li>Scoreboard text will now change to white if the background color is too dark to read black text.</li><li>Reworked the job selection menu to make it much neater. Descriptions can now be accessed by clicking the question mark on the right side of each job, and playermodels can be selected by clicking the model icon on the left side of each job.</li><li>Updated rp_city24_v2 to rp_city24_v3.</li><li>The forklifts on BMRP are now restricted to service officials and cannot be used by any other job.</li><li>Slightly decreased jumping power.</li><li>Xen NPCs on BMRP will now automatically respawn 10 minutes after the last one is killed.</li><li>Headcrabs will no longer spawn in Xen on BMRP since bullsquids tend to kill them immediately after spawning.</li><li>Player expressions will now take effect immediately after changing jobs and no longer require a respawn.</li><li>The scientist on City 17 RP can now spawn the combine crafting table and no longer requires the earth admin to do it for them.</li><li>The overwatch guard can now spawn the same medical items as the rebel medic on Outland RP.</li><li>The facility administrator will now be notified of any purchases that use the facility budget on BMRP.</li><li>The technician can now buy the GTerminal Wiremod I/O device on BMRP.</li></ul><h3>Fixes:</h3><ul><li>Fixed service official being able to throw away blacklisted items on BMRP.</li><li>Fixed government man not spawning with his teleporter.</li><li>Fixed the service official's broom not clearing decals on BMRP.</li><li>Fixed the head of security on BMRP and the resistance leader on City 17 RP not spawning with enough ammo.</li><li>Fixed overwatch and preset vox announcements not playing.</li><li>Fixed player expressions not working with newer playermodels.</li><li>Rewrote gman's teleporter from scratch to fix a bunch of problems it had.</li><li>Fixed view model hands not changing.</li></ul><h3>Deletions:</h3><ul><li>Removed research and development job from BMRP. (Job was redundant. The few exclusive items it had were absorbed into the rest of the science jobs.)</li></ul>"
	},
	{
		"title": "CityRP Update 5/28",
		"date": "May 28, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added !discord chat command that displays the link to the Lambda Gaming Discord.</li></ul><h3>Changes:</h3><ul><li>Adjusted global StormFox settings for better optimization.</li><li>Replaced rp_southside with its daytime version for better StormFox compatibility.</li><li>Players now have to wait 30 seconds after selecting the dump truck at the car dealer for it to spawn. This will give players time to clear the truck's spawning area. This also prevents multiple players from spawning the dump truck at the same time.</li></ul>"
	},
	{
		"title": "HLU RP Update 5/27",
		"date": "May 27, 2022",
		"info": "<h3>Additions:</h3><ul><li>Added !discord chat command that links to the Lambda Gaming Discord.</li></ul><h3>Changes:</h3><ul><li>Preset vox and overwatch announcement chat commands are now called differently. The new format is !announce [keyword]. See <a href='https://lambdagaming.github.io/hlurp/commands.html'>the website</a> for more info.</li><li>Increased the cooldown for vox and overwatch chat commands from 5 seconds to 10.</li><li>The vox chat and console command is now available for the facility administrator and is no longer exclusive to server admins.</li></ul>"
	},
	{
		"title": "HLU RP Update 10/24",
		"date": "October 24, 2021",
		"info": "<h3>Fixes:</h3><ul><li>Fixed players not being able to pocket heavy objects even if they were whitelisted.</li><li>Fixed crystals instantly respawning after being mined on BMRP.</li><li>Fixed players not being able to release cuffed players.</li></ul>"
	},
	{
		"title": "HLU RP Update 10/23",
		"date": "October 23, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added gamemode logo for the main menu.</li></ul><h3>Changes:</h3><ul><li>Players who change their job from scientist on City 17 RP will now respawn at the default map spawn to prevent them from potentially getting stuck in the citadel.</li><li>Clicking a player's name on the scoreboard will now take you to their Steam profile.</li><li>The BMRP nuke will now turn on the facility alarm when activated.</li></ul><h3>Fixes:</h3><ul><li>Fixed the Combine door authenticator having two hand models.</li></ul>"
	},
	{
		"title": "CityRP Update 10/10",
		"date": "October 10, 2021",
		"info": "<h3>Changes:</h3><ul><li>Players will now enter the drivers seat of vehicles if it is available, even if there are passenger seats that are closer to the player.</li></ul><h3>Fixes:</h3><ul><li>Fixed the parade and purge not ending if the mayor left the server after activating them.</li></ul>"
	},
	{
		"title": "CityRP Update 10/3",
		"date": "October 3, 2021",
		"info": "<h3>Changes:</h3><ul><li>Adjusted some accessories so they don't clip through certain playermodels.</li><li>Adjusted StormFox settings to improve performance and night lighting.</li><li>Weapon attachments will no longer reset on death.</li></ul><h3>Fixes:</h3><ul><li>Fixed the purifier almost instantly purifying weed and playing sounds when it shouldn't be.</li><li>Fixed supermarket NPC spawning broken blueprints.</li><li>Fixed rock and tree grinders sometimes spawning money in the wrong place.</li><li>Fixed Chevy Impala police not spawning with Photon support.</li><li>Fixed Dodge Monaco police spawning with an extra light bar.</li><li>Fixed the power failure mayor event not displaying properly if the first option was chosen.</li><li>Fixed BH Accessories creating script errors when a player hovered over the ghastly gibus in the accessory menu.</li><li>Fixed Chevy Tahoe police spamming console when its lights were on.</li><li>Fixed Accessory Vendor not spawning on some maps.</li><li>Fixed rock and tree grinders spawning in the air on some maps.</li></ul>"
	},
	{
		"title": "CityRP Update 9/27",
		"date": "September 27, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added StormFox 2.</li><li>Added the weather forecaster back to the news cameraman's F4 menu.</li><li>Added Material URL Tool.</li></ul><h3>Fixes:</h3><ul><li>Fixed Photon spamming console when the CVPI had its lights on.</li></ul>"
	},
	{
		"title": "CityRP Update 6/12",
		"date": "June 12, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added BH Accessories. (A handful of popular TF2 hats are currently in the shop. More will be added at player request.)</li></ul><h3>Changes:</h3><ul><li>Moved some addons to a workshop collection to slightly improve performance.</li><li>All government jobs besides the mayor will now get 20 rounds of shotgun ammo and 50 rounds of every other ammo when they spawn. (Ammo can also no longer be spawned through the F4 menu.)</li></ul><h3>Fixes:</h3><ul><li>Fixed police being able to buy ammo from the locker even if there wasn't enough money in the mayor funds.</li><li>Fixed police not being able to buy ammo from the locker if they didn't have enough money in their personal wallets but there was enough in the mayor funds.</li><li>Fixed !undercover chat command silently failing if the job change cooldown was still active.</li></ul>"
	},
	{
		"title": "Sandbox Update 6/9",
		"date": "June 9, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added workshop collection for the server to improve performance and allow players to download maps automatically.</li><li>Added LuaSeats, the buoyancy tool, and the resizer tool.</li></ul><h3>Changes:</h3><ul><li>Gave everyone access to god mode and noclip and removed the buildmode command. (Players who abuse these new privileges will have them permanently revoked.)</li></ul><h3>Deletions:</h3><ul><li>Removed photon variants of vehicles that were no longer on the server.</li></ul>"
	},
	{
		"title": "CityRP Update 6/7",
		"date": "June 7, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added frag, flash, and smoke grenades back.</li><li>Added the HL2 airboat to the car dealer.</li><li>Added feature to the brake release tool (now named vehicle management tool) that rotates the target vehicle 180 degrees so it can be towed easier.</li></ul><h3>Changes:</h3><ul><li>Increased the cop requirement for robbing banks and smuggling back to 2.</li><li>Revamped the blueprint system to make them easier and cheaper to obtain.</li><li>Rewrote the meta gaming rule to state that players can use outside communication, but it's recommended they use in-game text chat when participating in major RP events so innocence and guilt can be easily proven if a rule is broken.</li><li>Replaced the Remington 870 with the KS-23 due to it being unfinished and overpowered. (If you had this weapon in your inventory it was also replaced.)</li><li>Rebalanced all weapon damages. (Thanks to Kitawna80 and Nostalgia Man for taking time to do this.)</li><li>All vehicles now get precached when the server first loads. (This will greatly reduce the amount of freezing/connection problems players experience.)</li></ul><h3>Fixes:</h3><ul><li>Fixed police not being able to return stolen money bags to the government bank vault.</li><li>Fixed large metal detector not detecting weapons in player inventories.</li><li>Fixed vehicles not smoking when their health falls below 30%.</li></ul><h3>Deletions:</h3><ul><li>Removed wardrobe and PAC3. (To be replaced with BH Accessories at a later date.)</li></ul>"
	},
	{
		"title": "CityRP Update 5/16",
		"date": "May 16, 2021",
		"info": "<h3>Changes:</h3><ul><li>Replaced the Police Chief's Deagle with the Raging Bull.</li><li>Increased iron spawn height when mining iron rocks so they can't fall through the map.</li><li>Increased weapon damage to 50%. (More tweaks are still likely to come.)</li></ul><h3>Fixes:</h3><ul><li>Fixed news camera sometimes creating script errors when opening the camera menu.</li><li>Fixed Automod creating script errors when trying to change seats the moment a vehicle is removed.</li><li>Fixed potholes, the ore grinder, and the sawmill spawning too high above the ground on rp_riverden_v1a.</li><li>Fixed players not being able to craft car bombs.</li></ul><h3>Deletions:</h3><ul><li>Removed 3D Stream Radio. (YouTube support was extremely unreliable and it was removed completely in a newer version of the addon so I figured it wasn't worth keeping it around.)</li></ul>"
	},
	{
		"title": "CityRP Update 5/10",
		"date": "May 10, 2021",
		"info": "<h3>Changes:</h3><ul><li>Started to nerf the new weapon system by blacklisting certain attachments and lowering overall damage. (More tweaks will come later.)</li></ul><h3>Fixes:</h3><ul><li>Fixed tow truck NPC creating script errors when spawning.</li><li>Fixed weapons that take AR2 and 357 ammo not receiving ammo from the ammo locker.</li></ul>"
	},
	{
		"title": "CityRP Update 5/5",
		"date": "May 5, 2021",
		"info": "<h3>Changes:</h3><ul><li>Improved HUD, tire hit detection, default controls, and constraint detection for Automod.</li><li>Replaced spike strip model again.</li><li>Replaced CW weapons with ArcCW equivalents. (Old weapons or weapon blueprints that still exist in the new pack will still be in your inventory, and you will receive a cash refund for any removed weapons, blueprints, or attachment packs.)</li><li>Replaced rp_evocity2_v5h with rp_riverden_v1a.</li><li>Improved Dodge Monaco police light pattern.</li></ul><h3>Fixes:</h3><ul><li>Fixed Ichthyosaur not being able to spawn on rp_southside.</li></ul>"
	},
	{
		"title": "Sandbox Update 3/31",
		"date": "March 31, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added gm_mines, gm_york, rp_jedivssith, Outfitter, Bio-Annihilation II, Gredwitch Flammpanzer pack, and Gredwitch German Big Tank Pack.</li><li>Added TF2 hats to the pointshop.</li><li>Added Simfphys variants of certain vehicles that I thought would benefit most from the better physics.</li><li>Replaced Infinity Gauntlet with gPowers.</li><li>Replaced party system with the Sandbox Team Manager.</li><li>Replaced CW 2.0 weapons with ArcCW weapons. (See collection for full list of new weapons.)</li><li>Replaced WAC Aircraft with LFS. (See collection for full list of new aircraft.)</li></ul><h3>Deletions:</h3><ul><li>Removed M9K weapon packs, gm_botmap_v3, gm_secretconstruct_v3, gm_lunarbase, fightspace3b, gm_blackmesa_sigma, Homer Simpson playermodel, Skinner playermodel, Gaben playermodel pack, Nyan Gun, Gmod Tower playermodel pack, Police playermodels, Pepsiman playermodel, ParachuteZ Redux, GBombs, and CS:S weapon pack.</li></ul>"
	},
	{
		"title": "CityRP Update 3/7",
		"date": "March 7, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added red light to the heat lamp to indicate when it's not properly positioned over a plant.</li></ul><h3>Changes:</h3><ul><li>Nerfed the knife so it can't destroy a vehicle in 2 hits.</li></ul><h3>Fixes:</h3><ul><li>Fixed a bunch of GChroma stuff creating errors for players who didn't have the module.</li><li>Fixed Dodge Monaco and Ford Taurus police spawning with the wrong skins.</li><li>Fixed heat lamp sometimes creating script errors when damaged by fire while turned off.</li></ul>"
	},
	{
		"title": "CityRP Update 3/6",
		"date": "March 6, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added Automod support for the patty wagon.</li></ul><h3>Changes:</h3><ul><li>Improved tire popping system so the hit area scales with the size of the tire.</li></ul><h3>Fixes:</h3><ul><li>Fixed tire repair tool raising the car off the ground a few inches and sometimes causing weird physics glitches.</li></ul>"
	},
	{
		"title": "CityRP Update 1/16",
		"date": "January 16, 2021",
		"info": "<h3>Additions:</h3><ul><li>Added GChroma Sandbox Module. (Specific server-related lighting events will come later.)</li></ul><h3>Changes:</h3><ul><li>Moved the car bomb blueprint from tier 3 to tier 2.</li></ul>"
	},
	{
		"title": "CityRP Update 12/30",
		"date": "December 30, 2020",
		"info": "<h3>Fixes:</h3><ul><li>Fixed handcuffs sometimes creating script errors when a cuffed player took damage.</li><li>Fixed stolen courier bag creating script errors when a player pressed their secondary fire with it equipped.</li><li>Fixed exploit where players could pay off an ATM loan without losing money if they had 0 dollars in their wallet.</li></ul>"
	},
	{
		"title": "Happy 5th Anniversary!",
		"date": "December 29, 2020",
		"info": "<p>Hard to believe, but Lambda Gaming is 5 years old today. I'd like to give a special thanks to everyone who has stuck with us up to this point, even through the gaps of inactivity. At this point, I'm almost certain I'll keep going for another 2 years. After that though, It's hard to say what will happen. We'll just have to cross that bridge when we get to it. I'm hoping for the best case scenario, in which I'll still be available to host but only during very specific times. Anyway, thanks again to everyone who helped keep this community going. Here's to another 5 years!</p>"
	},
	{
		"title": "CityRP Update 12/20",
		"date": "December 20, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added patty wagon. (This is a special vehicle that was added in honor of Lambda Gaming's upcoming 5th anniversary. All active members who have been with us since 2016 have been given this vehicle for free. For everyone else, it is available to buy at the car dealer for $500,000.)</li></ul><h3>Changes:</h3><ul><li>C4 will now unfreeze and move physics props within the blast radius.</li><li>The heat lamp now requires fuel to operate.</li><li>The government bank vault will now re-want players even if they are already wanted so police can see the notification.</li><li>Renamed meth stove gas to propane canister and moved it to the supermarket.</li></ul><h3>Deletions:</h3><ul><li>Removed beverage trailer from the trucker NPC since the inside is solid and can't be used for anything.</li></ul>"
	},
	{
		"title": "CityRP Update 12/11",
		"date": "December 11, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added blowout system from HLU RP for special events.</li></ul><h3>Fixes:</h3><ul><li>Fixed the semi tow truck spawning into the tow building on rp_rockford_v2b.</li><li>Fixed mayor vote system placing a missing texture over the face of whoever the player voted for. (Only took 4 years to fix this.)</li></ul><h3>Deletions:</h3><ul><li>Removed LED screen tool.</li></ul>"
	},
	{
		"title": "CityRP Update 12/2",
		"date": "December 2, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added smelter that can be used to smelt ores mined from rocks. (Can be purchased at the supermarket. See the website for detailed description of what it does.)</li><li>Added wardrobe that players can use to access PAC3. (Can be obtained from the crafting table.)</li><li>Added a running sound to the purifier.</li></ul><h3>Changes:</h3><ul><li>Merged rock and tree mining carts into one. (Type of cart is determined by the first item that gets placed into it. The type will reset when the cart is placed into a grinder or sawmill.)</li><li>Reduced the amount of money received from grinding rocks (now known as iron ore) and gold ore.</li><li>Ores and logs will no longer despawn after 10 minutes of inactivity.</li><li>Purified drugs will now always spawn to the left of the purifier, no matter what its orientation is on the map.</li><li>Increased the cooldown for switching jobs from 10 seconds to 1 minute.</li><li>Replaced the wrench in all explosive crafting recipes with the new smelted materials.</li></ul><h3>Fixes:</h3><ul><li>Fixed ores always having the same mass until the server restarted.</li><li>Fixed consumable cocaine not getting removed after being used.</li><li>Fixed consumable meth and cocaine trying to play a sound that didn't exist when used.</li><li>Fixed fire truck NPC spawning in the garage instead of at the front desk on rp_truenorth_v1a.</li><li>Fixed contraband NPC facing the wrong way on rp_florida_v2.</li></ul>"
	},
	{
		"title": "CityRP Update 11/27 Part 2",
		"date": "November 27, 2020",
		"info": "<h3>Changes:</h3><ul><li>The mayor can now fire emergency response jobs.</li><li>The supermarket and contraband dealer menus will no longer close after an item is purchased.</li></ul><h3>Fixes:</h3><ul><li>Fixed plant seeds sometimes creating script errors when looked at.</li><li>Fixed contraband dealer being affected by sales tax.</li><li>Fixed smuggle truck and overturned semi truck spawning in the ground on rp_florida_v2.</li><li>Fixed the old DJ radio still being an item that can be found in dumpsters.</li></ul>"
	},
	{
		"title": "HLU RP Update 11/27",
		"date": "November 27, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added 3D stream radio back.</li><li>Added custom scoreboard so players can see what jobs other players are playing as.</li></ul><h3>Fixes:</h3><ul><li>Fixed certain BMRP weapons not accepting ammo from the ammo locker.</li><li>Fixed mineable objects turning sideways after respawning.</li><li>Fixed all players being able to spawn weapons.</li><li>Fixed BMRP xen breach event creating script errors when trying to spawn a bullsquid.</li><li>Fixed BMRP item shop crates spawning half way into the ground.</li><li>Fixed flare gun creating script errors when fired. (Again)</li><li>Fixed vortigaunt SWEP creating script errors when a player died while having it equipped.</li></ul>"
	},
	{
		"title": "CityRP Update 11/27",
		"date": "November 27, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added 3D stream radio.</li><li>Added one-time-use armor kit. (Works the same way as the one-time med kit but with armor.)</li></ul><h3>Changes:</h3><ul><li>Changed the names of certain NPCs to make them more straightforward. (Ex: Breakout NPC is now called the Jailbreaker.)</li></ul><h3>Fixes:</h3><ul><li>Fixed gas pumps sometimes fueling a different player's car.</li><li>Fixed handheld speed radar detecting the user's vehicle if they were sitting in it while scanning.</li></ul><h3>Deletions:</h3><ul><li>Removed Jaguar XFR. (Jas was the only one who owned one so Jas if you're reading this you've been refunded 30k.)</li><li>Removed DJ system. (Only worked about 25% of the time. The 3D stream radio should make up for it, especially with its advanced wiremod features.)</li></ul>"
	},
	{
		"title": "CityRP Update 11/25",
		"date": "November 25, 2020",
		"info": "<h3>Changes:</h3><ul><li>The mayor will now have god mode for the 10 minute cooldown after getting elected. If he kills anyone during the cooldown, he will automatically get demoted back to citizen.</li><li>Increased the resistance of contraband handcuffs and leashes.</li><li>The handcuff breakout status will now reset when the handcuffed player gets damaged.</li></ul><h3>Fixes:</h3><ul><li>Fixed car dealer UI taking a few seconds to load.</li></ul><h3>Deletions:</h3><ul><li>Removed some more redundant server rules and default laws.</li></ul>"
	},
	{
		"title": "CityRP Update 11/15",
		"date": "November 15, 2020",
		"info": "<h3>Changes:</h3><ul><li>Crafting blueprint in the inventory will now display the item the blueprint is for and how many uses it has left.</li><li>Reverted vehicle system back to the old damage system. (New system is too sensitive and inaccurate; old system will have to do until I find a better alternative.)</li><li>Increased price of the one-time-use medkit. (Before it was cheaper than buying the health straight from the NPC.)</li><li>Increased the time it takes for a car to burn up from 30 seconds to 2 minutes so players have enough time to extinguish the flames.</li></ul>"
	},
	{
		"title": "CityRP Update 10/13",
		"date": "October 13, 2020",
		"info": "<h3>Changes:</h3><ul><li>Remade deposit box system from scratch. (The system is pretty much the same functionally, but there's a lot less bugs now. The biggest change you'll notice is that you need to take stolen money bags to the banker NPC instead of the van.)</li><li>Remade smuggle system to use the item NPC. (The biggest changes you'll notice with this is that police confiscation works properly now, and players can now sell smuggle trucks that another player bought.)</li><li>The same mayor event will no longer happen twice in a row.</li><li>Physics damage for vehicles is now determined based on momentum instead of velocity.</li></ul><h3>Fixes:</h3><ul><li>Fixed mayor funds sometimes becoming a large decimal that goes off of the screen.</li><li>Fixed notification not showing up for the negative outcome of the vehicle recall mayor event.</li><li>Fixed vehicles not taking bullet damage again.</li></ul><h3>Deletions:</h3><ul><li>Removed paramedic playermodels. (They were hardly used after the emergency response jobs were merged. Kleiner and Magnusson playermodels were added in case people still want a doctor playermodel.)</li></ul>"
	},
	{
		"title": "HLU RP Update 8/21",
		"date": "August 21, 2020",
		"info": "<h3>Changes:</h3><ul><li>Replaced Half-Life NPC pack with an updated version to fix current and future conflictions with other addons. (You can stay subscribed to the old pack if you want; they use the same resources.)</li><li>Replaced legacy JMod turrets with the updated ones. (The rest of the JMod addon is also now accessible through the rebel item shop and crafting table on Outland RP.)</li><li>Improved placement and hitbox of the Combine food dispenser on all City 17 RP maps.</li><li>Moved the rebel item shop to a more open area on both Outland RP maps.</li><li>Improved description text for the job selection menu.</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to buy health kits and armor batteries from the rebel item shop on Outland RP.</li><li>Fixed scientists sometimes not teleporting during the pre-round on Cascade.</li></ul>"
	},
	{
		"title": "CityRP Update 8/17",
		"date": "August 17, 2020",
		"info": "<h3>Changes:</h3><ul><li>Replaced SWAT shield with a more realistic one. (The new shield has unlimited health but limited visibility. It's also a separate addon now so you'll have to subscribe to it through the collection.)</li><li>Increased the range of the fire hose from 100 units to 300. (I might increase it more if it still can't reach the center of large building fires.)</li><li>Test drives will no longer end prematurely if the driver leaves the vehicle.</li><li>Decreased the price of the Dodge RAM 1500 from 30k to 20k.</li></ul><h3>Fixes:</h3><ul><li>Fixed vehicle repair SWEP sometimes not emitting sound when in use.</li><li>Fixed horn sound still not playing on certain trucks.</li></ul><h3>Deletions:</h3><ul><li>Removed Ford F-150 pickup truck. (Utility and police variants of this truck have been replaced with the Dodge RAM 3500. Any player who owned the civilian variant was given a free Dodge RAM 3500.)</li><li>Removed the 1964 Chevy Impala SS and 1982 Porche 911 Turbo.</li></ul>"
	},
	{
		"title": "CityRP Update 8/14",
		"date": "August 14, 2020",
		"info": "<h3>Additions:</h3><ul><li>Remade fine system from scratch and added support for parking fines. (Police chief, police officer, undercover officer, and mechanic all have the ability to fine parked cars.)</li><li>Added feature to car bomb that allows the user to set when the bomb goes off. (Right click to cycle through the different settings.)</li></ul><h3>Changes:</h3><ul><li>Water no longer causes money printers to explode, and instead will now prevent them from catching fire.</li><li>Merged the Utility Worker job with the Mechanic job.</li></ul><h3>Fixes:</h3><ul><li>Fixed vehicles not taking bullet damage and vehicle passengers not taking any damage.</li><li>Fixed vehicle repair tool only repairing one tire even if more were popped.</li></ul>"
	},
	{
		"title": "CityRP Update 7/21",
		"date": "July 21, 2020",
		"info": "<h3>Fixes:</h3><ul><li>Fixed dump truck not spawning properly on rp_southside.</li><li>Fixed detective markers creating script errors if a player disconnects after dying.</li></ul>"
	},
	{
		"title": "CityRP Update 7/20",
		"date": "July 20, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added section to the bugs and glitches page on the website to warn players about farm plants potentially not growing.</li></ul><h3>Changes:</h3><ul><li>Revived players will now get their old job back.</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to respawn after dying.</li><li>Fixed random events creating script errors when a player gets handcuffed.</li><li>Fixed ammo locker sometimes creating script errors when used.</li><li>Fixed hospital NPCs facing the wrong way on rp_rockford_v2b.</li><li>Fixed fire truck NPC spawning at the truck spawn instead of it's own spawn on rp_rockford_v2b.</li><li>Fixed meth and weed creating script errors if a player disconnects while selling either drug as a government official.</li></ul>"
	},
	{
		"title": "CityRP Update 7/19",
		"date": "July 19, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added chat command that allows players to become undercover officers without the rest of the server getting a notification about it and having it show up on the scoreboard.</li><li>Added markers that will generate after a player kills another player that the detective can use as a piece of evidence. (Only the detective can see these markers. The icon will either be a gun or a car depending on how the killer got away.)</li><li>Added a 1% chance for rare items to be picked out of dumpsters. (Rare items currently include: M1 Garand, car bomb, weed plant, Mosin Nagant, consumer-grade meth, and Desert Eagle.)</li><li>Added default law stating that detectives have a right to keep client info a secret. (Used to be a rule but is now optional.)</li><li>Added random event for bus driver that requires the driver to take a passenger to a random building.</li></ul><h3>Changes:</h3><ul><li>Detectives will now get notified alongside bankers and law enforcement jobs for suspicious bank activities.</li><li>Disabled all player info that displays above players heads besides health.</li><li>Restored positive/negative effects on the mayor funds that were in place before the NPC changes.</li><li>The economy will now auto-balance itself when there is no mayor to make changes to it. (The balancing likely won't be dramatic unless the mayor funds get completely drained.)</li><li>Ammo locker prices are now affected by sales tax.</li><li>Merged the blueprint dumpster with the normal dumpster and added the tier 1 blueprints to the shop NPC.</li><li>Replaced the ammo lockers with the universal one from HLU RP. (This now means that players can rob any ammo locker on the map and cops are no longer charged out of their own wallets for locker ammo, it comes out of the mayor funds.)</li><li>Players will no longer respawn in jail if they die there.</li><li>Players will now be taxed based off of the number of doors they own.</li><li>Increased the amount of doors that can be owned at once from 8 to 10.</li><li>Moved the breakout NPC to near the jail entrance on all maps. (Also added an extra one to the prison on rp_florida_v2.)</li><li>Replaced the police tahoe with the old suburban/tahoe pack. (The cars in the old pack handle much better than the new one.)</li><li>Reduced the amount of money cooks make from the pizza delivery event.</li></ul><h3>Fixes:</h3><ul><li>Fixed players being able to set jail spawns as police chief even if they weren't admin.</li><li>Fixed vehicle for the drunk driver event sometimes spawning as a trailer.</li><li>Fixed players being able to activate cruise control while their vehicle is turned off.</li><li>Fixed other random events sometimes activating while the drunk driver event was active.</li><li>Fixed passenger seats sometimes saying they're taken when they actually aren't.</li><li>Fixed players sometimes not being able to leave vehicle passenger seats.</li><li>Fixed sales tax being applied to free shop items such as police cars.</li></ul><h3>Deletions:</h3><ul><li>Removed default laws related to truck manifests, hunting, and spawn restrictions.</li></ul>"
	},
	{
		"title": "CityRP Update 7/14",
		"date": "July 14, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added cooldown back to the courier NPC. (Not sure why it was removed in the first place.)</li></ul><h3>Changes:</h3><ul><li>Farm plants will no longer remove themselves when harvested. (This will also fix plants outputting less money than was invested into them.)</li><li>Moved farmer NPC on rp_newexton2_v4h to somewhere else away from the popular farming spots. (Location has been updated on the website.)</li><li>Cars for the drunk driver random event will now spawn in a random location instead of in front of the car dealer each time.</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to lock their cars.</li><li>Fixed Glock 17 not accepting pistol ammo.</li><li>Fixed horn not working for trucks.</li><li>Fixed all players getting mayor events. (Again)</li><li>Fixed potato plants not growing.</li></ul>"
	},
	{
		"title": "CityRP Update 7/12",
		"date": "July 12, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added Stealthy Door Opening. (Workshop addon that allows players to quietly and slowly open doors while crouched.)</li></ul><h3>Changes:</h3><ul><li>Revamped mayor events to make them more effective and less repetitive.</li><li>The mayor can no longer receive events or buy perks while a purge is active.</li></ul><h3>Fixes:</h3><ul><li>Fixed door groups not working.</li><li>Fixed mayor event client functions not being networked to the server in very rare cases. (This should also fix all unexplained bugs that have happened with the economy system over the years.)</li></ul>"
	},
	{
		"title": "Sandbox Update 6/16",
		"date": "June 16, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added gm_wuhu.</li></ul><h3>Deletions:</h3><ul><li>Removed Stormfox. (Causes client lag on large maps, will be added back if it ever gets fixed.)</li><li>Removed old maps from the random map button.</li></ul>"
	},
	{
		"title": "CityRP Update 6/16",
		"date": "June 16, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added player ejection feature to Automod.</li></ul><h3>Fixes:</h3><ul><li>Fixed Photon displaying messages about missing models when spawning certain vehicles.</li></ul>"
	},
	{
		"title": "CityRP Update 6/12",
		"date": "June 12, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added sales tax to gas pumps that charges law enforcement and government jobs if it's 50% or over.</li></ul><h3>Changes:</h3><ul><li>Replaced civilian fire extinguisher with the infinite one and raised the price of it in the shop.</li><li>Decreased the amount law enforcement and government officials get from selling drugs by 30%. (Excludes cocaine due to it's complexity.)</li><li>Increased tier 3 blueprint max uses from 3 to 6.</li><li>Firefighters will once again receive payment for the building fire random event.</li><li>Robbing the PD bank will now reward players with a tier 3 blueprint instead of a tier 2.</li><li>Robbing the government bank will now only reward one tier 3 blueprint instead of 3-5.</li><li>Rebound the mayor fire menu key to F6 to avoid conflicts with the economy menu.</li></ul><h3>Fixes:</h3><ul><li>Fixed players sometimes getting kicked out of vehicle passenger seats if they tried to switch too fast.</li><li>Fixed shop NPC not calculating sales tax.</li><li>Fixed chat commands not working again.</li><li>Fixed mayor fire menu creating script errors when players spawned in.</li></ul>"
	},
	{
		"title": "CityRP Update 6/11",
		"date": "June 11, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added menu that allows the mayor to fire any player holding a government or law enforcement job, excluding the IA Agent. (Currently accessible by pressing F2.)</li></ul><h3>Deletions:</h3><ul><li>Removed some redundant rules related to things being allowed/not allowed under certain conditions.</li></ul>"
	},
	{
		"title": "CityRP Server Update 6/10",
		"date": "June 10, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added drunk driver random event. (A bot will spawn in a random car and will drive around like an idiot until kicked out of the car and cuffed by a player.)</li></ul><h3>Changes:</h3><ul><li>Improved various things for Automod including wheel turn lock detection, passenger seat detection, and fuel display.</li><li>Vehicles that have been on fire for too long (currently 30 seconds) will now explode and become permanently undrivable until respawned.</li></ul><h3>Fixes:</h3><ul><li>Fixed random events sometimes not working on rp_southside.</li><li>Fixed taser creating script errors if a player disconnected while tazed.</li></ul>"
	},
	{
		"title": "CityRP Server Update 5/16",
		"date": "May 16, 2020",
		"info": "<h3>Fixes:</h3><ul><li>Fixed players not being able to respawn after dying.</li><li>Fixed !currentevent chat command not displaying properly if an event hasn't happened yet.</li><li>Fixed consumable drugs creating script errors when a player disconnects while overdosed.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 4/30",
		"date": "April 30, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added playermodel selector to F4 menu.</li></ul><h3>Deletions:</h3><ul><li>Removed Combine APC due to incompatibility with upcoming game update.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 4/8",
		"date": "April 8, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added the pocket back.</li><li>Added /sellalldoors command that works pretty much the same as the DarkRP one.</li><li>Added the media player to the Black Mesa and Combine item shops.</li><li>Added small cooldown to changing jobs.</li><li>Added an extra item shop to Sector D of rp_bmrf.</li><li>Added ammo lockers and items shops to the major bases on gm_atomic. (Items from the shop are free since the budget technically no longer exists after the nuke goes off.)</li></ul><h3>Changes:</h3><ul><li>Changed combine door tool holding animation to match the old one.</li><li>Changed color of the combine elite job so the description is actually readable.</li><li>Jobs that spawn with weapons will now also spawn with ammo for those weapons.</li><li>Choosing the rocket ending on Outland RP will now kick players and give them a message to let them know the result. (For those who don't know, launching the rocket is considered the 'easy way out' and ends the session upon completing the launch. Scavenging the map to find the portal control codes and accessing the portal console in the Combine base will reward a continuation of the session on gm_atomic.)</li><li>Lowered the respawn time for all mining entities.</li></ul><h3>Fixes:</h3><ul><li>Fixed crystals, Xen trees, and the HECU weapon crate not spawning on rp_bmrf.</li><li>Fixed disguise kit not listing any jobs.</li><li>Fixed various chat-related script errors.</li><li>Fixed Combine crafting table spawning as a weapon crate.</li><li>Fixed ceasefire notice displaying for everyone when a new player spawns in.</li><li>Fixed Half-Life 1 weapons not dropping properly when a player dies.</li><li>Fixed !fireoff command creating script errors.</li><li>Fixed ammo locker not giving ammo for the Combine sniper rifle.</li><li>Fixed players being able to see all team chats.</li><li>Fixed City 17 food machine not working.</li><li>Fixed lockpick creating script errors and not working.</li><li>Fixed Combine jobs on Outland RP getting the normal battering ram instead of the Combine door tool.</li><li>Fixed players being able to faintly hear each others voice chats from extreme ranges.</li><li>Fixed biochemist job using the scientist playermodels instead of it's own.</li><li>Fixed scientist jobs sometimes using service official playermodels.</li><li>Fixed rebel rocket launching too early.</li></ul><h3>Deletions:</h3><ul><li>Removed Barney playermodels from the civil protection playermodel list. (The lore nerds complained that they were playing as Barney while not helping the resistance.)</li></ul>"
	},
	{
		"title": "HLU RP Server Update 4/5",
		"date": "April 5, 2020",
		"info": "<p>This is probably the biggest update I've ever done for this server. Not only was the server completely taken off of DarkRP, but a lot of the mechanics for each section were revamped. The changelog is below. Note that anything that was replaced due to the removal of DarkRP that didn't have it's function changed isn't listed here.</p><h3>Additions:</h3><ul><li>[BMRP] Since money was removed with DarkRP, players will now have to keep track of a facility-wide budget that can be used with a new item shop to buy equipment. The budget can be seen at the top of the HUD. Completing random events and selling mined Xen materials to the budget NPC can increase the budget. If the budget gets too low, the facility administrator can use the budget NPC to take out a loan or sell previously bought equipment.</li><li>[BMRP] The item shop mentioned above sells everything that was previously in the F4 menu of certain jobs, including GTerminals, weapon crates, and lab equipment. 3-6 of these shops spawn on the map to reduce the amount of walking players have to do.</li><li>[BMRP] Added teleport sound when new NPCs spawn in Xen to alert players of the refresh.</li><li>Added rp_bmrf to BMRP. (We might use this as our new primary map if people like it more than rp_sectorc_beta. The map will still be used for Cascade.)</li><li>[BMRP] Added vehicle spawns to maps that allow vehicles to be used practically. (This currently includes rp_sectorc_beta, rp_bmrf, and gm_atomic.)</li><li>[BMRP] Added VOX alert message to the nuke event.</li><li>[BMRP] Added forklift spawns to each map for the service official to use.</li><li>[BMRP] Added ammo lockers to security and military posts on each map.</li><li>[BMRP] Added geiger counter sound to the radioactive lab materials so players know when to step away.</li><li>[City 17 RP] Added ammo lockers to the citadel armory on each map.</li><li>[City 17 RP] Added combine weapon dispensary that can be used to purchase the combine crafting table, weapon crates, and medical supplies.</li><li>[City 17 RP] Added 3 APC spawns to rp_city24_v2.</li></ul><h3>Changes:</h3><ul><li>Took the server off of DarkRP. This allows for much more flexibility and new features that will hopefully come from suggestions once we play a few sessions.</li><li>Changed the website button to F3. The link will now open in your steam overlay instead of an in-game HTML element.</li><li>Replaced handcuffs with the leash for better control over players. The time it takes to cuff a player is also much lower.</li><li>Lightened the restrictions on certain Wiremod tools. Most tools are no longer restricted to certain teams besides ones that can directly deal damage.</li><li>Admins can no longer spawn vehicles.</li><li>Merged the ammo lockers into one universal locker that will produce ammo based on the gun you are holding.</li><li>Restricted chat radio to BMRP only.</li><li>[BMRP] Items from vending machines are now free but have a limited amount of stock. The service official can restock them by purchasing a resupply from the item shop.</li><li>[BMRP] Gave Head of Survey Team a rifle and gave Survey Members a pistol.</li><li>[BMRP] Adrian Shepard NPC for the weapons engineer event will now display the actual name of the requested gun instead of the entity class name.</li><li>[BMRP] Trash compactor will now tell users how many bags they disposed of and how much money they made doing so.</li><li>[BMRP] Changed the model of the biochemist crafting table so it looks and sounds like a teleporter.</li><li>[BMRP] Moved all Xen NPCs that were previously in the biochemist F4 menu to the biochemist crafting table.</li><li>[City 17 RP] 5 rebel crafting tables will now spawn at pre-defined locations on each map. They are not static and players are able to move them to a new location if needed.</li><li>[City 17 RP] Replaced manhack entity with a SWEP that the manhack metrocop can use to remote control their manhack without disappearing into it.</li><li>[Outland RP] Items previously spawned from the rebel F4 menu can now be spawned from the turret NPC.</li><li>[Outland RP] Changed the model of the rocket to the actual Episode 2 model.</li><li>[Cascade] Reward system will now add up all of the rewards at the end of the round and store them in a file, which OP will then convert to CityRP money.</li></ul><h3>Fixes:</h3><ul><li>[BMRP] Fixed HECU Captain being able to use the easter egg chat command.</li><li>[City 17 RP] Fixed players not being able to hear overwatch announcements.</li><li>[Outland RP] Fixed resistance leaders not being able to access rebel-owned doors.</li><li>[Outland RP] Fixed players not being able to use the rebel teleporter on gm_boreas.</li></ul><h3>Deletions:</h3><ul><li>Removed the taser.</li><li>Removed Sligwolf's Garbage Truck. (Trash compactor system for BMRP is not affected by this.)</li><li>[City 17 RP] Removed ores that loyal citizens could sell to the Combine due to money being removed.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/22",
		"date": "March 22, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added feature to Automod that allows players to turn off their vehicle's engine while still remaining in the drivers seat.</li></ul><h3>Changes:</h3><ul><li>Changed loading screen to a custom one that gives a lot more info about the server. (You might need to switch to the x64 branch to see it until the Gmod devs merge it with the main branch.)</li><li>Replaced sit anywhere addon with a different one with better optimization and control.</li></ul><h3>Fixes:</h3><ul><li>Fixed players being able to drop certain default weapons.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/15",
		"date": "March 15, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added gas pump to the gas stations on each map that players can use to fuel their vehicles without having to physically take a can to their car.</li></ul><h3>Fixes:</h3><ul><li>Fixed inventory system creating script errors when trying to pick up any item.</li><li>Fixed HUD creating script errors when displaying info about the lockdown, parade, or purge events.</li><li>Fixed players being able to walk through certain doors on rp_evocity2_v5p.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/12",
		"date": "March 12, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added new car bomb system that doesn't crash clients when exploding cars. (Functions the same except the detector and defuser tools are now built into a single tool.)</li><li>Added gas can SWEP for the tow truck driver to use.</li></ul><h3>Changes:</h3><ul><li>Replaced farm system with a custom one that functions the same except plants need to be in direct sunlight to grow. (Global plant count has also been removed due to this new restriction.)</li><li>Moved shop NPCs on RP_SouthSide to the front of the gas station store counters to prevent items from getting stuck in the wall.</li></ul><h3>Fixes:</h3><ul><li>Fixed Automod HUD being partially hidden on some Photon vehicles with advanced lighting modes.</li><li>Fixed bank robbery random event triggering without a banker being on the server.</li><li>Fixed trailers having their wheels lock up when spawned from the truck NPC.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/3",
		"date": "March 3, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added bank robbery event that spawns 2-6 hostile citizen NPCs armed with various weapons inside the bank. (The event requires a banker and at least 1 cop to be on the sever for it to activate.)</li><li>Added 30 second option to the timed C4.</li><li>Replaced rp_chaos_city_v33x_03 with rp_southside.</li></ul><h3>Changes:</h3><ul><li>The timed C4 will now reset it's timer setting when redeployed.</li></ul><h3>Fixes:</h3><ul><li>Fixed seat weaponizer lagging the server and creating script errors when trying to look for a vehicle that doesn't exist.</li><li>Fixed vehicles sometimes instantly running out of fuel after being spawned.</li><li>Fixed vehicle system creating script errors when a player tries to switch seats in a vehicle that hasn't been fully initialized.</li></ul><h3>Deletions:</h3><ul><li>Removed car bomb. (Caused crashes on some clients, will be replaced with a different one next update.)</li><li>Removed civilian playermodel pack. (I tried to replace it with the new casual playermodel packs but it made the server loading time go from an average of 7 minutes to 18 minutes, so for now we'll just be using the default HL2 civilian models.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/29",
		"date": "February 29, 2020",
		"info": "<h3>Changes:</h3><ul><li>Reduced the amount of fuel that is consumed by vehicles. (Fuel will also no longer drain while the vehicle is idling.)</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to put the vehicle fuel can in their inventories.</li><li>Fixed consumable weed and meth spawning as an error.</li><li>Fixed courier package creating script errors when trying to look for a player that left the server.</li><li>Fixed vehicle fuel can not having a model in the shop NPC menu.</li></ul><h3>Deletions:</h3><ul><li>Removed old StormFox items from the news cameraman's F4 menu.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 2/8",
		"date": "February 8, 2020",
		"info": "<h3>Fixes:</h3><ul><li>Fixed chat sounds not working for the survey team jobs on BMRP and the civil protection job on City 17 RP.</li><li>Fixed DarkRP throwing warnings about certain chat commands on BMRP.</li><li>Fixed BMRP events not getting randomly called.</li><li>Fixed BMRP chat command easter egg not working.</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/7",
		"date": "February 7, 2020",
		"info": "<h3>Fixes:</h3><ul><li>Fixed heavy tow truck spawning inside the tow building on rp_rockford_v2b.</li><li>Fixed some CW weapons not accepting ammo.</li><li>Fixed vehicle repair tool creating script errors when looking at an invalid entity.</li><li>Fixed drug NPC not dropping money for government and police jobs when selling meth.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 2/4",
		"date": "February 4, 2020",
		"info": "<h3>Changes:</h3><ul><li>Reduced the amount of health hunter choppers and gunships spawn with on Outland RP.</li><li>Replaced HEV suit playermodel with a colorable version.</li><li>Tasers now have the same charge up function as the CityRP one.</li><li>Optimized any code that hasn't been optimized already.</li></ul><h3>Fixes:</h3><ul><li>Fixed vending machine chips model showing up as an error for some people.</li><li>Fixed player expressions creating script errors when joining the server.</li></ul><h3>Deletions:</h3><ul><li>Removed alarm entities from BMRP. (They were never really used for their intended purpose, and Wiremod can perform just as well.)</li><li>Removed ladder tool and leaf blower from Service Official job on BMRP.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/10",
		"date": "January 10, 2020",
		"info": "<h3>Additions:</h3><ul><li>Added car rental and selling feature to the car dealer NPC that the Tow Truck Driver (now renamed to Mechanic) job can access. (Stolen cars can be sold to the mechanic and then he can sell it to the car dealer NPC. The NPC will only accept permanent and rental vehicles owned by players, not free vehicles such as police cars or smuggle trucks. Selling stolen permanent cars has a 3% chance of wanting the mechanic. The selling price of stolen vehicles is 5% of the permanent buy price. Renting a vehicle will take the whole payment as an initial payment; it's up to the player to take out a loan for the vehicle if they can't afford it.)</li></ul><h3>Changes:</h3><ul><li>Reduced the amount of money players get from rare fish.</li><li>Nerfed the CW weapons again so the damage is more balanced with the price paid for the weapon.</li><li>Reduced the amount of hunger microwave food restores from 100 to 25.</li><li>There is now a 5% chance of an ichthyosaur spawning near the fishing NPC every time someone catches a fish. (Hostile to all players but can only attack from the water.)</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to get into a vehicle if the drivers seat and second passenger seat was taken.</li><li>Fixed money printers creating script errors after catching on fire.</li><li>Fixed mayor system creating script errors when trying to send notifications to a player who hasn't fully spawned in yet.</li><li>Fixed fishing system creating script errors when removing a fishing pot.</li></ul><h3>Deletions:</h3><ul><li>Removed Shopkeeper job. (Was never used for it's original purpose, and hardly used in general.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/7",
		"date": "January 7, 2020",
		"info": "<h3>Changes:</h3><ul><li>Increased the amount of gas that can be in a meth stove gas can to allow it to explode from 2 to 10.</li><li>Reduced the amount of meth stove gas that will explode at once to avoid freezing the server.</li><li>Reduced the chance of C4 exploding when someone tried to defuse it from 50% to 30%.</li><li>Restricted C4 defusing to police jobs only.</li><li>Delivering the most expensive smuggle item will now give you a crafting blueprint like the rest of the smuggle items. (Besides the least expensive.)</li><li>Changed the Smuggle Sell NPC name to Smuggle Deliver NPC to avoid confusion with the Smuggle Buy NPC.</li><li>Increased the time emergency responders have to revive a player from 1 minute to 10 minutes.</li><li>Log/ore crushers will now accept a cart even if you're still holding it.</li><li>Changed wanted messages for robbing both banks so police can quickly identify which bank is being robbed.</li><li>Reduced the cooldown for removing gas from a meth stove and attaching it to a different stove from 50 seconds to 5 seconds.</li><li>Replaced the Ford F-150 fire unit with a Tesla Cybertruck fire unit.</li></ul><h3>Fixes:</h3><ul><li>Fixed police jobs being able to fine other police jobs.</li><li>Fixed Bus Driver and Hitman jobs not being able to use the smuggle NPC.</li><li>Fixed the death screen showing up for a split second when a player spawns in for the first time.</li><li>Fixed the Hitman job not being able to rob either bank.</li><li>Fixed players being deducted money on death twice if they used the suicide mode on the C4.</li><li>Fixed money from log/ore crushers ignoring their physics models and falling onto the ground.</li><li>Optimized all existing code that hasn't been optimized already. (You probably won't see that big of a difference besides loading into the server.)</li></ul><h3>Deletions:</h3><ul><li>Removed TDM Jeep pack. (One of the least used car packs, should greatly improve server loading times. Anyone who owned any of the cars in the pack have been refunded.)</li><li>Removed the off-duty locker. (It was only used a few times over the course of a year. It's better suited for a larger playerbase.)</li><li>Removed small green trees from the logging system. (Same reason as the HLU RP server. The trees are hard to find and don't give as many logs compared to the larger orange trees.)</li><li>Removed Simple Thirdperson. (At first it was thought to be Gmod Legs 3 causing problems but after disabling that addon the thirdperson playermodel still wasn't showing up. I might add a different one in the future.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/2",
		"date": "January 2, 2020",
		"info": "<h3>Changes:</h3><ul><li>Increased the price of the Tesla Cybertruck from 50000 to 100000.</li><li>Enabled halos on evidence drops so detectives can find them easier.</li><li>Increased evidence removal time from 3 minutes to 5 minutes.</li><li>Life alert will now alert authorities to deaths of players who have it equipped.</li></ul><h3>Fixes:</h3><ul><li>Fixed some of the newer civilian jobs being able to keep the one-time-use tazer after using it.</li></ul><h3>Deletions:</h3><ul><li>Removed the t-posing citizen playermodel.</li></ul>"
	},
	{
		"title": "The Future of Lambda Gaming (Again)",
		"date": "January 1, 2020",
		"info": "<p>Happy new year to everyone. I'd like to talk about what's to come with this community in the future. I talked about this already back in April, but things have changed since then and I ended up going against all or most of my statements anyway, so let me try this again. I'll put a TL;DR at the end of large paragraphs for those who just want the basics.</p><p>First off, my college schedules have been very nice, a lot better than I expected. This has allowed me, and will continue to allow me (at least until this fall), to be more available to host servers.</p><p>As you've probably noticed, I haven't been hosting as much as I probably can with my free time. This is mainly due to the amount of projects i'm currently working on, which take priority over hosting in certain situations. The other factor, at least for the RP servers, is the lack of interest by the community. It's not everyone obviously but it seems to me that a good chunk of the regular playerbase has lost interest in joining those servers. If there's a particular reason for this, let me know and i'll try my best to fix it. Finding a decent amount of players to keep the RP going for over an hour is hard to come by these days and i'd love to go back to the good old days of averaging 6-7 players per session with the session lasting a good 5-6 hours.</p><p>(TL;DR: The two biggest reasons for a lack of sessions recently is because I'm working on projects that take up a lot of my free time and a big chunk of regulars have seemingly lost interest in the servers.)</p><p>Next, regarding servers going 24/7. I've said this many times now but let me reiterate: even if I came up with the money to host servers 24/7, time is still a huge factor. A lot of time would be required to convert the RP servers (which is assumed to be the ones to ever go 24/7 because of their popularity) into servers that can support a large, consistent playerbase because over the years a lot of systems and rules have been downgraded to suit our low playerbase better. This doesn't even include the time I would need to create forums, look at ban requests/appeals, and keep systems up to date to prevent exploits that would likely surface with a larger playerbase. So, to put it simply, don't expect 24/7 servers to ever happen from me.</p><p>(TL;DR: Don't expect 24/7 servers to ever happen from me.)</p><p>Regarding new servers and server updates, I'm honestly just all over the place with them at the moment. If someone has a really good idea for a server that I think could work, i'll probably at least try it. With major server updates, they usually start out as small content additions but grow into a huge update when I get more ideas and suggestions for stuff while also finding obscure bugs to fix. The way I treat these could change at any time in the future, I really don't know.</p><p>(TL;DR: I make new servers and release major updates for existing servers as good suggestions come to me, but this could change at any time.)</p><p>To conclude, I plan on staying here as long as I have the time to do so. It's probably too early to tell when I won't have time anymore. It's possible that it might be never. It depends on a lot of factors. I know some people have offered to take over the community for me but i'm still indecisive on that. For now though, i'll try to keep hosting servers and keep the community alive for as long as I can.</p><p>If anyone has any questions, comments, or concerns feel free to leave them in the comment section of this announcement or steam chat me.</p>"
	},
	{
		"title": "CityRP Server Update 12/31",
		"date": "December 31, 2019",
		"info": "<h3>Fixes:</h3><ul><li>Fixed marketable pure coke creating script errors when a player spawned in.</li><li>Fixed cook not being able to spawn the microwave.</li></ul>"
	},
	{
		"title": "CityRP Server Update 12/24",
		"date": "December 24, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added Tesla Cybertruck.</li><li>Added roadwork random event for the Utility Worker job. (Requires the Utility Worker to use a pickaxe on pot holes. Pot holes that spawn in the road have a 10% chance of popping a vehicle's tires when one goes over it.)</li><li>Replaced RT camera tool with the multiple RT cameras tool.</li></ul><h3>Fixes:</h3><ul><li>Fixed coke key reset command creating script errors.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 12/20",
		"date": "December 20, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added door system to BMRP:Cascade. (Functions similarly to the DarkRP door system. Most doors on the Cascade map are now team-owned, which should make rounds more interesting if you need a specific player to unlock a door.)</li><li>Added HUD round timers to BMRP:Cascade.</li><li>Added City 17 RP event that spawns rebel NPCs inside of the citadel that the combine have to fight.</li></ul><h3>Changes:</h3><ul><li>Improved chat sound word detection for specific keywords that started with the same word as another keyword.</li><li>Changed loading screen to a custom one that contains more info about the server as well as screenshots from different sessions.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 12/20",
		"date": "December 20, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added zs_closure, zs_departure, and zs_abandoned_mall maps.</li></ul><h3>Changes:</h3><ul><li>SledBuild races can now only be activated by superadmins and won't start automatically anymore.</li><li>Players can now use props and tools on SledBuild that were previously restricted.</li></ul><h3>Deletions:</h3><ul><li>Removed zs_uglyfort, zs_abandon_factory_redone, and zs_clav_massive maps.</li><li>Removed Sacrifun and Melonbomber gamemodes.</li></ul>"
	},
	{
		"title": "CityRP Server Update 12/17",
		"date": "December 17, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added notification to shooter event that alerts all players when the event starts.</li></ul><h3>Fixes:</h3><ul><li>Fixed courier system creating script errors when a player died while carrying a courier package, causing the courier NPC to not reset properly.</li><li>Fixed courier packages creating script errors when removed.</li><li>Fixed meth stove gas sometimes creating script errors when empty.</li><li>Fixed grenades sometimes creating script errors when thrown.</li><li>Fixed vehicles not re-enabling their engines after being fixed by a repair kit if their health was at 0% before the repair.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 12/7",
		"date": "December 7, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added Vortigaunt job to City 17 RP. (See website for details.)</li><li>Added more iron rocks to gm_boreas.</li><li>Added 10 minute cooldown timer to buying Combine aerial vehicles on Outland RP.</li><li>Added Combine Shotgun Guard job to Outland RP.</li><li>Added fast mode to BMRP:Cascade that cuts all timers in half.</li></ul><h3>Changes:</h3><ul><li>Overwatch Elites can now take the role of the Earth's Administrator if there are 5 or less players on City 17 RP.</li><li>The Combine can no longer spawn aerial vehicles while the ceasefire is in effect on Outland RP.</li><li>The Combine on Outland RP can no longer spawn health packs, armor, and ammo through the F4 menu, instead they must now return to their base to get those items.</li><li>The Rebel Medic now spawns with a pistol instead of an SMG on Outland RP.</li><li>Weapon spawns on BMRP:Cascade are more visible now and aren't stuck half way in some props.</li></ul><h3>Fixes:</h3><ul><li>Fixed players not being able to escape on BMRP:Cascade.</li><li>Fixed players other than scientists being able to access the spawn menu in BMRP:Cascade.</li><li>Fixed flashlight being disabled on BMRP:Cascade.</li><li>Fixed fire block creating script errors when being put out on BMRP:Cascade.</li><li>Fixed all players being able to disable the round timer on BMRP:Cascade.</li><li>Fixed Outland RP item entities creating script errors on other gamemodes.</li><li>Fixed admins being able to spawn any entity from the spawn menu.</li></ul><h3>Deletions:</h3><ul><li>Removed GTerminals from BMRP:Cascade. (They were kinda useless since people can just use a 3rd party chat for private messages. Note that is is only for the Cascade variant of BMRP. They are still included with BMRP:Classic.)</li><li>Removed chumtoads from spawning as a random weapon on BMRP:Cascade.</li><li>Removed rp_industrial17_v1. (Can be added back if there's enough demand for it. It was removed mainly because of the unfair advantage the Combine can have over the rebels when it comes to the city layout.)</li></ul>"
	},
	{
		"title": "HLU RP Server Update 11/30",
		"date": "November 30, 2019",
		"info": "<h3>Fixes:</h3><ul><li>Fixed new Combine jobs not having access to the Combine group chat or Combine-owned doors.</li><li>Fixed some vital gamemode functions not loading automatically on City 17 RP causing the locked Combine jobs to become unlocked and the scientist job to not teleport to the jails, among other things.</li><li>Fixed loyal citizens not being able to buy ore carts on City 17 RP.</li><li>Fixed rebel crafting table not accepting iron.</li><li>Fixed resistance leader not receiving an SMG when spawning.</li><li>Fixed Combine not being able to spawn IFF tags for turrets on City 17 RP.</li><li>Fixed rebels not being able to spawn crafting tables on Outland RP.</li><li>Fixed flamethrower sometimes creating script errors when burning players on City 17 RP.</li></ul><h3>Changes:</h3><ul><li>Merged the black market dealer job with the resistance leader job. (It only made sense since they both needed abilities that the other job had.)</li><li>Moved Combine NPC to the main Combine base on gm_boreas. (All vehicles from the NPC now spawn there as well.)</li><li>Moved Combine and rebel spawns to their bases on Outland RP. (They will either spawn in the basement of the base or a short distance outside the base entrance so it's still fair to the enemy team if they raid the base.)</li><li>NPCs that spawn in Xen on BMRP will now remove themselves if the command is called to spawn more NPCs. (This will prevent some left over NPCs from layering on top of each other.)</li><li>Overwatch Guard job is no longer locked behind the research locker on City 17 RP.</li></ul><h3>Deletions:</h3><ul><li>Removed some of the harder to find item entities on Outland RP such as the computer and rubble. (The ones left are the crate, log, and generator. All of these are much easier to find compared to the two that were removed.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/26",
		"date": "November 26, 2019",
		"info": "<h3>Changes:</h3><ul><li>Disabled the Pirate Ship Wars buy menu until I can figure out what to add to it.</li></ul><h3>Fixes:</h3><ul><li>Fixed Pirate Ship Wars HUD sometimes creating script errors when a player spawns in.</li><li>Fixed the arms of the pirate model stretching out in front of the player. (Had to disable Gmod Legs for that gamemode.)</li></ul><h3>Deletions:</h3><ul><li>Removed Prop Hunt Classic map pack and ttt_vault. (They will probably be replaced at some point in the future.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/24",
		"date": "November 24, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added contraband package item that can be bought from the contraband NPC and must be carried to a randomly selected NPC to get a random tier 2 crafting blueprint. (Players will be instantly wanted upon delivering the package, and cannot buy another package while wanted.)</li></ul><h3>Changes:</h3><ul><li>4 players are no longer required to be on the server to rob the PD bank.</li><li>The crafting table will now display the actual ingredient names instead of their class names.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 11/24",
		"date": "November 24, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added Stop it, Slender! gamemode back.</li></ul><h3>Changes:</h3><ul><li>Lowered the price of extra weapons in Flood.</li></ul><h3>Fixes:</h3><ul><li>Fixed hammer view model in Zombie Survival showing up as an error.</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/23",
		"date": "November 23, 2019",
		"info": "<h3>Fixes:</h3><ul><li>Fixed tool gun creating script errors when being used.</li><li>Fixed government vehicle NPC facing the wrong direction on rp_evocity2_v5p.</li><li>Fixed fire truck NPC spawning in the fire station garage instead of the front desk on rp_evocity2_v5p.</li><li>Fixed photon for chevy impala vehicles not working.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 11/21",
		"date": "November 21, 2019",
		"info": "<h3>Changes:</h3><ul><li>Reverted Zombie Survival back to the 2016 version due to complaints about the new versions.</li><li>Replaced Pirate Ship Wars 2 with Pirate Ship Wars Remix. (This version includes ranks and a buy menu and should also fix a few bugs.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/19",
		"date": "November 19, 2019",
		"info": "<h3>Changes:</h3><ul><li>Reduced the amount of damage players take from vehicle explosions.</li><li>Players can now use the tool gun on other players' items while also not being able to use the tool gun on map items.</li><li>Increased the number of paper money printers can hold from 3 to 5.</li></ul><h3>Fixes:</h3><ul><li>Fixed tow truck NPC facing the wrong direction on rp_truenorth_v1a.</li><li>Fixed both coca plants in the contraband NPC being named marketable.</li><li>Fixed shop NPC being too close to the register causing items to spawn inside of it on rp_truenorth_v1a, rp_rockford_v2b, and rp_evocity2_v5p.</li><li>Fixed paycheck notification displaying twice.</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/11",
		"date": "November 11, 2019",
		"info": "<h3>Fixes:</h3><ul><li>Fixed announcement speaker not broadcasting voice.</li><li>Fixed announcement speaker creating script errors when spawning.</li><li>Fixed spikestrips sometimes spawning under the map.</li><li>Fixed players not being able to exit vehicles if they are in the front passenger seat with no other passengers and only a driver.</li><li>Fixed heat lamp not removing its light if it's destroyed while turned on.</li><li>Fixed check machine not spawning on any of the maps besides rp_chaos_city_v33x_03.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 11/11",
		"date": "November 11, 2019",
		"info": "<p>This update was quickly done in hopes of fixing the lag that all players were experiencing on the sandbox server last session. Some things in the list were done a few weeks ago and are included here since they weren't in any other announcement.</p><h3>Additions:</h3><ul><li>Added rp_rockford_open.</li><li>Added Drones Rewrite. (This is the full version and not the lite version that's on CityRP.)</li><li>Added Stormfox back. (It doesn't seem to lag anymore and it wasn't the cause of the lag last session since the time was paused for the majority of the session.)</li><li>Added Mr X NPC.</li><li>Added CS:S weapon pack.</li><li>Added ragdoll resizer tool.</li></ul><h3>Changes:</h3><ul><li>The random map button can now choose RP maps from the other servers.</li></ul><h3>Deletions:</h3><ul><li>Removed phys_towers.</li><li>Removed CW Glock 17.</li><li>Removed TDM Ford and Porsche packs.</li><li>Removed steamed hams map.</li><li>Removed bonzi buddy playermodel.</li><li>Removed temporary addons left over from a recent test session. (This will probably fix the lag if nothing else does.)</li><li>Removed gm_gridmap.</li><li>Removed old damage player in seats addon that was left over from the early days of sandbox. (It may have caused a few bugs and it's not needed anymore since native support for this was added to the game back in 2016 or 2017.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/6",
		"date": "November 6, 2019",
		"info": "<h3>Additions:</h3><ul><li>Replaced tire popping and spikestrip systems with a custom one that's part of the new vehicle system.</li><li>Added more items to the dumpster.</li></ul><h3>Changes:</h3><ul><li>Players must now vote the mayor out of office once the IA agent initializes the vote. (75% of players must vote yes for the mayor to be fired.)</li></ul>"
	},
	{
		"title": "HLU RP Server Update 10/24",
		"date": "October 24, 2019",
		"info": "<h3>Additions:</h3><ul><li>Added 30 minute ceasefire from Outland RP to City 17 RP so all parties have the chance to settle in before the action starts.</li><li>Added scientist job to City 17 RP that is now required to activate the core detonation. (The scientist also spawns in the citadel prison when they change to that job and must work for the Combine until they are freed by refugees. More detailed info about this can be found on the website under this job's page.)</li><li>Added Overwatch Shotgunner and Manhack Civil Protection jobs to City 17 RP.</li><li>Added science locker that the scientist can use to give prototype weapons or new soldier classes to the Combine. A key must first be crafting via the Combine crafting table and then used by the scientist to open the locker. If the item is a duplicate, it will retry without using up the key.</li><li>Replaced all NPCs that sell items with the custom one from CityRP.</li><li>Added flamethrower ammo to the Cremator job's F4 menu.</li></ul><h3>Fixes:</h3><ul><li>Fixed Loyal Citizen job being in the wrong F4 menu category.</li><li>Fixed BMRP and City 17 RP random events being called on all maps no matter what gamemode was running.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/17",
		"date": "October 17, 2019",
		"info": "<h3>Additions:</h3><ul><li>Replaced all NPCs that sell items with a custom one. (This has greatly increased server-side performance and potential for what NPCs I could make in the future. The list of changed NPCs include: Shop, Contraband, Tow Truck Spawner, Gov Vehicle Spawner, Ambulance Spawner, Health, Fire Truck Spawner, and Truck Shop.)</li><li>Added fire hose that emergency responders can use to put out fires faster as long as they stay near a fire truck.</li><li>Added unmarked photon medical and fire vehicles for those who would like to respond to emergencies in civilian vehicles rather than an ambulance or fire truck.</li><li>Added semi tow truck for tows that are too heavy for the small tow truck.</li><li>Added M1 Garand and MG 42 weapons. (Both are craftable and require blueprints. The MG 42 is now the most expensive weapon to craft besides the RPG. And for good reason.)</li><li>Replaced 2007 Chevy Tahoe with a 2015 model. (Anyone who owned an old Tahoe was automatically upgraded to the newer one free of charge.)</li><li>Added Drones Rewrite mod. (This version is an extremely lightweight version that only consists of 4 drones and the hacking system. 2 of the drones can be bought from the shop NPC, while the other 2 can be crafted.)</li><li>Replaced TDM truck pack with SGM truck pack. (This had to be done to add the semi tow truck without slowing the server down. You probably won't notice much a difference besides the fact that there are less trailers now.)</li></ul><h3>Changes:</h3><ul><li>The courier NPC will now only allow packages to be delivered one at a time.</li><li>Slightly reduced the payout for courier packages. (From 900 to 800.)</li><li>Reduced the payout for giving a stolen courier package to the banker NPC. (From 4000 to 2000.)</li></ul><h3>Fixes:</h3><ul><li>Fixed courier cooldown not working properly.</li><li>Fixed the large metal detector not being assigned an owner when bought. (This will now allow the owners to edit the detector settings. They can be accessed via the use key on the detector.)</li><li>Fixed printer paper sometimes spawning under the map when bought from the contraband NPC.</li><li>Fixed ambulances not having a set spawn point on rp_truenorth_v1a. (They now spawn at the fire station next to the hospital.)</li><li>Fixed RPG not being registered as a blacklisted weapon with the large metal detector.</li><li>Fixed players being able to repair a vehicle as a tow truck driver from anywhere on the map as long as they had a direct line of sight of the vehicle.</li></ul><h3>Deletions:</h3><ul><li>Removed the 2007 Chevy Suburban. (It was part of the pack with the Tahoe so it went as well. Nobody seemed to own one so I didn't hand out any refunds. Let me know if this is a mistake.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 9/29",
		"date": "September 29, 2019",
		"info": "<ul><li>Fixed shooter NPC sometimes spawning with an invalid model.</li><li>Fixed smuggle NPC always telling players there aren't enough cops on the server even when there were.</li><li>Fixed weapon selling system allowing players to attempt to buy non-weapon entities.</li></ul>"
	},
	{
		"title": "CityRP Server Update 9/19",
		"date": "September 19, 2019",
		"info": "<ul><li>Added rp_chaos_city_v33x_03 back. (After playing a few sessions without the map and it's content, it was determined that removing it had no affect on server performance.)</li><li>Slightly reduced the amount of damage vehicles take from bullets.</li><li>Fixed heat lamp creating script errors when catching on fire.</li><li>Fixed NPCs and other perma propped items not spawning.</li><li>Fixed spike strips sometimes not being removed after 10 minutes if there was more than 1 spike strip spawned on the map.</li><li>Fixed inventory system creating script errors when trying to spawn an old version of the crafting blueprint that didn't have a set number of uses.</li><li>Fixed dumpster creating script errors when trying to spawn tools from the old vehicle system.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 9/18",
		"date": "September 18, 2019",
		"info": "<ul><li>Fixed crafting table not accepting certain BMRP materials.</li><li>Added random event chooser to BMRP so the events don't have to be manually activated.</li><li>Fixed flare gun sometimes creating script errors when firing.</li><li>Fixed PCMod sometimes creating script errors when clicking on a screen.</li><li>Increased the time it takes for radioactive materials to kill a player on BMRP.</li><li>Fixed players not being notified when an event started on BMRP.</li><li>Moved BMRP fire event over to the random events so it's not separate and only activates if the correct jobs are on the server.</li><li>Fixed Xen creatures not spawning when the map first loads on BMRP.</li><li>Changed City 17 RP Civilian job name to Loyal Citizen to avoid possible confusion.</li></ul>"
	},
	{
		"title": "Admin Reorganization",
		"date": "September 8, 2019",
		"info": "<p>My fellow Gamers. As the owner of Lambda Gaming and superadmin in chief, it is with a heavy heart that i'm informing you that we have made a strategic decision to surrender some admins over to the moderators. Right now this is our best chance of survival as RP'ers, and as humans. This has been the hardest decision of my life, and I did not do so lightly.</p><p>Memes aside, yes, some people are getting demoted to moderator. Rez and I have evaluated and decided who gets demoted based on behavioral performance. (We were originally going to go with admin performance but we just haven't had enough randoms to do that.) The following is a complete list of everyone's current rank after this decision. Effective immediately. Note for the people who got demoted: This is not permanent. If you can prove yourself worthy, you will get promoted again.</p><h3>Superadmin:</h3><ul></li><li>[G] O.P. Gmer</li><li>Revolver Oshawott</li></ul><h3>Admin:</h3><ul><li>VUPESVELOX</li><li>male_07.mdl</li><li>Dark Lord IX</li><li>Mr. Boombastic</li><li>Mr.Cuddles</li><li>Florel</li><li>Perithan</li><li>The Black Goldfish</li><li>Issac</li></ul><h3>Moderator:</h3><ul></li><li>Shloppy Flopper</li><li>Donut</li><li>Brill Baker</li><li>Jas</li></ul><h3>Pending Moderator Promotion:</h3><ul><li>CK</li></ul><p>Also note that moderators can still participate in votes and join admin-only servers, they just won't be able to use any in-game or community admin abilities. However, admins now have a new duty of voting on gray area rules where punishment for breaking it is undecided. If you don't want this responsibility, let me know and you can be dropped down to moderator.</p><p>PS: first person to call out what the reference in the first paragraph is from gets 1k in city rp money</p>"
	},
	{
		"title": "HLU RP Server Update 9/7",
		"date": "September 7, 2019",
		"info": "<ul><li>Added categories to all crafting tables.</li><li>Added gm_boreas as a secondary Outland RP map. (Currently plays the same as the other map except the combine base is much closer to the rebel base.)</li><li>Fixed players not being able to put the new Xen materials in their pocket on BMRP.</li><li>Fixed flare gun on City 17 RP creating script errors again when fired.</li><li>Fixed combine door access SWEP creating script errors on Outland RP.</li><li>Fixed disguiser creating script errors when putting on a new disguise.</li><li>Fixed batteries and turret ammo not spawning in some places on rp_ineu_valley2_v1a.</li><li>Added !rules chat command that opens the server rules in the steam overlay for people who don't have the chromium beta branch.</li><li>Added the APC to the combine NPC on Outland RP.</li><li>Removed the prices of some items in the rebel and combine NPC shops on Outland RP so players can still fight with the bare minimum even if they completely run out of money.</li><li>Added AR2 to the rebel crafting table. (The ammo for it was in there but the gun itself wasn't for some reason.)</li><li>Changed model of mineable trees on Outland RP so they stand out better.</li></ul>"
	},
	{
		"title": "CityRP Server Update 9/7",
		"date": "September 7, 2019",
		"info": "<ul><li>Added categories to the crafting table.</li><li>Added new cocaine system to replace the old one that was removed in an earlier update. (I won't explain it in detail here but it's pretty straightforward. Buy the heat lamp and  a marketable/consumable coca plant. Let the plant grow under the heat lamp until it reaches 100% growth. Harvest the raw cocaine from the plant and take it to the purifier. Let it run in the purifier until you think it's pure enough, then press your use key on the purifier. It is then ready to sell to the drug NPC or be consumed, depending on what plant version you bought. The max payout for the marketable version is 30k, min is 10k.)</li><li>Fixed disguise SWEP creating script errors when changing disguises.</li><li>Fixed small physics objects and welded objects causing vehicles to explode when touching them.</li><li>Fixed vehicles not starting their engines again after being repaired from 0 HP.</li><li>Fixed health NPC only allowing players to buy the one-time health kit and not the regular health regen as well.</li><li>Fixed vehicle system spamming chat when a player pressed their use key on a locked vehicle that they didn't own.</li><li>Fixed random events and smuggle system not assigning the number of uses on blueprint rewards.</li><li>Added back player physics damage nerf but this time without conflictions with the vehicle system.</li><li>Fixed tow truck drivers not being given the repair tool from the new vehicle system.</li><li>Added sound to purifier that plays when it's done purifying.</li><li>Restricted the normal dupe tool to everyone but superadmins and allowed all users too access the advanced dupe tool. (Hopefully this reduces the server lag when spawning giant dupes, if this causes problems with already existing dupes though I may revert this.)</li><li>Removed security guard playermodels.</li><li>Fixed shopkeeper not being able to smuggle or sell drugs.</li><li>Fixed players not being able to enter mayor elections.</li><li>Reduced the drug intake before death from 10 to 8.</li><li>Added !rules chat command that opens the server rules in the steam overlay for people who don't have the chromium beta branch.</li><li>Fixed some default weapons being taken away by the confiscation tool.</li><li>Reduced the required amount of cops to rob the government bank from 2 to 1.</li><li>Changed smuggle system so it requires at least 1 cop to be on the srever instead of 4 players.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 9/7",
		"date": "September 7, 2019",
		"info": "<ul><li>Added gm_eastern_dunes01a.</li><li>Updated link for !rules command.</li><li>Removed some RP maps that were removed from other servers.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 8/12",
		"date": "August 12, 2019",
		"info": "<ul><li>Disabled players who are banned from being mayor from entering an election.</li><li>Updated the chat commands page on the website to include the hitman command so players actually know how to place hits.</li><li>Disabled certain DarkRP admin commands that ULX already has.</li><li>Changed prop paying system so it's disabled by default.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 8/8",
		"date": "August 8, 2019",
		"info": "<ul><li>Revamped BMRP to be more focused on Xen crystal research. (Major changes include the removal of the cook job and complete rewrite of the R&D entities.)</li><li>Added a 40% chance of a lockpick spawning in the cell when a player is arrested in City 17 RP.</li><li>Moved Cascade from DarkRP over to it's own gamemode.</li><li>Replaced all crafting tables with my custom one.</li><li>Added combine crafting table to City 17 RP that allows the combine to craft turrets with iron obtained from loyal citizens.</li><li>Added booby traps to the rebel crafting table.</li><li>Added two-way teleporter to the rebel crafting table that can be liked via a tool that only resistance leaders have.</li><li>Added a cremator job to City 17 RP that spawns with a flamethrower and extra health, but can only be used under the most extreme circumstances. (Meaning if you go that job without an admin's permission you'll probably be asked to switch, unless you know for sure the situation calls for that job.)</li><li>Fixed chat sounds so they still play even when the target word isn't the first in the sentence.</li><li>Added the Half-Life 2 vehicle pack back to Outland RP.</li><li>Moved all perma props over to the new system used in CityRP.</li><li>Fixed players being able to spawn trash bags and put them straight into the trash compactor for a profit on BMRP.</li><li>Fixed the iron generator not spawning on the City 24 map.</li><li>Fixed players being able to restart the blowout sequence on the City 17 RP detonation console.</li><li>Changed the City 17 RP iron generator and rebel teleporter so they take actual weapon damage instead of 2 damage for every hit.</li><li>Fixed players being able to physgun certain func entities.</li><li>Fixed some background images on the loading screen having invalid URLs.</li><li>Added more chat sounds for scientist and security jobs.</li><li>Removed Steventechno's Furniture pack and Freeman's model packs.</li><li>Removed City 24-exclusive jobs. (They were originally added to keep consistent with the lore, but for simplicity sake I think it's better off if all maps have the same jobs.)</li><li>Added citizen group chat for City 17 RP.</li><li>Added timer to ration dispenser in City 17 RP that limits ration access to citizens.</li><li>Restricted the black market dealer and resistance leader from using the ration dispenser.</li><li>Added a second ration dispenser to the citadel on every City 17 RP map.</li><li>Fixed citadel destruction console not spawning on some maps.</li><li>Added custom announcement system the administrator job can use on BMRP and City 17 RP to broadcast his voice over loudspeakers.</li></ul>"
	},
	{
		"title": "CityRP Server Update 8/7",
		"date": "August 7, 2019",
		"info": "<ul><li>Removed some of the food items that weren't used very often, if at all.</li><li>Added custom announcement system the mayor can use to broadcast his voice over loudspeakers. (Other jobs can also use this system if they buy the microphone and speakers from the NPC shop.)</li><li>Adjusted price-to-hunger ratio for some food items.</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/31",
		"date": "July 31, 2019",
		"info": "<ul><li>Fixed some vehicles not being supported by the new vehicle system.</li><li>Increased resistance for vehicle collision damage.</li><li>Fixed the fishing rod creating script errors when dropped from a dumpster.</li><li>Reduced the amount of damage players take from collisions in vehicles.</li><li>Added vehicle health kit to replace the old one.</li><li>Fixed farm box sometimes creating script errors when trying to draw its owner's name.</li><li>Fixed inventory system creating script errors when taking out a crafting blueprint that was stored from a previous session.</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/29",
		"date": "July 29, 2019",
		"info": "<ul><li>Replaced VCMod with a custom vehicle system. (Any suggestions on how to improve the system would be greatly appreciated. I'm mainly looking to test client-side performance and the damage system.)</li><li>Fixed the Citizen and Cook jobs not having all civilian playermodel options available.</li><li>Replaced the current Crown Vic with a newer one that handles better. (The civilian version is no longer available due to this. Anyone who had one was refunded for it.)</li><li>Added dump truck and lambosine to the civilian car dealer.</li><li>Fixed the car spawn on rp_truenorth_v1a being turned the wrong way, sometimes causing large vehicles to get stuck in the wall.</li><li>Moved the one-time use health kit from the NPC shop to the health NPC at the hospital.</li><li>Added TDM Pontiac back. (These cars were never removed from the car dealer database after the addon was removed so if you owned one before, you should own it again now.)</li><li>Removed the 2015 Dodge Challenger Hellcat. (A different one is part of the TDM pack. To the one guy who owned one of these, I just changed the name in the database so you should still own it.)</li><li>Lowered the price of the Dodge Monaco to accommodate for the for the removal of the Crown Vic.</li><li>Added more undercover police versions of pre-existing vehicles.</li><li>Added message players get when they're arrested that reminds them they can be broken out if they go up to the breakout NPC in the PD lobby.</li><li>Fixed weapon selling system preventing players from confiscating smuggle trucks and storing inventory items by crouching and pressing their use key.</li><li>Added feature to government car dealer that teleports players into their car after they spawn it.</li><li>Removed rp_chaos_city_v33x_03. (If you didn't see my comment on the vote, this map, along with any other map that was previously removed, can be added back at any time if there's enough push for it since I keep all of the NPC and perma prop data for these maps.)</li><li>Fixed some government vehicles not being removed after a player changes jobs or requests to have the vehicle removed through the NPC.</li><li>Removed TDM Volkswagen. (Everyone who owned a beetle was refunded, there's still alternatives for the same price if that was your only vehicle.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/22",
		"date": "July 22, 2019",
		"info": "<ul><li>Fixed government bank money bags creating script errors when sold, causing it to not be removed.</li><li>Reduced the blueprint dumpster timer to 3 minutes.</li><li>Increased the blueprint dumpster price to 1500.</li><li>Changed blueprints so they have 3 uses before being depleted.</li><li>Added rule stating that Cops are allowed to go rogue if they agree to the following conditions: (1) the rogue player must provide a valid reason (EX: being fired by the mayor is not valid) as to why he/she is doing so, and (2) the player must change their job if they die while rogue.</li><li>Changed iron rocks so they spawn 2-6 iron bars instead of always 4.</li><li>Disabled the dumpsters ability to remove items. (You don't have to worry about the dumpster eating your contraband items anymore.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/12",
		"date": "July 12, 2019",
		"info": "<ul><li>Fixed the pizza NPC sometimes spawning invisible if it spawned with a model that had an invalid path.</li><li>Replaced current signs addon with the LED sign tool.</li><li>Fixed brake unlock SWEP creating script errors.</li><li>Added the marketable drugs back to inventory support.</li><li>Removed the consumable-grade meth pot from inventory support.</li><li>Removed Stormfox. (Caused lag for all players while the time was unpaused. May be added back if this problem gets fixed.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 6/16",
		"date": "June 16, 2019",
		"info": "<ul><li>Removed automatic timer that lowers the eco points if there's no mayor.</li><li>Fixed blueprint dumpster still charging players $5000 instead of $1000.</li><li>Fixed drug NPC telling players the wrong amount they recieved for selling weed if they were a government job.</li><li>Fixed civilian job getting $500 more than government jobs for selling meth.</li><li>Removed function that gave money to the government bank when a player bought certain items such as health, armor, guns or ammo. (Not needed anymore with the sales tax.)</li><li>Changed F1 menu link to the new website.</li><li>Fixed Glock not having a description in the NPC shop.</li><li>Reduced the max jail time for the arrest stick to 10 minutes.</li></ul>"
	},
	{
		"title": "City Rp Lite map vote",
		"author": "Rez",
		"date": "June 9, 2019",
		"info": "<p>Me and op are working on a experimental new rp server that. depending on how people like it and behave. may be a new server option. please comment the number below of which map you would want for the first official test of this server</p><ol><li>a version of rockford (if you have any versions in mind comment them with your choice)</li><li>Rp Union city</li><li>insanity (random map that hasent been on a server yet as long as its city themed and not stupid. if you have any recommended put it with your vote)</li></ol>"
	},
	{
		"title": "CityRP Server Update 5/26",
		"date": "May 26, 2019",
		"info": "<ul><li>Fixed the farmer NPC's hitbox being too small.</li><li>Fixed deposit boxes not accepting any money.</li><li>Fixed the farmer NPC not selling a player's melons.</li><li>Fixed money printers not printing if there wasn't any paper in the printer the first time it tried to print, even if paper was added afterwards.</li><li>Fixed money printer paper not being able to be inventoried.</li><li>Fixed the mayor being allowed to purchase gov perks that were already bought.</li><li>Fixed deposit boxes creating script errors when a player who had money in a deposit box disconnects.</li><li>Reduced the price of the blueprint dumpster.</li><li>Fixed sales tax showing the city tax's value after the mayor reopens the economy menu.</li><li>Fixed players being able to sell farm food without using the crate.</li><li>Changed the model of some of the farm foods so they can be picked up by the gravity gun.</li><li>Changed the !fixeco command so it increases the economy points instead of the mayor funds.</li><li>Fixed players not getting armor and weapons while the perk is activated after they die or change jobs.</li><li>Fixed RPG sometimes creating script errors when players tried to drop it.</li><li>Added timer to mayor perks that can last up to 1 hour after the perk is bought depending on the economy rating. (If the rating is 0 or below, the timer is set to 10 minutes. If the rating is over 0, the timer will increase by 1, so if the economy is 50/50, the timer will be 60 minutes.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 5/24",
		"date": "May 24, 2019",
		"info": "<p>This update got very big very fast, and this is really only part 1, part 2 will hopefully come in a few days from now. I'm releasing the changelog for this now in case we have another session before part 2 and players want to see the changelog.</p><ul><li>Fixed wood not being able to be placed on the crafting table.</li><li>Fixed purge creating script errors and removing the HUD when activated.</li><li>Fixed keypad tool creating script errors when trying to update the password to an entity that wasn't a keypad.</li><li>Modified the police badge so it gives the details of the person holding it in chat. (Details include real name, fake name, profession, and gov verification. Verified gov jobs include all cops and the mayor.)</li><li>Modified bronze, silver, and gold money printers so that they require paper to print. (Paper can be found at the contraband NPC and can be inventoried, however once you inventory a printer, it's paper will be removed.)</li><li>Removed global limit on some contraband items that still had it.</li><li>Added police badge to the contraband NPC.</li><li>Added !showid chat command that does the same thing as the badge listed above except there's no gov verification.</li><li>Added crafting blueprints that players can find and buy from other players that allow them to craft a specific item once it's placed near the crafting table. (Blueprints can be obtained by smuggling, bank robbing, completing random events, and through the blueprint dumpster which can be found at the gas station that's closest to spawn on every map.)</li><li>Slightly increased the paychecks for law enforcement jobs.</li><li>Changed some of the negative mayor events so they are less brutal on the economy when the mayor is forced to select the most negative choice due to not having enough funds.</li><li>Fixed the mayor's paycheck being the default DarkRP paycheck.</li><li>Slightly reduced the IA Agent's paycheck.</li><li>Added extended spawn menu for accessing materials and sounds that you wouldn't be able to otherwise.</li><li>Fixed money printers and mining carts not having owners after spawning from a players inventory.</li><li>Modified the car bomb protection and vehicle health kit in the NPC shop so that tow truck drivers can buy them at a discounter price, while all other players can buy them at full price.</li><li>Added car bomb protection to inventory support.</li><li>Added advanced duplicator 2 tool.</li><li>Fixed courier NPC not spawning on any maps.</li></ul>"
	},
	{
		"title": "CityRP Server Update 5/13",
		"date": "May 13, 2019",
		"info": "<ul><li>Fixed players getting mayor event popups even if they aren't the mayor.</li><li>Fixed police officers and emergency responders not being able to hear the life alert sound.</li><li>Fixed dumpster creating script errors when trying to spawn a fire extinguisher.</li><li>Fixed disabled vehicle mayor event creating script errors when trying to unlock a vehicle that didn't exist.</li><li>Replaced crafting system with a custom one that supports any ingredient. (Currently has the same recipes as before. I'll start changing them once we have a session to test it out.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 5/8",
		"date": "May 8, 2019",
		"info": "<ul><li>Fixed spikestrip creating script errors when a player went to pick it up.</li><li>Fixed gas can creating script errors when a player tried to drop it.</li><li>Fixed mayor system creating script errors when it tried to send messages to players about losing economy points.</li><li>Fixed deposit boxes sometimes creating script errors when money was placed inside.</li><li>Fixed money printers creating script errors when they tried to print more money after being removed.</li><li>Added sales tax that the mayor can adjust that will tax people when they buy something from the NPC shop and the tax money goes to the mayor funds. (Eco points go down by 5 every time the sales tax is changed to prevent abuse.)</li><li>Fixed mayor events stacking up when the mayor goes AFK and making it impossible to close the windows without reconnecting to the server.</li><li>Fixed mayor menu popping up when the mayor tried to buy a door.</li><li>Fixed the forest fire mayor event requiring the mayor to pay for both options, making it impossible to complete the event and forcing the mayor to reconnect if the mayor funds were at 0.</li><li>Added option to mayor funds management that allows the mayor to take money out of his own wallet and put it into the funds.</li><li>Removed NPC shop 50% discount. (It was disabled before but it's removed completely now.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 4/30",
		"date": "April 30, 2019",
		"info": "<ul><li>Fixed shooter NPC not targeting players that connected after the NPC spawned.</li><li>Fixed default DarkRP weapons and default money printer being able to be bought through the F4 menu.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/23",
		"date": "March 23, 2019",
		"info": "<ul><li>Modified disguise SWEP so the player stays disguised until they take damage.</li><li>Updated DarkRP to the latest version. (Was over a year out of date.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/20",
		"date": "March 20, 2019",
		"info": "<ul><li>Fixed players being able to inventory money printers that are about to explode.</li><li>Added vending machines and breakout NPC to rp_truenorth_v1a.</li><li>Added rule stating that players are allowed to make custom vehicles as long as they are breakable or the driver has the ability to be damaged.</li><li>Added iron refiner to maps that didn't have them.</li><li>Removed rule that limits illegal activity for government and emergency responder jobs.</li><li>Reduced the amount of money that players can can demand when mugging or kidnapping other players.</li><li>Fixed mayor voting NPC creating errors when trying to spawn before the server fully loaded.</li><li>Fixed the money printer model in the contraband NPC menu being an outdated model and an error for some players.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/18",
		"date": "March 18, 2019",
		"info": "<ul><li>Fixed vehicle tires not being able to be damaged.</li><li>Fixed vehicles traveling faster than normal after having their tires repaired.</li></ul>"
	},
	{
		"title": "HL2RP, By Me...",
		"author": "Jas",
		"date": "March 17, 2019",
		"info": "<p>So I decided to actually make my own Hl2rp on Nutscript, if everything goes as planned, the server should be open by Maybe 2PM Central Time? Sounds about right. Everyone will be open to join and make suggestions, since this is actually my first time opening a server.</p>"
	},
	{
		"title": "CityRP Server Update 3/16",
		"date": "March 16, 2019",
		"info": "<ul><li>Fixed players not being able to sell food to the farm NPC.</li><li>Reduced the price of ammo for government officials and police officers.</li><li>Added random event positions to the rest of the maps.</li><li>Slightly reduced the price of truck and trailer rentals.</li><li>Changed prop spawning so that players must pay a certain amount to spawn props depending on if the model is default source or not. (This is not permanent, if the majority of players want it, prop paying can be disabled and enabled on the fly by a superadmin.)</li><li>Added shopkeeper job that can spawn props and sell them to other players. (Follows same rule set as other civilian jobs such as tow truck driver and news cameraman.)</li><li>Fixed players being able to flip the truck over in the overturned truck event without having to flip the trailer back over as well.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/2",
		"date": "March 2, 2019",
		"info": "<ul><li>Fixed one of the mayor events creating script errors and causing the mayor funds to go down without actually doing the event function.</li><li>Fixed players being able to physgun elevators.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/1",
		"date": "March 1, 2019",
		"info": "<ul><li>Added security playermodels to the citizen job.</li><li>Fixed smuggle trucks not taking damage.</li><li>Fixed only the buyer of the smuggle truck being allowed to get the smuggle reward.</li><li>Added random events. (Currently includes overturned truck, active shooter, house fire, money transfer, and food delivery.)</li><li>Removed the spring from crafting recipes.</li><li>Redid the economy so money is more equally balanced and high-end weapons are more rewarding and riskier to make. (Required a purge of wallets, inventories, ATMs, and car dealer, see the discussion in the dev group for details.)</li><li>Added iron refiner entity that converts craftable items back into 70% of the iron it takes to make it. (Note that the item doesn't have to be crafted in order for it to work, for example if you have shotgun that was given to you a few sessions back, it will still refine.)</li><li>Removed the multiple fading door rule.</li><li>Changed wording on the stolen item rule and one way door rule so it's more clear.</li><li>Disabled players being able to put money into their inventory.</li><li>Added weapon stripper that allows police to strip weapons from players, then give them back at a later point or remove them permanently.</li><li>Modified farming system so when a player harvests a plant, it gets removed instead of spawning more food. (And because of this the global plant limit has been increased.)</li><li>Repurposed the check machine as a machine that can be used during emergency events (such as a hostage situation) to take money out of the government bank to pay for the emergency. (Players will now have to use their personal wallets to hand out loans because of this, so make sure you have at least 50,000 or so before becoming a banker.)</li><li>Added back the bus driver job. (Due to the old bus spawner location being taken by the truck and trailer rental NPCs on some maps, the bus has been moved to the civilian car dealer.)</li><li>Fixed fine system not wanting players who declined the fine.</li><li>Fixed respawn delay creating script errors if players disconnect from the server while dead.</li><li>Added back the news van.</li><li>Fixed smuggle system having a temporary 50 minute wait time.</li><li>Removed hunting system. (I'll add it back once I can figure out how to make the deer run when they're shot or detect a nearby player.)</li><li>Reworded the mayor killing rules so they are more clear. (A lot changed with this so make sure you check the website.)</li><li>Added Utility Worker and Hitman jobs. (See website for details.)</li><li>Reworded the rule that states players can get fined for not doing their job to say that government officials and law enforcement officials have the right to demote players back to citizens if they find out.</li><li>Added rule stating that players can only become a terrorist once per session.</li><li>Removed money pot. (I can't remember the last time somebody actually used this for it's intended purpose.)</li><li>Fixed exploit where players could drop grenades and pick them up again to get more ammo.</li><li>Added mayor perk that allows the mayor to give all government officials life alerts.</li><li>Fixed 40mm ammo not loading due to the ammo base not being on the server.</li><li>Fixed slot machine getting stuck in the ground when spawned from the NPC shop on some maps.</li><li>Moved one of the supermarket NPCs on rp_newexton2_v4h so it's in front of the counter to prevent items from spawning inside the counter.</li><li>Added indicator to the purifier that tells you how much weed is currently being purified.</li><li>Added ladder entity to NPC shop. (Used as an easier way to vertically climb. Can be inventoried.)</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 2/20",
		"date": "February 20, 2019",
		"info": "<ul><li>Replaced ragdoll combat with dropzone.</li><li>Added DarkRP gamemode from Simple DarkRP.</li><li>Removed old Simple DarkRP maps and replaced them with rp_downtown_night_v2 and rp_unioncity.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 2/4",
		"date": "February 4, 2019",
		"info": "<ul><li>Removed Gredwitch B-28, Hoverboards, ACF, and lhd_island.</li><li>Added Simfphy's Unsupported Tools.</li><li>Replaced Sako Sniper Rifle with the Mosin Nagant.</li><li>Replaced the CW P228 with a Glock 17.</li><li>Replaced VCMod ELS with Photon.</li><li>Added physical clip tool.</li><li>Added SGM RV.</li><li>Added Dodge Challenger Hellcat from CityRP.</li><li>Added police playermodels from CityRP.</li><li>Added scientist playermodels from HLU RP.</li><li>Added VFire.</li><li>Added TDM GMC pack.</li><li>Added SWAT truck from CityRP.</li><li>Added all maps from CityRP and HLU RP.</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/3 Part 2",
		"date": "February 3, 2019",
		"info": "<ul><li>Fixed players losing money when they died while arrested or when there's a purge.</li><li>Fixed money printers not having an owner if spawned through the inventory.</li><li>Added feature to stove gas that removes the gas without an explosion if there are multiple gas cans on the map. (Done to prevent players from spawning multiple gas cans and exploding them all at once to lag the server.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/3",
		"date": "February 3, 2019",
		"info": "<ul><li>Fixed mayor not being able to use government ammo lockers.</li><li>Added a limit to the amount of farming plants that can be on the server at once.</li><li>Fixed PMs and mayor broadcasts being relayed through the news TV.</li><li>Fixed money printers sometimes not removing themselves after being damaged.</li><li>Fixed molotovs creating fires that couldn't be removed or extinguished.</li><li>Fixed money printers not having owners.</li><li>Added feature to money printer that allows players to extinguish a money printer fire before it explodes.</li><li>Fixed purges and parades not ending after the mayor was killed.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 1/31",
		"date": "January 31, 2019",
		"info": "<ul><li>Fixed players not spawning in the admin room. (BMRP:Cascade)</li><li>Fixed players sometimes not spawning after the main round starts. (BMRP:Cascade)</li><li>Fixed players not changing to visitor when they escape. (BMRP:Cascade)</li><li>Reduced the amount of damage alien NPCs do. (BMRP:Cascade & BMRP:Classic)</li><li>Fixed players health and armor not resetting after the round ends. (BMRP:Cascade)</li><li>Fixed doors being left open and unlocked when the round ends. (BMRP:Cascade)</li><li>Fixed players who aren't scientists spawning with physguns, gravguns, and toolguns. (BMRP:Cascade)</li><li>Fixed zombie SWEP creating script errors. (BMRP:Cascade)</li><li>Fixed City 17 RP pickaxe giving players pistol ammo. (City 17 RP & Outland RP)</li><li>Added group chat for each of the BMRP:Cascade jobs. (BMRP:Cascade)</li><li>Fixed players not being able to pocket the iron spawned from the iron generator. (City 17 RP)</li><li>Modified iron generator so the iron spawns on top of the generator instead of under it. (City 17 RP)</li><li>Fixed chat sounds playing even when certain words weren't said. (All Gamemodes.)</li><li>Fixed the medic job being selected instead of scientist if there were 3 players or less on the server. (BMRP:Cascade)</li><li>Fixed players getting rewarded for killing members of their own team. (BMRP:Cascade)</li><li>Fixed one of the HECU spawns being inside one of the escape vehicle spawns. (BMRP:Cascade)</li><li>Fixed NPCs not being removed after the round ends. (BMRP:Cascade)</li><li>Fixed script errors appearing when players were killed by map objects such as doors or tram lines. (BMRP:Cascade)</li><li>Reduced the volume of the alarms on rp_bmrf. (BMRP:Cascade)</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/29",
		"date": "January 29, 2019",
		"info": "<ul><li>Fixed players not being able to cash in their stolen money bags from the government bank.</li><li>Slightly reduced the taser charge up time.</li><li>Made the cook's stove, keg, fridge, and pizza oven free in the F4 menu.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 1/27",
		"date": "January 27, 2019",
		"info": "<ul><li>Changed BMRP:Cascade job selection so the server randomly picks jobs for the players, instead of manually waiting for players to choose their own job.</li><li>Disabled the kill console command for BMRP:Cascade.</li><li>Added a system that teleports players to the starting area when they spawn in on BMRP:Cascade.</li><li>Fixed VFire not being supported on BMRP:Cascade.</li><li>Disabled prop spawning when players are in the starting room on BMRP:Cascade.</li><li>Fixed alarms not starting when the round starts on BMRP:Cascade.</li><li>Fixed users being able to physgun permanent textscreens.</li><li>Changed BMRP:Cascade rewards so that players who stay alive and don't escape by the end of the round get a bigger reward compared to players who do escape.</li><li>Changed HECU spawn timer on BMRP:Cascade so the timer starts when the scientists are released and not when all of the other jobs are released.</li><li>Fixed some BMRP:Classic events spawning activated.</li><li>Fixed random fires activating 2-5 times at once on BMRP:Classic.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/26",
		"date": "January 26, 2019",
		"info": "<ul><li>Fixed large metal detector removing itself when bought from the store.</li><li>Fixed dumpster items removing themselves when they landed on the top of the dumpster.</li><li>Added off-duty locker that allows government jobs to go off duty if there are at least two other government officials on the server. (Takes away your job weapons when used, also sets your job to Off-Duty.)</li><li>Fixed players not being able to physgun or toolgun their own government vehicles.</li><li>Gave tow truck driver a brake release tool to use in cases where the car can't be towed normally and it's doors are locked.</li><li>Added feature to disguise kit that disguises your name in text chat to a set fake name. (Set your fake name by typing '/fakename [name]' in chat.)</li><li>Fixed players not being able to drop weapons if the weapon model wasn't seen by the server.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/25",
		"date": "January 25, 2019",
		"info": "<ul><li>Replaced VCMod ELS with Photon.</li><li>Swapped the Glock's damage with the M1911 and made the M1911 the cheapest pistol.</li><li>Replaced the FiveSeven in the police officer loadout with the Glock 17.</li><li>Replaced flatbed smuggle truck with an enclosed box truck.</li><li>Fixed players not being able to remove certain government vehicles.</li><li>Fixed SWAT Commander and Mayors Bodyguard not being able to confiscate smuggle items.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/20",
		"date": "January 20, 2019",
		"info": "<ul><li>Changed deer spawning so one spawns every 5 minutes instead of 3 spawning every 10 minutes.</li><li>Fixed players being able to physgun dumpsters.</li><li>Fixed dumpsters making noise when players bumped into them.</li><li>Increased the price of weed plants to 1500.</li><li>Disabled inventory support for weed plant.</li><li>Added deer meat and life alert to inventory support.</li><li>Fixed deer meat not increasing/decreasing hunger when eaten.</li><li>Fixed dumpster creating script errors if the player attempted to inventory the junk prop that spawned on top of the dumpster.</li><li>Fixed government bank vault not allowing players to rob even when there were enough cops.</li><li>Added deer spawns to the rest of the maps.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/19",
		"date": "January 19, 2019",
		"info": "<ul><li>Added life alert system that notifies police and EMS when a player types !alert in chat.</li><li>Added hunting system. (Once you kill a deer you can either harvest the meat to cook or harvest just the head as a trophy.)</li><li>Reduced the price of trucks and trailers.</li><li>Added feature to dumpster that allows players to throw away small to medium items.</li><li>Fixed non-admins not being able to pick up trailers.</li><li>Added default law stating that you must have a manifest with you when hauling a loaded trailer, and any citizen can drive a truck as long as they have said manifest.</li><li>Added default law stating that police have the right to pull over and inspect semi trucks that are suspected of hauling illegal items.</li><li>Added default law stating that only rifles and shotguns can be used in hunting.</li><li>Removed all default laws and server rules related to boats.</li><li>Renamed Fish Stove to Cooking Stove.</li></ul>"
	},
	{
		"title": "Discord Server Up",
		"date": "January 18, 2019",
		"info": "<p>I made A Discord server For Lambda Gaming. Its in Testing Right now But if you would Like to Join Here's The Invite, Like I said, its In testing, So give some feedback on How to make it better. https://discord.gg/tFXUHe</p>"
	},
	{
		"title": "CityRP Server Update 1/13",
		"date": "January 13, 2019",
		"info": "<ul><li>Moved drug dealer on rp_florida_v2 to someplace thats more accessible.</li><li>Added text chat support to news TV.</li><li>Replaced rp_pinescity_v2b with rp_truenorth_v1a.</li><li>Added DarkRP weapon selling system. (Press reload+use on a weapon to sell it.)</li><li>Added overhead text to Truck NPC and Trailer Kiosk.</li><li>Fixed breakout NPC creating script errors when first spawning on the map.</li></ul><p>Emergency events may come next update.</p>"
	},
	{
		"title": "Servers Being Merged",
		"date": "January 12, 2019",
		"info": "<p>Crime RP and Simple DarkR.....I mean Boneless RP are being merged together to create a whole new server, which is currently being called Chaos RP. The concept is pretty simple: The server will originally start out with only a few jobs: Civilian, Mayor, Police Chief, Police Officer, Mob Boss, Gangster, Gang 1 Leader, Gang 1 Member, Gang 2 Leader, Gang 2 Member, Military Officer, Sergeant, and Private. Once we have the base mechanics ready, we'll then start adding in various RP addons.</p><p>Basically, we're starting with a base gamemode and then throwing random addons at the wall and seeing what sticks, and once we get to the point where the amount of addons on the server is causing performance issues, we'll either remove some addons or just purge the whole thing and start fresh.</p><p>This server is meant to be a server 2 or 3 people can play on when nobody else is on to play on CityRP or HLU RP, as well as a testing ground for potential additions to other servers.</p>"
	},
	{
		"title": "CityRP Server Update 1/12",
		"date": "January 12, 2019",
		"info": "<p>Note that emergency events are not included in this update, they should be included in the next.</p><ul><li>Reduced the time it takes for the taser to charge up.</li><li>Enabled losing money on death. (Currently set to 1.2% of the players wallet.)</li><li>Added charge up sound to the taser.</li><li>Moved farm NPC on rp_evocity2_v5p to the main city.</li><li>Fixed gas can sometimes creating script errors when the secondary fire is pressed.</li><li>Slightly increased the strength of normal police handcuffs.</li><li>Slightly increased the price of farm seeds.</li><li>Fixed crafting table creating script errors if an item was being created as the table was removed.</li><li>Fixed dumpster sometimes creating script errors.</li><li>Fixed handcuffs preventing people from changing their RP name.</li><li>Reduced police handcuffs recharge to 10 seconds.</li><li>Replaced boats with semi trucks.</li><li>Fixed some mayor events not adjusting the economy and mayor funds.</li><li>Fixed fire on cuttable trees creating script errors.</li><li>Added forensic investigator skin for the GMC transport truck.</li><li>Replaced Sake sniper rifle with the Mosin Nagant.</li><li>Added cardboard box SWEP to NPC shop.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/1",
		"date": "January 1, 2019",
		"info": "<ul><li>Fixed spikestrip creating script errors when used.</li><li>Fixed some money printers not spawning money.</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/26",
		"date": "November 26, 2018",
		"info": "<ul><li>Added GUI to some items that gives you information about the item when you look directly at it. (Currently only includes items that don't make it obvious as to how to use it. Will probably add support for more items in the future.)</li><li>Changed visuals for some entities so they only appear when the player is within a certain range of the entity. (Client optimization.)</li><li>Fixed possible confliction with the farm system and gamemode version.</li><li>Changed alcoholic beverages so they increase hunger points instead of health.</li><li>Decreased check machine cooldown timer to 3 minutes.</li><li>Added ability to check machine that notifies civilian jobs when the banker spawns a check. (Added to give criminals a fair chance at stealing the check since bankers no longer have to announce when they start the police escort to the banker NPC.)</li></ul>"
	},
	{
		"title": "Sandbox Server Update 11/25",
		"date": "November 25, 2018",
		"info": "<ul><li>Removed gm_excess_construct.</li><li>Removed gm_driversheaven.</li><li>Added gm_boreas.</li><li>Added Gredwitch P-51 Mustang.</li><li>Added gm_mountainlake2.</li><li>Added gm_trainconstruct.</li></ul>"
	},
	{
		"title": "CityRP Server Update 11/22",
		"date": "November 22, 2018",
		"info": "<p>This will be the last major CityRP update for the year, all future CityRP updates for 2018 will be balancing, bug fixes, and possibly tiny additions.</p><ul><li>Updated rp_newexton2_v3h to rp_newexton2_v4.</li><li>Replaced default presistance system with a custom one that saves entities in a more simple way. (This might improve loading times since the old system was loading some entities under the map that nobody could get to. I mainly did this so it's easier to add or remove entities without having to wait for the server to load.)</li><li>Fixed large clock not being able to be inventoried.</li><li>Fixed ambulance doors not opening.</li><li>Fixed custom mayor commands not being declared through DarkRP. (Still functions the same, just removes the errors.)</li><li>Added CW RPG. (Same one that's in CrimeRP, very powerful but extremely expensive to craft.)</li><li>Replaced VFire molotov with the official one. (Apparently the one we were using was a reupload, this will require a download since the original one is slightly different than the one we were using.)</li><li>Changed /fixeco command to !fixeco. (Changed because this was causing some confusion since all other custom chat commands of mine use '!'.)</li><li>Moved deposit box van off of private parking lots if they weren't already.</li><li>Added vending machines to maps that didn't have them.</li><li>Merged cocaine NPC with drug NPC so there is one universal NPC for selling all drugs. (NPC still functions the same, walk up to the NPC in-game to see the use instructions.)</li><li>Updated drug NPC's GUI description so it gives players the correct information on how to use the NPC.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/30",
		"date": "October 30, 2018",
		"info": "<ul><li>Fixed players not being able to rob the government bank if they have a custom job name.</li><li>Added transport truck to government vehicle NPC for police officers to spawn. (Can be used to transport evidence without having to weld everything to the roof of an SUV.)</li><li>Allowed SWAT jobs to spawn the unmarked Chevy Tahoe as an alternative to the SWAT van.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/29",
		"date": "October 29, 2018",
		"info": "<ul><li>Modified cocaine system so you don't need 6 bricks to sell to the NPC.</li><li>Modified cocaine system's recipe system so it's randomly generated every time the server starts.</li><li>Modified speed trap radar to notify the owner of the trap that someone is speeding instead of fining the speeder directly.</li><li>Changed model of release NPC so it differs from the model of the boat NPC.</li><li>Decreased the amount of money required to use the slot machine.</li><li>Removed job restriction for the release NPC. (Anyone who gets arrested can use the NPC now, not just civilian jobs.)</li><li>Fixed release NPC spawning half way in the floor.</li><li>Decreased the time it takes to get released from the release NPC.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/28",
		"date": "October 28, 2018",
		"info": "<ul><li>Fixed players being able to spawn unlimited ambulances as emergency responders.</li><li>Added feature to taser that requires it to charge up for 5 seconds before firing.</li><li>Removed confiscator NPC.</li><li>Moved police ammo lockers on rp_chaos_city_v33x_03 and rp_evocity_v5p from the jails to the second floor of city hall.</li><li>Made weed and meth unstackable in the inventory.</li><li>Fixed money giving from the drug NPC sometimes falling through the ground.</li><li>Fixed deposit box money bags not being able to be turned in at the van.</li><li>Added feature to deposit boxes so it notifies bankers when money is being taken out of the deposit box.</li><li>Added back handcuff feature to release NPC so criminals can use it to break out, no matter if they were arrested automatically using the stick or manually using the handcuffs.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/27",
		"date": "October 27, 2018",
		"info": "<ul><li>Modified system that decreases the economy points if there is no mayor so it decreases by a certain amount depending on how many players are on the server.</li><li>Fixed molotov giving extra ammo when dropped and picked up again.</li><li>Disabled allowing players to drop gas cans. (This was the only way I was able to prevent players from dropping the weapon to get more ammo.)</li><li>Fixed release NPC not working with the new arrest stick.</li><li>Added ability to smoke grenade that allows them to extinguish fires within the smoke radius. (I might give emergency responders the grenade by default if there's a push for it, but for now they have to buy the grenades at the contraband NPC, or let swat use their grenades on the fire.)</li></ul>"
	},
	{
		"title": "HLU RP Server Update 10/26",
		"date": "October 26, 2018",
		"info": "<ul><li>Replaced fire system with VFire.</li><li>Replaced default HUD with the one from CityRP.</li><li>Modified new HUD so it changes color depending on what gamemode is currently active.</li><li>Fixed BMRP:Classic vox chat commands not playing any sounds.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/26",
		"date": "October 26, 2018",
		"info": "<ul><li>Removed ability that removes money from the government bank when selling drugs. (Messed up the economy when the mayor made drugs legal.)</li><li>Added entity for tow truck driver that allows them to give 'armor' to vehicles and make them immune to car bombs. (Item can be purchased at the supermarket.)</li><li>Fixed jail positions not being set on rp_newexton2_v3h.</li><li>Fixed drug and banker NPCs not spawning on rp_newexton2_v3h.</li><li>Reduced damage and spread rate of fires.</li><li>Added ammo to the gas can so you can't get unlimited pours.</li><li>Moved contraband NPC on rp_newexton2_v3h so it's not blocking the back entrance to the mall.</li><li>Moved purifier on rp_newexton2_v3h to a new location farther away from the drug NPC.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/24",
		"date": "October 24, 2018",
		"info": "<ul><li>Added rule that states that if a player becomes a barricaded suspect (armed inside a building and refusing to cooperate with police), or if a player is in a pursuit, the police are allowed to keep them wanted until they are arrested or killed.</li><li>Added ability to ambulance that allows emergency responders to heal players above 100 if they are standing near the ambulance.</li><li>Added ability to the health NPC that increases the price of healing if there is an emergency responder on the server.</li><li>Replaced fire system with VFire.</li><li>Fixed handcuffs creating script errors when trying to cuff someone who is in a vehicle or sitting.</li><li>Fixed jail positions not being set on rp_florida_v2.</li><li>Replaced handcuffs for SWAT jobs with a police leash that allows them to drag players.</li><li>Replaced arrest sticks with the original ones that have a timer.</li><li>Added ability to the default arrest stick that allows the player to select a jail time.</li><li>Modified weed plant so it only outputs consumable weed.</li><li>Added weed purifier that turns consumable weed into marketable weed after 45 seconds.</li><li>Removed mayor perk that gives all government officials 50 extra health. (Emergency responders can take care of that now.)</li><li>Modified drug addictions so they give the player debuffs if they use too much of the drug. (Also fixes that weird thing where you would randomly burst into flames after using weed. Note that this still keeps the chance of instantly dying after using meth if you're health is extremely low.)</li><li>Gave emergency responders a narcan SWEP that will treat any debuffs a player may get from drugs.</li><li>Added default law stating that palyers who walk slowly are assumed to be under the influence of drugs.</li><li>Added rule stating that OOC chats that appear to be adverts can be used in RP situations, including the name of who sent it and the contents of the chat.</li><li>Modified script of fire truck so it handles better. (Drives more like the swat truck now, still slides out of control if you make a sudden turn but it's a lot better at normal speeds now.)</li><li>Modified handheld metal detector so it doesn't detect explosives, and the large metal detector so it doesn't detect pistols or illegal tools.</li><li>Added rule stating that due to them being near indestructible, boats are not allowed to be used in major crimes such as pursuits, robberies, drug transport, etc.</li><li>Removed unarrest stick from the contraband NPC. (Forgot to remove it last major update, keeping this would have made the release NPC useless.)</li><li>Fixed fire truck having a missing texture overlay.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 10/20",
		"date": "October 20, 2018",
		"info": "<ul><li>Added Gredwitch's emplacement pack, artillery sweps, and various aircraft.</li><li>Added lhd_island.</li><li>Added gm_forest_arctic.</li><li>Removed some old content that was left on the server from a previous update.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 10/20",
		"date": "October 20, 2018",
		"info": "<ul><li>Replaced rp_c24_v1 with rp_city24_v2.</li><li>Added metrocop playermodel pack.</li><li>Removed combine playermodels that were exclusive to rp_c24_v1. (The City 17 and City 24 jobs use the same models now, they may be merged into one job later since the only differnce between the two were the models.)</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 10/19",
		"date": "October 19, 2018",
		"info": "<ul><li>Replaced Murder gamemode with Homicide.</li><li>Updated website to include all of the new gamemodes that were added in previous updates.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 10/17",
		"date": "October 17, 2018",
		"info": "<ul><li>Gave broom SWEP to service official on BMRP:Classic. (Used to clean up decals such as blood and bullet holes.)</li><li>Modified BMRP:Classic administrator and HECU captain vox chat commands so they use the vox system sounds instead of separate ones.</li><li>Replaced DarkRP chat sound system with a custom one that supports separate playermodels. (Currently supports the following playermodels: Male citizen, female citizen, civil protection, combine soldiers, scientists, security guard, and HECU marine.)</li><li>Fixed lockdown sound on BMRP:Classic not playing for non-admins.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/6",
		"date": "October 6, 2018",
		"info": "<ul><li>Fixed drug NPC still being in the main city on rp_chaos_city_v33x_03 instead of in the desert.</li><li>Fixed ambulance NPC location description for rp_chaos_city_v33x_03 being incorrect on the website.</li></ul>"
	},
	{
		"title": "CityRP Server Update 10/4",
		"date": "October 4, 2018",
		"info": "<ul><li>Added more mayor events.</li><li>Updated rp_florida to rp_florida_v2.</li><li>Updated NPC and item location descriptions so they are more clear and detailed.</li><li>Fixed rocks and trees creating script errors when damaged by something that wasn't a player.</li></ul>"
	},
	{
		"title": "CityRP Server Update 9/30",
		"date": "September 30, 2018",
		"info": "<ul><li>Fixed 40mm grenade ammo not spawning when crafted.</li><li>Added system that slowly decreases the eco points if there is no mayor on the server.</li><li>Fixed money printers sometimes not creating money.</li><li>Fixed speed radar creating script errors when trying to display a message to the player.</li><li>Fixed ford crown victoria having slippery handling at high speeds. (You'll definetely notice a difference, just dont stand on it when going around a curve.)</li><li>Fixed vehicle repair tool creating script errors in rare cases.</li><li>Fixed spike strips not auto removing after it's timer is up.</li><li>Fixed meth stove creating script errors when it doesn't detect the gas amount.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 9/25",
		"date": "September 25, 2018",
		"info": "<ul><li>Added xen creature and zombie spawns to BMRP:Cascade.</li><li>Precache certain models to reduce lag in between rounds on BMRP:Cascade.</li><li>Added system to BMRP:Cascade that automatically tunes everyone's radios to the same channel at the beginning of the round.</li><li>Added global timer with a warning that notifies players when the round is half over. (The timer lasts 20 minutes currently, it can be disabled at any time during the round to extend until all players have died.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 9/23",
		"date": "September 23, 2018",
		"info": "<ul><li>Add default law stating that boats are not permitted on land unless they are being hauled by a car.</li><li>Fixed exploit where players could spawn unlimited news TVs.</li><li>Fixed cocaine stove gas going negative if the stove is left on.</li><li>Reduced the amount of money the courier system gives.</li></ul>"
	},
	{
		"title": "CityRP Server Update 9/22",
		"date": "September 22, 2018",
		"info": "<ul><li>Redid the description for the IA Agent to state that they can get involved if government officials are breaking their own laws, or if the mayor is having people killed/arrested/kidnapped/etc multiple times for no apparent reason.</li><li>Added system that cuts the price of NPC shop and health NPC items in half permanently if they player purchases it. (Costs 1 million, can be purchased at the NPC shop.)</li><li>Added breakout NPC that will uncuff and reward jailed players after a certain amount of time. (Wants the escapee when they use the NPC, it is recommended you have an armed partner on standby if you attempt a breakout.)</li><li>Modified handcuffs so only police jobs can uncuff someone, everyone else has to use the breakout NPC.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 9/10",
		"date": "September 10, 2018",
		"info": "<p>This is update 4/4 of the HLU RP revamp. This update focuses on the new BMRP:Cascade gamemode, as well as a few tweaks involving money.</p><ul><li>Added BMRP:Cascade gamemode. (See below for details.)</li><li>Replaced rp_lambdacore_fixed with rp_bmrf.</li><li>Fixed players being able to physgun breakable glass.</li><li>Added command that resets all wallets back to 3000. (Yes, money will be reset at the beginning of every session from now on, whether you are on the server or not. This was done so making money in the BMRP gamemodes is important so you can afford the big boi toys later on in City 17 RP and Outland RP.)</li><li>Added page to website that explains how to make money throughout the RPs.</li></ul><h3>BMRP:Cascade Details:</h3><ul><li>Game starts at the beginning of the cascade, no gameplay before that. The gamemode itself is built on top of DarkRP, but you may find that it plays similar to Breach.</li><li>Game takes place on rp_bmrf, the newest and biggest BMRP map currently on the workshop.</li><li>Players can play as friendly vortigaunts if player count is high. (Goes against lore but could give extra players something to do.)</li><li>Due to an automated round-start mechanic being not yet implemented, a superadmin will start the round after players have chosen their jobs and the jobs have been balanced out.</li><li>Scientists are allowed to build limited objects with the dupe tool. (Dupe tool could be abused, scientists could become op. Props will be severely limited.)</li><li>Players are allowed to become traitors to their coworkers. (Such as HECU joining the security force or the scientists joining the HECU, but if it starts to become repetitive every round players may be asked to stop.)</li><li>Scientists get released first in the pre-round to build, similar to Class Ds.</li><li>Security and scientists work together, they can take medics hostage for free healing.</li><li>Facility administrator is to kill everyone on sight while trying to escape.</li><li>HECU is to escort medics out while killing everyone else.</li><li>Medics are to work with HECU to escape while trying to avoid being captured by scientists or security.</li><li>Vortigaunts are to help players kill aliens and zombies.</li><li>Zombies are to kill everyone but their own kind.</li><li>Certain items will randomly spawn each round in specific spots. Ex: Special prototype weapons only spawn in science labs, and armor only spawns in locker rooms.</li><li>Players will get rewarded for escaping the facility and killing enemy players. (Escaping reward does not apply to HECU.)</li><li>The facility administrator is rewarded by how many kills he has gotten throughout the round.</li><li>Players killed by headcrabs will become zombies.</li><li>If zombies are equal to or are greater than the number of human players, all human players are allowed to team up, no matter what team they are on.</li><li>Since its impossible to randomise the layout of the map, random obstructions will spawn at the most common access points so players are forced to not use the same route every round. For example, concrete might fall from the ceiling at a tram station, blocking players from accessing the tram from that specific sector.</li><li>A tram controller will spawn at a random location and will have the trams disabled by default. Since all of the sectors are connected to each other through some other access point, the trams arent vital to gameplay and are only there to speed up the escape process. Players will have to press their use key on the controller to start the trams back up.</li><li>PM chat is disabled, players have to rely on local chat and g-terminals to get private messages across. Radios can work as well but they have a risk of someone listening in, even if the signal is weak.</li><li>HECU and security will spawn with random weapons to add variety.</li><li>Players can obtain fire extinguishers by pressing their use key on wall-mounted cases. They can then use the extinguishers to clear fire obstructions. (All fires have to be cleared before the obstruction is cleared, players cannot walk through the fire like in BMRP:Classic.)</li><li>The escape vehicle spawns at a random location topside. Players have to press their use key on it to escape.</li><li>Most doors in the map are locked when the round starts. Security and HECU are equipped with battering rams to get past these locked doors.</li><li>The server will be password locked for community members only while this gamemode is running until I feel comfortable enough to run it with randoms.</li></ul><p>If you have any questions feel free to ask me. I'm planning on having a test session for the new gamemode either this coming Friday or Sunday. I may add a few more minor features to the gamemode before the first test run, depending on what i'm doing for the rest of the week.</p>"
	},
	{
		"title": "HLU RP Server Update 8/30",
		"date": "August 30, 2018",
		"info": "<ul><li>Fixed weapons engineer crafting table not crafting anything.</li><li>Changed craftable weapons so they spawn with ammo in them.</li><li>Fixed some BMRP autorun commands not working properly.</li><li>Added rule stating that overwatch elites, guards, and soldiers can only respond to situations that call for them. (For example, you can't send elites just to patrol the streets.)</li><li>Fixed flare gun still creating script errors.</li><li>Changed iron generator so the iron spawns nocollided so they don't spray out everywhere when spawned.</li><li>Added BMRP event that spawns a random Half-Life boss in Xen.</li><li>Fixed rebel teleporter damage system not working properly.</li><li>Fixed rebel teleporter not having a set teleport location on rp_industrial17_v1.</li><li>Fixed crystal health displaying as a decimal.</li><li>Fixed mineable entities still creating script errors if damaged by anything that wasn't a player.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 8/19",
		"date": "August 19, 2018",
		"info": "<ul><li>Added loading screen.</li><li>Added map voting system to zombie survival.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 8/16",
		"date": "August 16, 2018",
		"info": "<ul><li>Fixed log card creating script errors.</li><li>Fixed rp_industrial17 not being part of the list of random maps the BMRP nuke chooses from.</li><li>Updated website with the new changes from the last 3 updates.</li><li>Added disguise SWEP for the black market dealer to use on City 17 RP and Outland RP.</li><li>Changed announcement chat so it only works on BMRP.</li><li>Fixed players not being able to drop weapons.</li><li>Fixed half-life 1 weapons not being able to be picked up if crafted.</li><li>Fixed flare gun creating script errors when used.</li><li>Changed HUD skin to the derma skin.</li><li>Fixed satchel charge shipments not working.</li><li>Fixed crafting tables creating script errors when damaged.</li><li>Fixed barnacle SWEP creating script errors when used in thirdperson.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 8/15",
		"date": "August 15, 2018",
		"info": "<ul><li>Replaced zs_swimming_pool_v2 with zs_onett.</li><li>Replaced zs_abandoned_mall with zs_cabin_v4.</li><li>Added zs_uglyfort.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 8/15",
		"date": "August 15, 2018",
		"info": "<p>This is update 3 out of 4 for the HLU RP revamp. This update focuses mainly on BMRP, but also has a few changes that I forgot about in the previous two updates. Update 4 will be the final update with the new BMRP gamemode, some updates might come before it to include changes needed from play testing updates 1-3.</p><ul><li>Removed safety advisor job.</li><li>Added ID system for personnel to use at security checkpoints and such.</li><li>Fixed tool restricting not working. (The drop weapon system was causing the errors, we'll have to rely on the built-in darkrp one until I can find a replacement.)</li><li>Fixed City 24 combine jobs not having an agenda and demote group.</li><li>Added entities that players can experiment with. (Some only appear during events, come can be found by mining special barrels in Xen.)</li><li>Fixed admins not being able to pick up vehicles.</li><li>Removed government man job from Outland RP.</li><li>Changed fire timer so the time is more random and not always set to 30 minutes.</li><li>Added chat command that allows players to notify medics that they need healed.</li><li>Fixed xen hairs not being removed on rp_sectorc_beta when the map loads. (Hairs have to be remove because the NPCs in Xen attack them instead of the player.)</li><li>Added random events made for specific jobs to have players interact more with the environment. (Most events affect the entire facility but can only be dealt with by a single job.)</li><li>Formatted everyone's wallets to 3000.</li><li>Increased damage of Half-Life 1 weapons and replaced the default DarkRP weapons with them.</li><li>Removed research magnifying glass system.</li><li>Added chat command for facility administrator that allows him to remotely turn on the alarm system. (Command is '!alarm')</li><li>Fixed head of security being able to spawn some HECU weapons.</li><li>Fixed visitors getting a salary even though they aren't employed at the facility.</li><li>Reduced salary for all jobs.</li><li>Replaced taser with one from CityRP that has NPC tasing disabled.</li><li>Replaced City 17 RP taser model with one that is more lore-friendly.</li><li>Removed old breaching charge system from City 17 RP. (Will add another one when I find one that actually works.)</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 8/14",
		"date": "August 14, 2018",
		"info": "<ul><li>Increased the number of zombies that spawn at the beginning of each round for zombie survival.</li><li>Reduced the time humans have to set up in between waves for zombie survival.</li><li>Temporarily removed Basebuild gamemode. (Spams script errors in console and demotes admins, will be added back when those two bugs are fixed.)</li><li>Added zs_castle_keep, zs_antarctic_hospital, zs_sludge, zs_swimming_pool_v2, and zs_abandon_factory_redone. (Maps were added before the server started yesterday, they're included here since I didn't make an announcement yesterday.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 8/8",
		"date": "August 8, 2018",
		"info": "<p>Just a couple of items that I forgot in yesterday's update.</p><ul><li>Moved location of drug NPC on rp_chaos_city_v33x_03 to near the desert gun shop.</li><li>Slightly increased storage capacity of smaller foods for the farming crate.</li></ul>"
	},
	{
		"title": "CityRP Server Update 8/7",
		"date": "August 7, 2018",
		"info": "<ul><li>Fixed car evictor not being given to the player after being puchased at the contraband NPC.</li><li>Added feature to courier system that allows players to kill couriers and sell the package to the banker NPC for money.</li><li>Fixed police handcuffs being too weak.</li><li>Added onto the gunpoint rule with another rule stating that the ability to run away while being held at gunpoint no longer applies if you have been killed by someone, revived, and are still being held at gunpoint.</li></ul>"
	},
	{
		"title": "CityRP Server Update 8/6",
		"date": "August 6, 2018",
		"info": "<ul><li>Added feature to economy system that disables perks if the taxes go over 50%.</li><li>Fixed banker being able to rob ATMs.</li><li>Reduced the amount of time a player is frozen after being tased.</li><li>Reduced the cooldown timer for police handcuffs.</li><li>Slightly increased the strength of shackles and leashes.</li><li>Increased the time it takes for farming items to grow.</li><li>Added system that gives the news camerman money for every TV that's tuned into his channel.</li><li>Added door group for banker and law enforcement officials. (Going to be used on doors inside of banks.)</li><li>Removed ability for farming seeds to be stackable in the inventory.</li><li>Removed farming foods from inventory support. (They dont need to be in the inventory since they are meant for selling and there's a separate box that will hold them for you. Note this is only for GROWN foods. Seeds don't apply to this.)</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 8/2",
		"date": "August 2, 2018",
		"info": "<ul><li>Removed stop it, slender gamemode. (Will be replaced later.)</li><li>Removed The Stalker gamemode.</li><li>Added Jazztronauts gamemode.</li></ul>"
	},
	{
		"title": "CityRP Server Update 8/2",
		"date": "August 2, 2018",
		"info": "<ul><li>Fixed money printers not being able to have their money collected.</li><li>Fixed some money printers not having inventory support.</li><li>Modified money printers so they make a loud noise when money is collected and when the printer overheats.</li><li>Increased banker interest to 3% on deposit boxes.</li><li>Increased price of meth equipment.</li><li>Added ammo types and attachments to inventory support.</li><li>Changed mayor life rules so people can only kill the mayor if protesting is ignored, he is killing innocent people, he has fascist-like laws in place, or if the eco is lower than -15 and the mayor is refusing to fix it.</li><li>Changed economy system so that when the mayor takes out money from the mayor funds manually, it slightly lowers the eco.</li><li>Changed deposit boxes so when the banker gets paid, some of that money goes to the mayor funds.</li><li>Removed inventory support for marketable drugs and added inventory support for coca seeds. (The seeds are the only part of the cocaine system that will have inventory support due to them being extremely tiny and easy to lose.)</li><li>Decreased health and armor mayor perks to 25 and slightly increased the price of both.</li><li>Fixed health NPC creating script errors when a player buys something.</li><li>Reduced the amount of money the mayor funds get from certain events.</li><li>Fixed the cocaine box weighing down vehicles if they have cocaine in them.</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/30",
		"date": "July 30, 2018",
		"info": "<ul><li>Changed police ammo so the F4 menu ammo is more expensive but cheaper ammo can be found at PD.</li><li>Replaced money printer with a different system. (Printers are tiered by what they're made of, bronze can be found by searching through a dumpster, silver and gold are at the contraband NPC, diamond has a random chance of being given when you rob the PD bank, platinum has a random chance of being given when you cash in money bags stolen from deposit boxes.)</li><li>Fixed store sign spawning under the map.</li><li>Fixed grammar error when players get a bonus paycheck due to good eco.</li><li>Fixed armor and health perks not working.</li><li>Added mayor funds to the eco HUD so players can keep track of what the mayor is spending money on.</li><li>Fixed arrest and unarrest sticks not always teleporting players. (For real I think its actually fixed this time.)</li><li>Fixed multiple of the same payday messages appearing at once.</li><li>Removed mayor from list of jobs that get paid for freeing prisoners.</li><li>Added cook items to the website item list.</li><li>Formatted the wallets of all players that are over 30k to 30k. (Also anyone who had over 30k in their ATM now has 0. Inventories were not touched.)</li><li>Replaced 3D2D textscreens above the ammo lockers with textscreens that match the rest of the NPCs.</li><li>Slightly increased the time it takes to grow plants.</li></ul>"
	},
	{
		"title": "Simple DarkRP Server Update 7/26",
		"date": "July 26, 2018",
		"info": "<ul><li>Gave police handcuffs and added them to the F4 menu for everyone else to buy.</li><li>Removed mob boss's ability to make drugs with the current system. (They can still use the default one.)</li><li>Reduced gun lab production costs to 20.</li><li>Gave medic ability to spawn weed plants that only spawn consumable weed for medical use.</li><li>Gave the mob boss an unarrest stick that pays them for freeing prisoners.</li><li>Cleaned up some rules to make them more clear.</li><li>Added rule stating that players need a valid reason to hire a hitman, doing it for no reason is not allowed.</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/26",
		"date": "July 26, 2018",
		"info": "<ul><li>Fixed banker and drug NPCs not spawning when the map loads.</li><li>Fixed rocks not respawning after they've been mined.</li><li>Fixed arrest stick not always arresting the player. (Prevents the arrest stick from being used unless the player isn't moving, it's the best fix I can come up with until I find something to fix the problem for good.)</li></ul>"
	},
	{
		"title": "HLU RP Server Update 7/24",
		"date": "July 24, 2018",
		"info": "<p>This update focuses on City 17 RP. Next update will include changes to BMRP:Classic, followed by BMRP:Cascade.</p><ul><li>Added resistance leader job that can help command any refugees who want to rebel against the combine.</li><li>Added iron generator that will spawn in a random place in the sewers.</li><li>Added official events to affect the gameplay. (Current events include zombie invasion, reactor explosion, race x invades citadel, and a headcrab canister failure.)</li><li>Made overwatch elite color to tan so the job into in the tab menu is easier to read.</li><li>Replaced government man teleporter with a new one that has more features and less bugs.</li><li>Added rp_industrial17.</li><li>Fixed rock and rubble health going out multiple decimal places.</li><li>Fixed rocks and rubble creating script errors when damaged by something thats not a player.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 7/23",
		"date": "July 23, 2018",
		"info": "<ul><li>Replaced gm_functional_flatgrass with gm_functional_flatgrass3.</li><li>Updated ACF to latest version.</li><li>Updated prone mod to latest version.</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/22",
		"date": "July 22, 2018",
		"info": "<ul><li>Changed name of federal agents to mayors bodyguard and removed car bomb defusal kit and arrest sticks from the mayors bodyguard's default weapons. (Description was also changed, see website for details.)</li><li>Replaced bounty hunter with IA (Internal Affairs) Agent as a government job that investigates mayor and police corruption. (See website for details.)</li><li>Fixed government officials only spawning with 2 weapons when the mayor buys a weapon perk.</li><li>Fixed players being able to dupe certain entities and NPCs.</li><li>Removed NPC teleport system. (Gliched out some NPCs, see below for the fix.)</li><li>Move drug and contraband NPCs to a place away from any camping spots on all maps.</li><li>Increased max charge for tow truck drivers to 1000.</li><li>Reduced banker alert amount to 10000. (Was 20k)</li><li>Added command that the IA agent can use to fire corrupt mayors.</li></ul>"
	},
	{
		"title": "Simple DarkRP Update 7/21",
		"date": "July 21, 2018",
		"info": "<ul><li>Fixed mob boss not being able to rob the bank.</li><li>Slightly reduced the price of the lockpick in the F4 menu. (I thought 1500 was a bit steep considering players usually get killed while lockpicking.)</li></ul>"
	},
	{
		"title": "HLU RP Server Update 7/19",
		"date": "July 19, 2018",
		"info": "<p>This is part 1 of 4 of the HLU RP server revamp. Everything posted below relates to Outland RP. Next update will include changes to City 17 RP, followed by BMRP, and lastly the new BMRP gamemode which now has an official name; BMRP: Cascade. I decided to make two seprate updates for the BMRP stuff so the server will still be playable even while the new gamemode is under construction.</p><ul><li>Added global timer to rebel rocket and combine portal codes to prevent players from ending the RP too early. (Timer is currently set to 30 minutes, players will get a notification once the time is up.)</li><li>Added lights to both cancel buttons so they can be seen better in the dark.</li><li>Added JI Defense Solutions for rebels to use. (Due to limitations with the crafting table, I had to make a separate NPC that sells the sentrys. The NPC is located in the rebel base.)</li><li>Added spawning system in the mines that randomly spawns ammo and battery caches for the rebel turrets.</li><li>Updated vehicle kill system to match the one on CityRP. (Vehicles now kill players if they are going around 50-60 MPH.)</li><li>Added system that randomly selects an object to hold the codes to the combine portal. Rebels must find the code, which is in one of five spots, and keep the code in order for the console at the combine base to work. (If the player holding the codes dies or changes to a combine job, the codes will randomly go back to one of the five locations.)</li><li>Added Groundwatch.</li><li>Fixed up code for rocket launch and cancel buttons so they are more optimised and account for every possible scenario in which the buttom may be pressed.</li><li>Replaced nadmod prop protection with the custom one from CityRP.</li><li>Added rebel door group for doors at the rebel base.</li><li>Removed civilian job and made the refugee the default job. (Citizens aren't really a thing in the outlands since the refugees are mostly loyal citizens who were forced out of the city when the citadel first exploded.)</li><li>Fixed resistance leader not being part of the rebel group chat.</li><li>Removed vehicles from the rebel F4 menu and made it so jeeps randomly spawn around the map.</li></ul>"
	},
	{
		"title": "CityRP Server Update 7/14",
		"date": "July 14, 2018",
		"info": "<p><ul><li>Added feature to certain NPCs that teleports them around to avoid players always camping near them. (Affects the drug, contraband, banker, and smuggle sell NPCs.)</li><li>Added ability to cook that allows them to cook the fish that they catch. (The cook can no longer sell the fish he catches to the NPC unless he uses the cages. The fishing rod for the cook is now only used to collect fish to be put on the stove.)</li><li>Reduced payout for marketable meth and the amount of times a money printer can be upgraded.</li><li>Fixed government jobs not being able to drop certain weapons.</li><li>Changed the font of the HUD economy bar and made the location icon smaller to make it look neater.</li><li>Fixed money printer not spawning a fire when it overheats.</li><li>Updated 3D2D textscreens.</li></ul><p>NOTE: No other major features will be added to CityRP until the revamps of HLU RP and Crime RP are done. Until then the only updates you can expect for this server will be bug fixes and balance adjustments.</p>"
	},
	{
		"title": "CityRP Server Update 7/11",
		"date": "July 11, 2018",
		"info": "<p>Note: More features like the fish cooking and NPC teleports are coming next update, I wanted to get this update out and everything was done but those two so I sepratated them.</p><ul><li>Added boat NPC that spawns boats in large bodies of water. (Located next to the fish NPC.)</li><li>Changed the overhead text of all NPCs to have the same style. (Style is the same as the mayor NPC and it matches the HUD so thats why I did it.)</li><li>Replaced economy system with a new one that offers more customization options.</li><li>Slightly increased price of money printer upgrades.</li><li>Fixed both meth pots having the same ID, causing only one of them to appear in the contraband shop.</li><li>Fixed emergency vehicles sometimes not being removed after it's owner changed jobs.</li><li>Modified the vehicle script of the flatbed truck so it drives better.</li><li>Replaced SWAT's deagle with a FiveSeven. (Done for balancing, deagle can still be given to gov jobs if the mayor purchaes the right perk.)</li><li>Updated the loading screen rules to match those on the website.</li><li>Modified the /fixeco command to work the new economy system. (Takes away eco points in exchange for bank money.)</li><li>Added bounty hunter job. (See website for details.)</li><li>Changed models of some NPCs to models that relate to the job they are for. (Ex: police NPC is now an actual police model instead of Odessa.)</li><li>Fixed HUD text for parade and purge not showing up.</li><li>Fixed rp_newexton2 not having jail spawns.</li><li>Fixed arrest stick not always teleporting players to jail the first time it's used.</li></ul>"
	},
	{
		"title": "CityRP Server Update 6/14",
		"date": "June 14, 2018",
		"info": "<ul><li>Fixed car dealer creating script errors when a player entered a vehicle.</li><li>Fixed money bags from the government bank falling through vehicles.</li><li>Fixed government bank only requiring one active cop to rob.</li><li>Limited the amount of meth and cocaine stoves that can be spawned on the map at one time to 2 each.</li><li>Limited the amount of money printers that can be spawned on the map at one time to 4.</li></ul>"
	},
	{
		"title": "CityRP Server Update 6/12",
		"date": "June 12, 2018",
		"info": "<ul><li>Added business sign to inventory support.</li><li>Replaced nadmod prop protection with a custom one that works with falco's prop protection to block entities from being duped and to block players from physgunning world entities.</li><li>Increased max deposit box invest amount to 20000.</li><li>Changed description of cocaine barrel on the website to make it more clear.</li><li>Fixed SWAT commander still not having access to F4 menu ammo.</li><li>Increased the amount of hunger that pizza from the pizza system restores.</li><li>Fixed Federal Agents not having access to the agenda.</li><li>Removed vice mayor job. (Fixes problems with the economy system such as the mayor's paychecks not affecting the bank and opportunities getting stuck in a loop.)</li><li>Fixed weapon perk UI creating script errors when opened.</li><li>Changed the banker computer so robbable jobs (Civilian, Tow Truck Driver, News Cameraman) can see what's in each deposit box.</li><li>Fixed rocks still having physics enabled after being mined. (Lets players drive their cars where the rock used to be, also fixes iron being launched in all directions after mining.)</li><li>Added perma-propped vans for deposit box robbing to every map. (Located at the nearest parking lot to the banker NPC.)</li><li>Fixed money printer not being able to be put into the inventory.</li><li>Shortened Emergency Responder Commander to ER Commander so the name fits on the new HUD.</li></ul>"
	},
	{
		"title": "CityRP Server Update 6/10",
		"date": "June 10, 2018",
		"info": "<ul><li>Changed vehicle kill script so it detects vehicle speed instead of blocking vehicle damage completely.</li><li>Added RT camera.</li><li>Fixed SWAT commander not having access to government chat, government owned doors, government vehicle station, and F4 menu ammo.</li><li>Disabled ammo being taken from the player after a weapon is dropped.</li><li>Fixed money bags being able to be duped.</li><li>Removed rp_paralake_city_v3. (Map being added to a different server in the future.)</li><li>Changed contraband and supermarket UI so the menu doesn't close after a player buys something.</li><li>Moved ATMs and item bank on rp_rockford_v2b so the banker has more room to fortify the vault entrance.</li><li>Fixed players not being able to drop weapons.</li><li>Increased banker interest payment to that of what the depositing player's interest is.</li><li>Updated Wiremod.</li></ul>"
	},
	{
		"title": "CityRP Server Update 6/3",
		"date": "June 3, 2018",
		"info": "<p>Well.....it took 3 weeks but here it is, the biggest update in CityRP history. This update includes many additions to gameplay as well as many balancing changes, mainly between civilian jobs and government jobs.</p><ul><li>Fixed courier NPC UI showing up for all players.</li><li>Reduced the cooldown timer for the courier NPC.</li><li>Increased the courier reward from 2000 to 3000.</li><li>Reduced the number of active police jobs required for a police bank robbery from 2 to 1.</li><li>Gave emergency responders a defib for reviving players. (Reviving system is actually good this time, dont worry)</li><li>Fixed the courier NPC cooldown timer being activated when a player opened the menu but didn't accept the package.</li><li>Removed some foods from the cook F4 menu.</li><li>Added pizza system.</li><li>Added business sign from pizza system to NPC shop. (Simple sign that displays open or closed.)</li><li>Added TDM Hummer pack. (Due to popular request.)</li><li>Added timer to the spikestrip that removes the entity and gives it back to the player who spawned it if the strip was on the ground for 10 minutes.</li><li>Removed spikestrip pickup timer.</li><li>Replaced 3D signs addon with a new sign addon. (New signs are better looking and are easier to work with.)</li><li>Added SWAT riot shield. (Restricted to only one job, see below for details.)</li><li>Replaced old cocaine system with a new and more advanced one. (Pay is good but the cooking can get pricy if you don't know what you're doing.)</li><li>Added payday deposit box system for bankers. (Allows bankers and civilians to make interest off of storing money in the boxes.)</li><li>Replaced detective SWEP with evidence system. (Evidence caches will spawn when a player dies if a detective is on the server, the detective will have to research the cache in order to find the killer's name.)</li><li>Replaced government bank with one that requires players to transport bags to the banker NPC. (Police can return bags to the bank if they are found.)</li><li>Added system that allows police officers to get paid if they return an illegal item to the PD as evidence. (Includes most contraband entities, weapons currently not included. Prices were also carefully set to avoid abuse, so if you try to abuse this you'll actually be losing money.)</li><li>Added SWAT Commander job. (Able to command swat units, takes orders from the police chief and mayor, has no correlation with federal agents, only police job to have a swat shield, doesn't have grenades, has 25 more armor than normal units.)</li><li>Increased max microwaves allowed to be spawned by the cook to 2.</li><li>Gave Undercover Officer the disguise SWEP.</li><li>Added system that requires government jobs to stay at the drug NPC for 30 seconds before getting the cash. (Cash spawns as a physical entity so you can't leave the NPC and expect to get the money.)</li><li> Added random chance to be wanted when selling drugs as a civlian. (Currently a 30% chance.)</li><li>Replaced 3D stream radio with the old DJ system. (Apparently it works again with the new gmod update.)</li><li>Added system that notifies police and bankers about suspicious bank activity. (Currently set to be triggered when a wallet value suddenly changes by 20,000 or more.)</li><li>Removed food job category and moved the cook job to the citizen category in the F4 menu.</li><li>Fixed lawboards displaying a default law no matter what the mayor set that law to.</li><li>Replaced default DarkRP HUD with a new one. (Includes new features such as a speedometer and a ping displayer, HUD is slightly bigger than the old one but I was personally able to quickly get used to it.)</li><li>Updated the colors of the F1 and F4 menus to match the new HUD.</li><li>Fixed courier NPC spawning in random places.</li><li>Updated StormFox, Gmod Legs 3, and the LW Chevy Impala pack. (The stormfox update seems to cause more lag, if I get complains I will revert to an older version until the lag is fixed.)</li><li>Fixed the News Cameraman and Tow Truck Driver jobs being in a seprate category from the rest of the citizen jobs.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 5/28",
		"date": "May 28, 2018",
		"info": "<ul><li>Added Murder gamemode.</li><li>Removed old TTT scripts. (Won't affect gameplay, had some old scripts left on the server that didn't work.)</li></ul><p>Note: I'll be holding a vote shortly regarding the Breach gamemode.</p>"
	},
	{
		"title": "Sandbox Server Update 5/18",
		"date": "May 18, 2018",
		"info": "<ul><li>Removed Sligwolf's Garbage Truck, Forklift, and Tank.</li><li>Removed gm_freespace_13.</li><li>Removed Dodge Ram Outdoorsman.</li><li>Removed gm_construct_extended.</li><li>Removed gm_excess_islands.</li><li>Removed phys_temple.</li></ul><p>Note: This update was done to remove some unused/rarely used addons in hopes to fix some players not being able to load onto the server due to low memory. You can unsubscribe from all of these addons except the Garbage Truck and Forklift, those two are still being used on one of the servers.</p>"
	},
	{
		"title": "CityRP Server Update 5/6",
		"date": "May 6, 2018",
		"info": "<ul><li>Added new items to the website item list and removed items that were removed from the server.</li><li>Updated rp_pinescity_v2b.</li><li>Added rule that states that one-way doors are not permitted to be used.</li><li>Replaced door charge with premium lockpick. (Picks doors twice as fast as the normal one, doesn't make noise, doesn't set off car alarms.)</li><li>Added disguise kit. (Allows you to change your player model to that of any job, lasts 3 minutes.)</li><li>Added large metal detector. (Old metal detector that was on the server a while back, checks players for weapons in their weapon slots as well as their inventory. Doesn't require a player to operate.)</li><li>Added leash handcuffs to contraband NPC. (Allows players to drag other players.)</li><li>Fixed players not owning vehicles that they spawn.</li><li>Removed the unarrest stick from the metal detector whitelist.</li><li>Added car alarm system. (Alarms go off if a car is broken into with the normal lockpick.)</li><li>Added courier system. (Players can get paid by delivering packages to random players.)</li><li>Wiped inventory system data files. (See discussion for more details, money will be wiped next session.)</li></ul>"
	},
	{
		"title": "Sandbox Server Update 4/16",
		"date": "April 16, 2018",
		"info": "<ul><li>Added ACF.</li><li>Added tank track tool.</li><li>Added visual clip tool.</li><li>Added SProps.</li><li>Removed Ford Falcon. (Optimization.)</li><li>Removed Subaru Impreza. (Optimization.)</li><li>Removed fireworks tool. (Removed from workshop.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 4/7",
		"date": "April 7, 2018",
		"info": "<ul><li>Replaced DJ system with 3D stream radio. (DJ system doesn't work anymore, returns an HTML error that I can't fix.)</li><li>Removed DJ items from the NPC shop.</li><li>Updated police bank vault system.</li><li>Updated car bomb. (Should fix script errors that some people got.)</li><li>Decreased ATM loan amounts. (To make the banker job more useful.)</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/23",
		"date": "March 23, 2018",
		"info": "<ul><li>Fixed '/fixeco' command not working.</li><li>Fixed the CW grenade launcher attachment being unrestricted by default.</li><li>Gave federal agents the car bomb defuser and car bomb scanner.</li><li>Restricted certain CW scopes that can be crafted.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 3/13",
		"date": "March 13, 2018",
		"info": "<ul><li>Updated Simfphy's Lua Vehicle Base.</li><li>Added Simfphy's Armed Vehicles pack.</li><li>Added GTA V dump truck.</li><li>Added Toyota Sprinter Trueno.</li><li>Removed GTA IV vehicles.</li><li>Removed some pointshop hats that showed up as errors even with the content pack installed.</li><li>Added Pepsiman playermodel.</li><li>Fixed some vehicles creating script errors when players spawned in.</li><li>Fixed WW2 explosives creating script errors when fired.</li><li>Disabled restrictions on TF2 ragdolls. (Not sure why that was still there.)</li><li>Replaced rp_bigcity with gm_bigcity. (Apparently rp_bigcity was removed from the workshop and I never realised until now.)</li><li>Fixed pointshop accessories not working.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/10",
		"date": "March 10, 2018",
		"info": "<ul><li>Added more NPC shops to rp_newexton2.</li><li>Gave police chief and police officer jobs an MP5.</li><li>Replaced SWAT's MP5 with an AR-15.</li><li>Replaced detective's M1911 with a revolver.</li><li>Gave SWAT a knife and smoke grenade.</li><li>Replaced detective's police handcuffs with the weaker handcuffs.</li><li>Modified the revolver so it takes standard pistol ammo instead of 357 ammo.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/8",
		"date": "March 8, 2018",
		"info": "<ul><li>Added rp_newexton2. (Last map this time I promise. Maybe.)</li><li>Decreased the time it takes for another mayor opportunity to show up.</li><li>Removed Mercedes Sprinter vans.</li><li>Removed Chevy El Camino.</li><li>Removed CW P228.</li><li>Removed LW GMC pack.</li><li>Replaced undercover officer's P228 with a P99.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/3",
		"date": "March 3, 2018",
		"info": "<ul><li>Fixed crafting table creating script errors when damaged.</li><li>Added rule stating that players cannot suicide unless they have been rp'ing as a suicidal character for the entirety of that characters lifetime. (Full explanation on the website.)</li><li>Increased number of news TVs that can be spawned.</li><li>Added default law stating that police can weapon check anyone they feel is a potential threat.</li><li>Added chat command for the mayor to use that takes money from the government bank and converts it to reputation points. (Command is /fixeco.)</li><li>Fixed ATM autospawn command not working.</li><li>Added ore rocks to rp_pinescity_v2b.</li><li>Disabled 90% tax restriction. (Meaning mayors can set taxes to 100% again.)</li><li>Added autospawn system for government bank money stacks.</li><li>Added ammo lockers, banker's check machine, and vending machines to government bank support.</li><li>Fixed rifle ammo price being 30 instead of 50.</li></ul>"
	},
	{
		"title": "CityRP Server Update 3/1",
		"date": "March 1, 2018",
		"info": "<ul><li>Updated rp_pinescity_v2b.</li><li>Added ability to certain NPCs and items to take and add money to and from the government bank.</li><li>Added more material types to list of what fire can spread on.</li><li>Increased damage fires does to non-firefighters and vehicles.</li><li>Disabled ability to damage players with the fire axe.</li><li>Fixed players not being teleported back to spawn when unarrested.</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/27",
		"date": "February 27, 2018",
		"info": "<ul><li>Decreased all vehicles prices by 15%.</li><li>Changed function of cocaine and meth systems so the player can choose whether to make consumable or marketable drugs.</li><li>Removed some cars that were rarely used.</li></ul>"
	},
	{
		"title": "Simple DarkRP Server Update 2/26",
		"date": "February 26, 2018",
		"info": "<ul><li>Fixed server not loading DarkRP.</li><li>Fixed mayors not being demoted back to citizen when they die.</li><li>Fixed shipments being duplicated in the gun dealer's F4 menu.</li><li>Fixed exploit where players could duplicate drug items.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 2/26",
		"date": "February 26, 2018",
		"info": "<ul><li>Fixed exploit where players could duplicate crafting materials.</li><li>Removed '(Outland RP)' tags from the rebel jobs.</li><li>Fixed manhacks not spawning at the Outland RP combine base.</li><li>Added cooldown timer to Outland RP rocket launch.</li><li>Removed combine force SWEP.</li><li>Added combine door charge to City 17 RP and Outland RP.</li><li>Fixed combine and rebel jobs not spawning at their bases on City 17 RP and Outland RP.</li><li>Changed function of Outland RP rocket so once the timer ends it closes the server instead of reverting back to BMRP.</li><li>Changed function of Outland RP combine base console so instead of closing the server like the rocket, it changes the map to gm_atomic.</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/23",
		"date": "February 23, 2018",
		"info": "<ul><li>Fixed error with car dealer system that broke the gamemode.</li><li>Increased meth profits to $8000.</li><li>Added function to unarrest stick that gives criminals a money reward for freeing prisoners.</li><li>Added rule stating that players can stay in jail for no more than 20 minutes real-time.</li></ul>"
	},
	{
		"title": "Sandbox Server Update 2/22",
		"date": "February 22, 2018",
		"info": "<ul><li>Added gm_balkans.</li><li>Replaced old WW2 weapon pack with a new one.</li><li>Updated Sligwolf's Western Loco.</li><li>Updated Sligwolf's Garbage Truck.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 2/20",
		"date": "February 20, 2018",
		"info": "<ul><li>Added entity to Xen that spawns a special type of Race X or Half-Life beta NPC when certain items are placed on it. (The entity is in Xen on every BMRP map, it glows red to stand out from similar-looking map decorations.)</li><li>Added Resistance Leader job to Outland RP.</li><li>Changed rocket launch button function so the Resistance Leader has to press the buttom in order for the rocket to launch.</li><li>Changed refugee spawn on City 24 to the destroyed part of the city across the bridge.</li><li>Added more overwatch voice commands to the Earth Administrator and City Administrator jobs.</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/18",
		"date": "February 18, 2018",
		"info": "<ul><li>Added unarrest baton to the contraband NPC.</li><li>Added weapon attachments to the crafting table.</li><li>Removed items from the crafting table that can be bought.</li><li>Added default law stating that grenade launcher attachments are illegal.</li><li>Updated items page in the rules and guidelines.</li><li>Changed the function of the arrest stick so it teleports the player to jail, but doesn't activate a jail time limit.</li><li>Added rule stating that civilian unarrest sticks can only be used to break someone out of jail. (And not to teleport players around the map.)</li><li>Added link to types of mayors guide on the rules and guidelines.</li><li>Moved car bomb from the contraband NPC to the crafting table.</li><li>Replaced rp_pinescity_v1x with rp_pinescity_v2b.</li></ul>"
	},
	{
		"title": "Clone Wars RP Server Update 2/11",
		"date": "February 11, 2018",
		"info": "<ul><li>Fixed repair tools repairing ship parts above their max health.</li><li>Made it so damageable ship entities display a chat message when destroyed.</li><li>Added Nombat Star Wars music.</li><li>Changed spawn locations of republic and CIS jobs to the ship bridges on rp_venator_providence_battle.</li><li>Fixed the rocket launcher creating script errors when used.</li></ul>"
	},
	{
		"title": "CityRP Server Update 2/5",
		"date": "February 5, 2018",
		"info": "<ul><li>Fixed cocaine setting running speed to the sandbox default instead of the DarkRP default after the drug effect is over.</li><li>Fixed players still being able to tase NPCs.</li><li>Slightly increased health of the smuggle truck.</li><li>Added precision alignment tool.</li></ul>"
	},
	{
		"title": "Various Gamemodes Server Update 1/31",
		"date": "January 31, 2018",
		"info": "<ul><li>Removed Breach gamemode. (Will be adding the Breach 2 gamemode once it's released.)</li><li>Removed School RP gamemode.</li><li>Replaced ttt_nuclear_power_v2 with ttt_nuclear_power_v4_fix.</li><li>Added The Stalker gamemode. (Explanation of how it works can be found on the website.)</li></ul>"
	},
	{
		"title": "Sandbox Server Update 1/30",
		"date": "January 30, 2018",
		"info": "<ul><li>Added Star Wars weapons.</li><li>Removed FA:S weapons.</li><li>Added CW RPG, P228, Knife, and TRG-42 Sniper.</li><li>Updated Sligwolf's Western Loco.</li><li>Removed gm_construct_15.</li><li>Removed gm_flatbuild_pbs_2015_dev. (Old map that we only played on like twice.)</li><li>Added Star Wars Vehicles Episode 2.</li><li>Added DarkRP CS:S weapons.</li><li>Added Smartsnap.</li><li>Removed Caterham R500.</li><li>Removed some of the Tornado maps.</li><li>Added Fightspace3b map. (Was on the server before, not sure why it was removed.)</li></ul>"
	},
	{
		"title": "Simple DarkRP Server Update 1/29",
		"date": "January 29, 2018",
		"info": "<ul><li>Added rp_locality.</li><li>Added MP5 shipment to police chief F4 menu.</li><li>Added MAC-10 shipment to mob boss F4 menu.</li><li>Made it so players can chat while dead.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 1/28",
		"date": "January 28, 2018",
		"info": "<ul><li>Added console command that spawns NPC in Xen on BMRP maps.</li><li>Added random fire spawn support to the rest of the BMRP maps.</li><li>Fixed xen trees and crystals creating script errors when damaged by an NPC.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 1/27",
		"date": "January 27, 2018",
		"info": "<ul><li>Increased the number of crafting tables and mining carts refugees and citizens can spawn.</li><li>Reduced the prices of certain F4 menu items in all 3 gamemodes.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/19",
		"date": "January 19, 2018",
		"info": "<ul><li>Slightly increased smuggle payouts.</li><li>Fixed smuggle NPC on rp_paralake_city_v3 spawning the truck inside the sidewalk.</li><li>Removed one time use medkit from Emergency Responder job.</li><li>Fixed detective job being considered a medic job by DarkRP.</li></ul>"
	},
	{
		"title": "Clone Wars RP Server Update 1/17",
		"date": "January 17, 2018",
		"info": "<ul><li>Added heavy droid and clone units.</li><li>Fixed super battledroid job not having a weapon.</li><li>Fixed damagable ship entity health going negative.</li><li>Fixed damagable ship entities not returning to their normal color after being healed.</li><li>Added land vehicle spawners to certain maps.</li><li>Increased default health of wookiee job to 150.</li><li>Added marine droid and clone units.</li><li>Fixed vulture droid and tri-fighter not spawning from the ship spawners.</li><li>Fixed players being able to spawn star wars vehicles from the spawn menu.</li><li>Disabled healing effect on health machines.</li><li>Increased how fast the repair tool repairs damagable ship entities.</li><li>Gave battledroid commander a pistol and a more lore-friendly rifle.</li><li>Replaced battledroid pistol with a rifle.</li><li>Fixed some jobs not having force power abilities.</li><li>Removed old mining entities from the F4 menu.</li><li>Added rp_tatooine_dunsea_v1 map.</li></ul>"
	},
	{
		"title": "CityRP Server Update 1/15",
		"date": "January 15, 2018",
		"info": "<ul><li>Added detective SWEP that will tell detectives the killer of a player.</li><li>Merged the firefighter and paramedic jobs to create one emergency responder job.</li><li>Changed the fire chief job name to Emergency Responder Commander.</li><li>Updated rules and guidelines according to the job merging.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 1/15",
		"date": "January 15, 2018",
		"info": "<ul><li>Changed new life rule to the fair game rule. (Same as CityRP)</li><li>Changed fear RP rule to make it more simple. (Same as CityRP)</li><li>Fixed snark and penguin SWEPs creating script errors when used.</li><li>Added new crafting recipies from last update to the website.</li><li>Added research SWEP resources to the content pack.</li><li>Fixed weapons engineer crafting table not including some of the crafting materials.</li></ul>"
	},
	{
		"title": "Crime RP Server Update 1/15",
		"date": "January 15, 2018",
		"info": "<ul><li>Added different spawns for police and criminals on rp_rockford_open.</li><li>Increased damage for sniper rifles.</li><li>Reduced price of pistol shipments for criminals.</li><li>Fixed bank vault not spawning on rp_rockford_open.</li><li>Fixed players being able to walk through police cars.</li><li>Fixed smuggle system not working.</li><li>Added rule stating that sniper rifles must be used from a distance.</li><li>Added rule stating that gang members must all be in gang 1 if there is a low player count unless the members have a valid reason to split apart.</li><li>Changed new life rule to the fair game rule. (Same as CityRP.)</li><li>Changed fear RP rule to make it more simple. (Same as CityRP.)</li><li>Added mayor job for special events. (Doesnt work like a normal mayor would, this job is only to be used in superadmin-activated events.)</li><li>Moved city hall NPC to the fire station on rp_rockford_open.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 1/14",
		"date": "January 14, 2018",
		"info": "<ul><li>Fixed prop protection tool restriction system not working. (Still a little glitchy but it's the best I can do for now.)</li><li>Increased max Gterminals.</li><li>Fixed players not being able to pocket certain items from the F4 menu.</li><li>Removed tip jar.</li><li>Added 'research' swep that allows scientist jobs to find out what certain entities are.</li><li>Added Half-Life alarm sound to content pack and removed Black Mesa Alarms addon from the collection.</li><li>Fixed GTerminal not showing up in the F4 menu for some BMRP jobs.</li><li>Gave security jobs the battering ram.</li><li>Changed /bmlockdown command back to it's original /lockdown command.</li><li>Added biological weapons to the biochemist crafting table.</li><li>Fixed service official having a security guard model as a playermodel option.</li><li>Fixed random fire spawn system not working on BMRP maps.</li><li>Fixed rifle shipment showing up in it's own category in the weapon specialist F4 menu.</li><li>Removed M249 from the weapon specialist F4 menu and added it to the HECU base weapon supply crate.</li><li>Removed unused ammo from the BMRP F4 menu.</li><li>Fixed some ammo being in the entities tab instead of the ammo tab in the F4 menu.</li><li>Added police abilities to the City 17 and City 24 combine jobs. (Basically lets them warrant other players, no major changes to the job abilities.)</li><li>Disabled flare gun damage.</li><li>Modified the black mesa alarm entities so it displays who activated it in chat.</li><li>Added weapons engineer crafting table.</li><li>Added custom entities to research and development F4 menu that can interact with researchable entities. (With more to come in the future.)</li><li>Reduced the time it takes to mine a Xen tree.</li></ul>"
	},
	{
		"title": "CityRP Server Update 12/30",
		"date": "December 30, 2017",
		"info": "<ul><li>Removed binocular SWEPs. (They were sorta pointless since players can use the camera to zoom in on something.)</li><li>Slightly nerfed the AK-74.</li><li>Added harvested farm food to inventory support.</li><li>Added car bomb to contraband NPC.</li><li>Added default law stating that turning right at red lights is allowed.</li><li>Gave Police Chief, Police Officer, and SWAT jobs a car bomb scanner and car bomb defuser.</li><li>Removed spikestrip from Undercover Officer job.</li><li>Made farm seeds stackable in the inventory.</li><li>Removed 2000 Ford Mustang Cobra R.</li><li>Fixed perma props not spawning.</li></ul>"
	},
	{
		"title": "CityRP Server Update 12/27",
		"date": "December 27, 2017",
		"info": "<ul><li>Slightly changed server name.</li><li>Turned New Life Rule into the Fair Game Rule (Check the website for an explanation.)</li><li>Moved store item spawning rule to the default laws.</li><li>Removed music from loading screen. (Nothing against the song, it just got bland listening to the same song every time.)</li><li>Fixed up various server and community rules to make them more understandable.</li></ul>"
	},
	{
		"title": "HLU RP Server Update 12/23",
		"date": "December 23, 2017",
		"info": "<ul><li>Replaced BMRP military base weapon spawners with custom shop entity.</li><li>Disabled earthquakes for City 17 RP and Outland RP.</li><li>Added satchel charge shipment to the Weapon Specialist F4 menu.</li><li>Fixed Service Official fire extinguisher removing itself when used.</li><li>Added wiremod support for gTerminal.</li></ul>"
	},
	{
		"title": "Star Wars RP Server Update 12/14",
		"date": "December 14, 2017",
		"info": "<ul><li>Removed non-civilian Old Republic jobs.</li><li>Added Clone Wars jobs.</li><li>Turned the server from an open-world-based RP to a mission-based RP. (Not going to list specifics, the whole server was basically redone.)</li><li>Removed old addons that weren't needed after the revision.</li></ul>"
	}
]
